{"ns": "default", "id": "c30a58e035fcf90c353677e2e90e8f3069b676f3126a185fd5797c8a2c1eadf7", "title": "Admin Portal", "text": "Admin Portal\nThe SPICE Admin Portal is a powerful tool that enables administrators to manage users, facilities, workflows, medication databases, and lab test databases, and customize the platform at the region and account levels.\nKey Features\nUser Management: The Admin Portal allows administrators to manage user accounts, including creating, editing, and deactivating user profiles. Administrators can assign roles and permissions to ensure proper access control.\nFacility Management: Administrators have the ability to set up and maintain facilities within the SPICE platform. This includes creating new facilities, managing facility details, and assisting with account setups and resets.\nWorkflow Customization: The Admin Portal provides flexible workflows with customizable clinical capabilities", "source": "kb\\Admin Portal.docx", "chunk_index": 0, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "bcbf50c866da1c6135700c8f8858242e37613c32ffad9a3c9167eee16fa5ed7f", "title": "Admin Portal", "text": " workflows with customizable clinical capabilities. Administrators can on/off clinical workflows according to specific requirements, such as hypertension, diabetes, mental health, maternal health, HIV, TB, and malaria.\nMedication Database Management: The Super Admin, who has master administrative privileges, is responsible for managing the medication database. They can add country-relevant medication information to the web portal database, ensuring accurate and up-to-date medication records.\nRegion-Level Customization: The SPICE platform allows for region-level customization, empowering administrators to configure specific settings and features based on the geographical region they are operating in. This ensures alignment with local healthcare practices and guidelines.\nAccount-Level Workfl", "source": "kb\\Admin Portal.docx", "chunk_index": 1, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "42de1869fd03358e76247b60ae7e3e1e3d0e4ea98f94d22d6e79f5e2a8f4a82e", "title": "Admin Portal", "text": "are practices and guidelines.\nAccount-Level Workflow Customization: Administrators can customize workflows at the account level, adapting the platform to suit the unique requirements of each organization or institution. This allows for tailored workflows that align with specific healthcare processes and practices.\nUser Roles\nThe SPICE Admin Portal supports different user roles with varying levels of access and responsibilities. These roles include:\nSuper Admin: The Super Admin is the master administrator responsible for setting up regions, accounts, customization, and user management. They have full control over all aspects of the Admin Portal and can perform all administrative functions.\nRegional Admin: The Regional Admin manages accounts in specific regions and assists with facility setu", "source": "kb\\Admin Portal.docx", "chunk_index": 2, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "738e56d0bdf737b23b2bef740264979bc8256735f0bd0e6a8f1e1ef99bee0eb7", "title": "Admin Portal", "text": "in specific regions and assists with facility setup, maintenance, and account management. They have the authority to perform account-level administrative tasks and provide support to local administrators.\nAccount Admin: The Account Admin is responsible for managing a specific account within the SPICE platform. They handle account setup, operating unit management, and user creation. Account Admins can perform administrative functions within their assigned accounts.\nOU Admin: The OU Admin operates at the Operating Unit (OU) level and has administrative privileges within their assigned OU. They can create sites, groups, and users, and perform administrative tasks specific to the OU they manage.", "source": "kb\\Admin Portal.docx", "chunk_index": 3, "chunk_count": 4, "tokens_estimate": 700, "created_at": 1766077251}
{"ns": "default", "id": "58435a26bab7de889aec59b293af73692c527596c6aca5621f9d823c58cc3bad", "title": "Admin Portal", "text": "Admin Portal \nThe SPICE Admin Portal is a powerful tool that enables administrators to manage users, \nfacilities, workflows, medication databases, and lab test databases, and customize the \nplatform at the region and account levels. \nKey Features \n• User Management: The Admin Portal allows administrators to manage user \naccounts, including creating, editing, and deactivating user profiles. \nAdministrators can assign roles and permissions to ensure proper access \ncontrol. \n• Facility Management: Administrators have the ability to set up and maintain \nfacilities within the SPICE platform. This includes creating new facilities, \nmanaging facility details, and assisting with account setups and resets. \n• Workflow Customization: The Admin Portal provides flexible workflows with \ncustomizable cl", "source": "kb\\Admin Portal.pdf", "chunk_index": 0, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "70d833d7aaa6cc06b45b1cbf8a26f8194912c09e8dd6ed69bbd0731a858d1555", "title": "Admin Portal", "text": " provides flexible workflows with \ncustomizable clinical capabilities. Administrators can on/off clinical workflows \naccording to specific requirements, such as hypertension, diabetes, mental \nhealth, maternal health, H IV, TB, and malaria. \n• Medication Database Management: The Super Admin, who has master \nadministrative privileges, is responsible for managing the medication database. \nThey can add country -relevant medication information to the web portal \ndatabase, ensuring accurate and up -to-date medication records. \n• Region-Level Customization: The SPICE platform allows for region -level \ncustomization, empowering administrators to configure specific settings and \nfeatures based on the geographical region they are operating in. This ensures \nalignment with local healthcare practices", "source": "kb\\Admin Portal.pdf", "chunk_index": 1, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "f7138e1348e5c344bceb1fc1eeac978a7e279a47eba7ed2d48f6c38d0798aebf", "title": "Admin Portal", "text": "ensures \nalignment with local healthcare practices and guidelines. \n• Account-Level Workflow Customization: Administrators can customize \nworkflows at the account level, adapting the platform to suit the unique \nrequirements of each organization or institution. This allows for tailored \nworkflows that align with specific health care processes and practices. \nUser Roles \nThe SPICE Admin Portal supports different user roles with varying levels of access and \nresponsibilities. These roles include: \nSuper Admin: The Super Admin is the master administrator responsible for setting up \nregions, accounts, customization, and user management. They have full control over all \naspects of the Admin Portal and can perform all administrative functions.\n\nRegional Admin: The Regional Admin manages accounts", "source": "kb\\Admin Portal.pdf", "chunk_index": 2, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "86ea6706972f7ef10ab6cd91ba1b37f0fbc8bc739bb94ce840820bbcaeb5be68", "title": "Admin Portal", "text": "egional Admin: The Regional Admin manages accounts in specific regions and assists \nwith facility setup, maintenance, and account management. They have the authority to \nperform account -level administrative tasks and provide support to local administrators. \nAccount Admin: The Account Admin is responsible for managing a specific account \nwithin the SPICE platform. They handle account setup, operating unit management, and \nuser creation. Account Admins can perform administrative functions within their \nassigned accounts. \nOU Admin: The OU Admin operates at the Operating Unit (OU) level and has \nadministrative privileges within their assigned OU. They can create sites, groups, and \nusers, and perform administrative tasks specific to the OU they manage.", "source": "kb\\Admin Portal.pdf", "chunk_index": 3, "chunk_count": 4, "tokens_estimate": 761, "created_at": 1766077251}
{"ns": "default", "id": "3ec92296e6284caf6f8047fea95eb055c24432041ec9f1b8a7558b13215f9fe0", "title": "1. Admin Tab: This section is usually for managing users, settings, and system configurations.", "text": "1. Admin Tab: This section is usually for managing users, settings, and system configurations.\nCommon actions include:\nAdding or removing users\nChanging user roles/permissions\nUpdating system settings\nManaging security and access controls\n2. Reports Tab: This is where you can generate, view, and download reports.\nTypical functionalities:\nViewing pre-built reports\nCustomizing reports with filters\nExporting reports (e.g., CSV, PDF)\nScheduling automatic report generation\n3. Insights Tab: This section provides analytics and visual dashboards to help you understand trends and performance.\nKey features might include:\nInteractive charts and graphs\nKPIs and performance metrics\nPredictive analytics\nData exploration tools", "source": "kb\\Admin Workflows.docx", "chunk_index": 0, "chunk_count": 1, "tokens_estimate": 721, "created_at": 1766077251}
{"ns": "default", "id": "b1bbeba8da09827ec9aa41ebec873e6a144bd1f5ac930681105a69d966fa7298", "title": "1. Admin Tab: This section is usually for managing users, settings, and system", "text": "1. Admin Tab: This section is usually for managing users, settings, and system \nconfigurations. \nCommon actions include: \n• Adding or removing users \n• Changing user roles/permissions \n• Updating system settings \n• Managing security and access controls \n2. Reports Tab: This is where you can generate, view, and download reports. \nTypical functionalities: \n• Viewing pre -built reports \n• Customizing reports with filters \n• Exporting reports (e.g., CSV, PDF) \n• Scheduling automatic report generation \n3. Insights Tab: This section provides analytics and visual dashboards to help you \nunderstand trends and performance. \nKey features might include: \n• Interactive charts and graphs \n• KPIs and performance metrics \n• Predictive analytics \n• Data exploration tools", "source": "kb\\Admin Workflows.pdf", "chunk_index": 0, "chunk_count": 1, "tokens_estimate": 765, "created_at": 1766077251}
{"ns": "default", "id": "f36ee2054889f9d4b0b94db85fcfc2a7d1fd790dad06f74f2f398d7a40f33a0e", "title": "Architecture Diagram", "text": "Architecture Diagram\nThe SPICE platform supports the HL7 FHIR standard.\n1. External EHR/EMR\nRepresents external Electronic Health Record (EHR) or Electronic Medical Record (EMR) systems. These are external healthcare data systems that provide or consume patient-related information, enabling data interoperability with the SPICE platform.\n2. SPICE Mobile App\nA mobile application used by healthcare professionals or field workers for managing patient records, accessing clinical workflows, and syncing data with the SPICE platform.\n3. Admin + CFR Portal Web App\nA web-based application for administrators and healthcare managers to manage system configurations, users, and Client Facing Reports (CFR). It serves as a central portal for administration and data visualization.\n4. SPICE Platform\nThe cor", "source": "kb\\Architecture Diagram.docx", "chunk_index": 0, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "d69f0573db8b8c5955f83f914596d2934c9fd5f132368fe0242b07e8a60bfa7f", "title": "Architecture Diagram", "text": " and data visualization.\n4. SPICE Platform\nThe core system enables healthcare data management and interoperability. It integrates multiple components to ensure seamless data flow between external systems and the FHIR server.\nSubcomponents of SPICE Platform:\nFHIR Converter: Transforms non-FHIR data from external systems or the SPICE Mobile App into FHIR-compliant resources to be stored in the FHIR server.\nSPICE Core: The central processing engine handling data synchronization, queue management, and core business logic.\nQueue: A mechanism to handle offline data sync from the mobile app, ensuring data integrity even in low-connectivity scenarios.\nUser Management: Manages authentication, authorization, and user roles within the SPICE platform.\nNotification: Sends alerts, updates, or confirmati", "source": "kb\\Architecture Diagram.docx", "chunk_index": 1, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "f5dcb39343d2af99b10476afaef8de20a352e6c1ea87a82036361546e7051381", "title": "Architecture Diagram", "text": "Notification: Sends alerts, updates, or confirmations to users via email, SMS, or push notifications.\n5. WHO SMART Guidelines\nA reference to the World Health Organization’s SMART (Standards-Based, Machine-Readable, Adaptive, Requirements-Based, and Testable) guidelines that define healthcare data workflows and best practices. The SPICE platform aligns with these guidelines for standardization.\n6. FHIR Server (HAPI JPA Server)\nA server implementing the HL7 FHIR standard using the HAPI FHIR JPA Server. It stores and retrieves FHIR-compliant healthcare data.\n7. Postgres FHIR DB\nA PostgreSQL database serves as the backend storage for the FHIR server. It securely stores all FHIR resources (e.g., Patient, Observation, etc.).\n8. Postgres Admin DB\nA separate PostgreSQL database for storing adminis", "source": "kb\\Architecture Diagram.docx", "chunk_index": 2, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "d55558566c656bf91ea8c1d6a6d97c1b1182ffdf7220f47ebd524731b8cf68f3", "title": "Architecture Diagram", "text": "A separate PostgreSQL database for storing administrative and metadata information required by the SPICE platform, such as user roles, configurations, and system logs.", "source": "kb\\Architecture Diagram.docx", "chunk_index": 3, "chunk_count": 4, "tokens_estimate": 167, "created_at": 1766077251}
{"ns": "default", "id": "9489363940d90f8e4fa26fbdfebcb72072f667a9d777227a6bba522d0eacc44f", "title": "Architecture Diagram", "text": "Architecture Diagram \nThe SPICE platform supports the HL7 FHIR standard. \n \n1. External EHR/EMR \nRepresents external Electronic Health Record (EHR) or Electronic Medical Record \n(EMR) systems. These are external healthcare data systems that provide or consume \npatient-related information, enabling data interoperability with the SPICE platform. \n \n2. SPICE Mobile App \nA mobile application used by healthcare professionals or field workers for managing \npatient records, accessing clinical workflows, and syncing data with the SPICE \nplatform. \n \n3. Admin + CFR Portal Web App \nA web-based application for administrators and healthcare managers to manage \nsystem configurations, users, and Client Facing Reports (CFR). It serves as a central \nportal for administration and data visualization. \n \n4. ", "source": "kb\\Architecture Diagram.pdf", "chunk_index": 0, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "2171e6a48126d37890f9a1eb2cbe23762ea083675000af32e28e1d5816991787", "title": "Architecture Diagram", "text": " for administration and data visualization. \n \n4. SPICE Platform\n\nThe core system enables healthcare data management and interoperability. It integrates \nmultiple components to ensure seamless data flow between external systems and the \nFHIR server. \nSubcomponents of SPICE Platform: \n• FHIR Converter: Transforms non -FHIR data from external systems or the SPICE \nMobile App into FHIR -compliant resources to be stored in the FHIR server. \n• SPICE Core: The central processing engine handling data synchronization, \nqueue management, and core business logic. \n• Queue: A mechanism to handle offline data sync from the mobile app, ensuring \ndata integrity even in low -connectivity scenarios. \n• User Management: Manages authentication, authorization, and user roles \nwithin the SPICE platform. \n• No", "source": "kb\\Architecture Diagram.pdf", "chunk_index": 1, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "6d4f269431afe3c81a43fb014c1cd89fcb3e2538c728c84e14430029cdebf1be", "title": "Architecture Diagram", "text": ", and user roles \nwithin the SPICE platform. \n• Notification: Sends alerts, updates, or confirmations to users via email, SMS, or \npush notifications. \n \n5. WHO SMART Guidelines \nA reference to the World Health Organization’s SMART (Standards -Based, Machine -\nReadable, Adaptive, Requirements -Based, and Testable) guidelines that define \nhealthcare data workflows and best practices. The SPICE platform aligns with these \nguidelines for standardization. \n \n6. FHIR Server (HAPI JPA Server) \nA server implementing the HL7 FHIR standard using the HAPI FHIR JPA Server . It stores \nand retrieves FHIR -compliant healthcare data. \n \n7. Postgres FHIR DB \nA PostgreSQL database serves as the backend storage for the FHIR server. It securely \nstores all FHIR resources (e.g., Patient, Observation, etc.). ", "source": "kb\\Architecture Diagram.pdf", "chunk_index": 2, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "97fc9a7ca37ad92adf90cfa320b8ec8da9f97e0f067f2c38307f599326dbd79e", "title": "Architecture Diagram", "text": "HIR resources (e.g., Patient, Observation, etc.). \n \n8. Postgres Admin DB \nA separate PostgreSQL database for storing administrative and metadata information \nrequired by the SPICE platform, such as user roles, configurations, and system logs.", "source": "kb\\Architecture Diagram.pdf", "chunk_index": 3, "chunk_count": 4, "tokens_estimate": 243, "created_at": 1766077251}
{"ns": "default", "id": "c52027c031b11d6c9510b56348ba15e34c1d160078684d4c5844f4063cb75e6b", "title": "Assessment", "text": "Assessment\nFeature Overview\nThe SPICE platform is designed to transform primary care delivery in resource-constrained settings. It empowers community health workers by equipping them with the necessary tools to conduct assessments for various health conditions, including non-communicable diseases (NCDs), malaria, maternal and child health, among others. The assessment process utilizes a risk algorithm to determine whether patients need further medical attention based on their diagnosed conditions. Assessment can occur online and offline, providing flexibility and accessibility for health screeners and community health workers.\nCommunity-Based Assessment Workflow\nTo use the Assessment feature, follow these steps:\nTo assess a patient, navigate to the patient through \"Households\" or \"My Patie", "source": "kb\\Assessment.docx", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "d0996c1b7bd0a875c16bc3b3eede5974f52be9d15cdd6b9c147227749289a114", "title": "Assessment", "text": "e to the patient through \"Households\" or \"My Patients\", depending on how you want to look up the patient\nTo find a patient through \"Households\", click on \"Households\" and search by Household Name/No. or use the \"Filter\" feature to filter by Village\nTo find a patient through \"My Patients\", click on \"My Patients\" and search by Name/Patient ID or use the Follow-up lists to filter and search for the patient\nSelect the patient profile that you want to perform the assessment for\nClick on the Assessment that you would like to perform (e.g., for a Female patient two workflows will appear: RMNCH and Other Symptoms).\nFollow the steps to collect the data as prompted by the workflow\nView the Assessment Summary\nIf the patient is \"Referred for further assessment\", select the appropriate facility for a r", "source": "kb\\Assessment.docx", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "e54758d09ed0b07ac08751cc57ddaa7fdd7af22e73ab2a2e3d751929cb8eb7c9", "title": "Assessment", "text": "sessment\", select the appropriate facility for a referral\nCommunity-based Assessment Workflow", "source": "kb\\Assessment.docx", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 93, "created_at": 1766077251}
{"ns": "default", "id": "ea658ab766ae61203e3fbd328d756e2794dde559e43f249cdafd5e7da6c92a8d", "title": "Assessment", "text": "Assessment \nFeature Overview \nThe SPICE platform is designed to transform primary care delivery in resource -\nconstrained settings. It empowers community health workers by equipping them with \nthe necessary tools to conduct assessments for various health conditions, including \nnon-communic able diseases (NCDs), malaria, maternal and child health, among \nothers. The assessment process utilizes a risk algorithm to determine whether patients \nneed further medical attention based on their diagnosed conditions. Assessment can \noccur online and offli ne, providing flexibility and accessibility for health screeners and \ncommunity health workers. \nCommunity -Based Assessment Workflow \nTo use the Assessment feature, follow these steps: \n1. To assess a patient, navigate to the patient through \"House", "source": "kb\\Assessment.pdf", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "c0fb74ac2892197ceb4ec437f7f51a897109733ffdbc2fad27de08847b5d568c", "title": "Assessment", "text": " a patient, navigate to the patient through \"Households\" or \"My \nPatients\", depending on how you want to look up the patient \n1. To find a patient through \"Households\", click on \"Households\" and search \nby Household Name/No. or use the \"Filter\" feature to filter by Village \n2. To find a patient through \"My Patients\", click on \"My Patients\" and search \nby Name/Patient ID or use the Follow -up lists to filter and search for the \npatient \n2. Select the patient profile that you want to perform the assessment for \n3. Click on the Assessment that you would like to perform (e.g., for a Female \npatient two workflows will appear: RMNCH and Other Symptoms). \n4. Follow the steps to collect the data as prompted by the workflow \n5. View the Assessment Summary \n1. If the patient is \"Referred for further", "source": "kb\\Assessment.pdf", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "ab6f2525d8997e5eb3d87bd86d9ab81817a1e9a4849c49698ef16479cf95cc8e", "title": "Assessment", "text": "ummary \n1. If the patient is \"Referred for further assessment\", select the appropriate \nfacility for a referral\n\nCommunity -based Assessment Workflow", "source": "kb\\Assessment.pdf", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 149, "created_at": 1766077251}
{"ns": "default", "id": "db479502a7d82580daa067d687bf4d3cefab5f4e4d3546db1cbd6343e23a1be9", "title": "C4 Diagrams", "text": "C4 Diagrams\nBelow you will find SPICE platform documentation using the C4 model for architecting software solutions.\nSystem Context\nThe below diagram demonstrates the context of the SPICE system and the various system users and system components.\nSPICE Context Architecture.\nThe system primarily interacts with the healthcare worker, in this case the community health worker (CHW) who collects information from the patient\nThe SPICE platform is used for the data collection, storage, and processing of the data collected.\nIn addition to its primary functionalities, the SPICE application integrates with a software system dedicated to handling emails sent to Health Workers.\nThe SPICE application also leverages an SMS software system to transmit information to the patient directly.\nSystem Container", "source": "kb\\C4 Diagrams.docx", "chunk_index": 0, "chunk_count": 7, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "587979f5037410febb5728c058f4c977f07d13671ea6e45867b0a8c86fa419b6", "title": "C4 Diagrams", "text": "ormation to the patient directly.\nSystem Container:\nSPICE Container Architecture\nSPICE Mobile (Android application) is the primary application for end-user engagement\nSPICE Admin users interact with a web application built with HTML, JavaScript, and React, serving as the front end for managing organizations, metadata, and workflows.\nWe have a set of core platform services (microservices) that the applications query using REST API calls.\nThe web application communicates with the following services:\nAdmin Service: A SpringBoot-based service that enables the creation of metadata, management of facilities, and linking facilities with users.\nUser Service: A SpringBoot-based service responsible for user management, client profiles, and authentication/authorization.\nNotification Service: A Spring", "source": "kb\\C4 Diagrams.docx", "chunk_index": 1, "chunk_count": 7, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "eddd4e9b9ed7f77b9abd24629657e7a0bb70d20efc6d9790c01468ff222be4fc", "title": "C4 Diagrams", "text": "tion/authorization.\nNotification Service: A SpringBoot-based service managing notifications through SMS, email, and WhatsApp.\nThe mobile application users input patient data via a Kotlin-based mobile application available on the Play Store. The mobile application communicates with three services:\nUser Service: The same service utilized by SPICE Admin users, managing user-related functionalities and authentication.\nNotification Service: Also shared with SPICE Admin users, responsible for handling notifications.\nSPICE Service: A SpringBoot-based service overseeing screening, enrollment, assessment, and medical review. It utilizes AWS storage for data storage requirements.\nOffline Service: Support offline data storage and sync when the device comes online.\nFHIR Service: Map the FHIR resource ", "source": "kb\\C4 Diagrams.docx", "chunk_index": 2, "chunk_count": 7, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "0678bb36d76b546bab096dbea55b6d139d7d98fc7a3693f5e1efd7a588367738", "title": "C4 Diagrams", "text": "comes online.\nFHIR Service: Map the FHIR resource attributes and save the data in the HAPI FHIR JPA server.\nAll four services (Admin, User, Notification, and SPICE) interact with an RDS instance, employing PostgreSQL to store and retrieve meta, configuration, and transaction data.\nThe Notification Service forwards patient-related information to SPICE Admin users via an email system.\nAdditionally, the Notification Service employs an SMS system to directly communicate information to the Patients.\nSystem Components\nAndroid Component System:\nThe Mobile application performs the main functions through API calls to the service layer. The mobile application is made up of the following components that communicate with the associated microservices in the service layer:\nHousehold Manager\nMember Regis", "source": "kb\\C4 Diagrams.docx", "chunk_index": 3, "chunk_count": 7, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "04491e635c8145147a33f21a858644cf06dbf657ee1dc0aed136c38d49f0ff2f", "title": "C4 Diagrams", "text": " the service layer:\nHousehold Manager\nMember Registration Manager\nMedical Review Manager\nAssessment Manager\nMedication Manager\nLab Test Manager\nFollow-up Manager\nThe following details of what each component is responsible for:\nThe Household Manager component is responsible for gathering basic information and health-related data during the screening process.\nThe Member Registration Manager component facilitates the enrollment of patients directly into the system.\nThe Medical Review Manager component handles the management of medical reviews, including maintaining a history of reviews and adding new reviews.\nThe Assessment Manager component assists in managing patient assessments and creating follow-ups for assessments.\nThe Medication Manager component allows the CHW to prescribe and manage ", "source": "kb\\C4 Diagrams.docx", "chunk_index": 4, "chunk_count": 7, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "7410d961cb07be9d1f4c2d61d6bf87e4d61305da51a381df6ab0d2e0a381af43", "title": "C4 Diagrams", "text": " component allows the CHW to prescribe and manage medications, refill prescriptions, and save the Practitioner Signature in an AWS storage.\nThe Lab Test Manager component enables the CHW to manage and prescribe lab tests, as well as manage the results of the tests.\nThe Follow-up Manager component supports the CHW in managing and following particular patients.\nAll of the above-mentioned components are part of the comprehensive SPICE service, which interacts with an RDS instance to store and retrieve the corresponding data.\nAndroid Component Architecture\nWeb component system:\nThe Web Admin System comprises a web application that interacts with the Admin Service, which contains three main components:\nOrganization Manager\nMetadata Manager\nWorkflow Manager.\nThe following details out what each c", "source": "kb\\C4 Diagrams.docx", "chunk_index": 5, "chunk_count": 7, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "ce96012b3bff9de7674809ce60f5f7e9aec189529f52d57a5e4d1bf5ab8c0cba", "title": "C4 Diagrams", "text": "low Manager.\nThe following details out what each component is responsible for:\nThe Organization Manager component handles the management and creation of Regions, Accounts, Operating Units, and Sites.\nThe Metadata Manager component is responsible for managing data related to medication and lab tests.\nThe Workflow Manager component allows customization of workflows associated with screening, enrollment, assessment, and account customization.\nEach of the three components communicates with an RDS instance, which utilizes PostgreSQL as the database technology.\nThe RDS instance is responsible for storing and retrieving all meta, configuration, and transaction-related data.\nWeb Component Architecture", "source": "kb\\C4 Diagrams.docx", "chunk_index": 6, "chunk_count": 7, "tokens_estimate": 702, "created_at": 1766077251}
{"ns": "default", "id": "681efaf1404d2e1a232ed5706051be28828fe0a4fb06978d2baa5b8b74c6d071", "title": "C4 Diagrams", "text": "C4 Diagrams \nBelow you will find SPICE platform documentation using the C4 model for architecting \nsoftware solutions. \nSystem Context \nThe below diagram demonstrates the context of the SPICE system and the various \nsystem users and system components. \n \nSPICE Context Architecture. \n• The system primarily interacts with the healthcare worker, in this case the \ncommunity health worker (CHW) who collects information from the patient \n• The SPICE platform is used for the data collection, storage, and processing of the \ndata collected. \n• In addition to its primary functionalities, the SPICE application integrates with a \nsoftware system dedicated to handling emails sent to Health Workers. \n• The SPICE application also leverages an SMS software system to transmit \ninformation to the patient di", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 0, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "5069c8dff89e71b801aa391df4a406a43b76129bb21ba23ce63640f160489d49", "title": "C4 Diagrams", "text": " system to transmit \ninformation to the patient directly. \nSystem Container:\n\nSPICE Container Architecture \n• SPICE Mobile (Android application) is the primary application for end -user \nengagement \n• SPICE Admin users interact with a web application built with HTML, JavaScript, \nand React, serving as the front end for managing organizations, metadata, and \nworkflows. \n• We have a set of core platform services (microservices) that the applications \nquery using REST API calls. \n• The web application communicates with the following services: \no Admin Service: A SpringBoot -based service that enables the creation of \nmetadata, management of facilities, and linking facilities with users. \no User Service: A SpringBoot -based service responsible for user \nmanagement, client profiles, and authent", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 1, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "4f6822d7fc33a3bd28a71632a2f1f20806de2158b26055d614c6eb6398ce281a", "title": "C4 Diagrams", "text": "for user \nmanagement, client profiles, and authentication/authorization. \no Notification Service: A SpringBoot -based service managing notifications \nthrough SMS, email, and WhatsApp. \n• The mobile application users input patient data via a Kotlin -based mobile \napplication available on the Play Store. The mobile application communicates \nwith three services:\n\no User Service: The same service utilized by SPICE Admin users, managing \nuser-related functionalities and authentication. \no Notification Service: Also shared with SPICE Admin users, responsible for \nhandling notifications. \no SPICE Service: A SpringBoot -based service overseeing screening, \nenrollment, assessment, and medical review. It utilizes AWS storage for \ndata storage requirements. \no Offline Service: Support offline data st", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 2, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "251fd27d22798211a2c7667ce234f1108f741ede92357b0151d966fab551a373", "title": "C4 Diagrams", "text": "ments. \no Offline Service: Support offline data storage and sync when the device \ncomes online. \no FHIR Service: Map the FHIR resource attributes and save the data in the \nHAPI FHIR JPA server. \n• All four services (Admin, User, Notification, and SPICE) interact with an RDS \ninstance, employing PostgreSQL to store and retrieve meta, configuration, and \ntransaction data. \n• The Notification Service forwards patient -related information to SPICE Admin \nusers via an email system. \n• Additionally, the Notification Service employs an SMS system to directly \ncommunicate information to the Patients. \nSystem Components \nAndroid Component System: \n• The Mobile application performs the main functions through API calls to the \nservice layer. The mobile application is made up of the following componen", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 3, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "bafea4781fd2478c4226bbbc6616128f39f0cf136a6175b2e8c9f1497ea9133b", "title": "C4 Diagrams", "text": "e application is made up of the following components \nthat communicate with the associated microservices in the service layer: \no Household Manager \no Member Registration Manager \no Medical Review Manager \no Assessment Manager \no Medication Manager \no Lab Test Manager \no Follow-up Manager \n• The following details of what each component is responsible for:\n\no The Household Manager component is responsible for gathering basic \ninformation and health -related data during the screening process. \no The Member Registration Manager component facilitates the enrollment \nof patients directly into the system. \no The Medical Review Manager component handles the management of \nmedical reviews, including maintaining a history of reviews and adding \nnew reviews. \no The Assessment Manager component assis", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 4, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "6b028d775b6569bd1385eba2b4bc644d994b27609f08de1863db357f86539e81", "title": "C4 Diagrams", "text": "reviews. \no The Assessment Manager component assists in managing patient \nassessments and creating follow -ups for assessments. \no The Medication Manager component allows the CHW to prescribe and \nmanage medications, refill prescriptions, and save the Practitioner \nSignature in an AWS storage. \no The Lab Test Manager component enables the CHW to manage and \nprescribe lab tests, as well as manage the results of the tests. \no The Follow -up Manager component supports the CHW in managing and \nfollowing particular patients. \n• All of the above -mentioned components are part of the comprehensive SPICE \nservice, which interacts with an RDS instance to store and retrieve the \ncorresponding data.\n\nAndroid Component Architecture \nWeb component system: \n• The Web Admin System comprises a web applica", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 5, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "8714a8027e42476250db3698202787cb348ab59f3741a4092f7ed10baeae97ea", "title": "C4 Diagrams", "text": "m: \n• The Web Admin System comprises a web application that interacts with the \nAdmin Service, which contains three main components: \no Organization Manager \no Metadata Manager \no Workflow Manager. \n• The following details out what each component is responsible for:\n\no The Organization Manager component handles the management and \ncreation of Regions, Accounts, Operating Units, and Sites. \no The Metadata Manager component is responsible for managing data \nrelated to medication and lab tests. \no The Workflow Manager component allows customization of workflows \nassociated with screening, enrollment, assessment, and account \ncustomization. \n• Each of the three components communicates with an RDS instance, which \nutilizes PostgreSQL as the database technology. \n• The RDS instance is responsibl", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 6, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "644f3094bd72d063e1b99147423c813f88191eab9da9862a738264c34bc5511f", "title": "C4 Diagrams", "text": "base technology. \n• The RDS instance is responsible for storing and retrieving all meta, configuration, \nand transaction -related data. \n \nWeb Component Architecture", "source": "kb\\C4 Diagrams.pdf", "chunk_index": 7, "chunk_count": 8, "tokens_estimate": 165, "created_at": 1766077251}
{"ns": "default", "id": "a00b8bf281af035266fb014e33292df8f114e37cc2bf7c691bb6d7c2845df3dd", "title": "COMEMR App Workflows", "text": "COMEMR App Workflows\nPatient Journey\nThe COMEMR application enables a seamless patient journey as a patient interacts with a variety of health system users.\nThe following is a typical patient journey for a sample patient named Mary:\nA community health worker (CHW) visits Mary's home to complete a household registration. Mary is registered in the application along with her other household members.\nAt the time of the household registration, Mary is assessed using the integrated community case management (ICCM) module within the COMEMR application. Mary reports having a Fever for the last 4 days with fatigue. The application refers Mary for further assessment and the CHW selects the nearest facility to refer Mary.\nMary receives a SMS reminder 1 day after her community assessment to remind her", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 0, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "817cf74d3b818bef5c5cbc34d0d4ac950324204ecca1f72fdb0e951311fff6db", "title": "COMEMR App Workflows", "text": "1 day after her community assessment to remind her to visit the facility for a medical review.\nMary visits the facility where she is seen by a provider who completes a RDT test and confirms her diagnosis of Malaria.\nMary receives a customized treatment plan (pending confirmation from a provider) which includes community-based follow-up assessments and facility visits for medicals reviews (as needed).\nMary returns home and is visited by a CHW the next week for her assessment. The CHW follows up with her to ensure she is taking her medication and recovering well.\nSteps 2-6 repeat continuously by seamlessly linking the community and facility activities.\nApplication Workflows\nHousehold Registration\nThe Household Registration feature empowers Community Health Workers (CHWs) to conduct comprehen", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 1, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "b24fb2434af1c6f7d6744f06bc24e9aa87fb1020ceaae8cb5088f16746ebf819", "title": "COMEMR App Workflows", "text": "mmunity Health Workers (CHWs) to conduct comprehensive household registration using a mobile application that is specifically designed to function in low-connectivity environments. The process begins with CHWs visiting households within their assigned communities and using the app to assign a unique household identifier (ID) to each family. This unique ID acts as a digital anchor, ensuring that each household’s data is easily trackable and accessible for future follow-ups.\nCHWs are then guided through a structured workflow to collect detailed demographic information for all household members, including names, ages, gender, relationships, and any existing health conditions. This data is crucial for building a robust health profile of the community and identifying potential health risks. To ", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 2, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "8c59fb1cb0f89af9ec99e5019441c4fb7f36a5a330879d823d9a2b2926fe44ad", "title": "COMEMR App Workflows", "text": "munity and identifying potential health risks. To enhance accuracy and geographical tracking, CHWs also use the app to capture the precise geospatial location of each household. This mapping feature allows for better resource planning and helps healthcare providers target services more effectively, particularly in hard-to-reach areas.\nCommunity-Based Assessment\nThe COMEMR platform is designed to transform primary care delivery in resource-constrained settings. It empowers community health workers by equipping them with the necessary tools to conduct assessments for various health conditions, including non-communicable diseases (NCDs), malaria, maternal and child health, among others. The assessment process utilizes a risk algorithm to determine whether patients need further medical attenti", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 3, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "74acc16a079d62da6d91bacd5c30541362a65bc5e96a9e50ac2a08c7411c100a", "title": "COMEMR App Workflows", "text": "mine whether patients need further medical attention based on their diagnosed conditions. Assessment can occur online and offline, providing flexibility and accessibility for health screeners and community health workers.\nCommunity-Based Follow-up\nThe community-based follow-up feature within the COMEMR 2.0 platform is designed to ensure that both Community Health Workers (CHWs) and clinicians are consistently informed and reminded about critical health interventions for patients, thereby promoting continuity of care. The feature includes task prioritization features, which organize follow-up tasks based on patient risk levels. Patients identified as high-risk—such as those with uncontrolled chronic diseases, pregnant women, or children with missed vaccinations—are flagged within the app, e", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 4, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "44a7ffd2df418d23eba9908ed2af8e7047b3a65bdf764bc83a8d3ebbd73a991e", "title": "COMEMR App Workflows", "text": " missed vaccinations—are flagged within the app, ensuring that health workers focus on the most critical cases first. The app provides real-time status updates on the progress of follow-ups, showing whether tasks have been completed, rescheduled, or are still pending. This functionality helps health workers stay organized and accountable, reducing the likelihood of missed care opportunities.\nMy Patients Feature\nThe 'My Patients' feature within the COMEMR platform is a valuable resource that enables healthcare professionals to efficiently manage and monitor their assigned patients. This feature provides convenience and organization by offering a centralized hub for accessing, tracking, referring, and managing patient information. It significantly enhances coordination of patient care and im", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 5, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "305ca4210186ac5165397347ccef578d04f099bb23b70eac32d13050d14ee98a", "title": "COMEMR App Workflows", "text": "antly enhances coordination of patient care and improves communication among healthcare providers. Most importantly, it instills a sense of competence and confidence in healthcare professionals, empowering them and enhancing their capability in making informed healthcare decisions.\nMedical Review\nThe Medical Review feature in COMEMR is an essential tool designed for healthcare professionals. It enhances the ability to assess, monitor, provide preventive care, achieve early diagnosis, and facilitate continuous treatment and decision-making, particularly for patients with chronic conditions like hypertension, diabetes, malaria, HIV, and tuberculosis. It also addresses other health services such as maternal and child health, mental health, and immunization.\nThis feature enables healthcare pro", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 6, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "ed4879e49478ff5d86fe21d777de6aa205ca597c73a2410d4802012b45c0e338", "title": "COMEMR App Workflows", "text": " immunization.\nThis feature enables healthcare providers to conduct medical reviews seamlessly, prescribe treatment plans and medications, recommend lab tests, and maintain comprehensive documentation of patients' health profiles. Moreover, it empowers primary care providers to deliver thorough, long-term solutions, ultimately optimizing healthcare delivery in underserved communities and making healthcare practices more efficient and effective.\nPharmacy\nThe Pharmacy features within the COMEMR platform play a crucial role in delivering prescribed medications to patients. Pharmacists can access detailed information about each prescribed medication, including the name, code, URL, classification, brand name, dosage form (liquid or pills), frequency, duration of the prescription, and any additi", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 7, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "309acb8ce44daf02d3aece55633e1e5eb52c3c13478ae211f3a55eca19f62e38", "title": "COMEMR App Workflows", "text": "ency, duration of the prescription, and any additional comments from the physician. This functionality enhances adherence to treatment plans by allowing pharmacists to provide clear instructions for medication intake. Furthermore, it keeps track of the dispensation history, enabling pharmacists to document any discrepancies, which improves transparency and accountability in the medication dispensation process and fosters a more open practice.", "source": "kb\\COMEMR App Workflows.docx", "chunk_index": 8, "chunk_count": 9, "tokens_estimate": 446, "created_at": 1766077251}
{"ns": "default", "id": "fecd08d9c5635f3b8c1e2c098fb5e3fbffb5ebb5d90d7a41adc910c8d2599930", "title": "COMEMR App Workflows", "text": "COMEMR App Workflows \nPatient Journey \nThe COMEMR application enables a seamless patient journey as a patient interacts with \na variety of health system users. \nThe following is a typical patient journey for a sample patient named Mary: \n1. A community health worker (CHW) visits Mary's home to complete a household \nregistration. Mary is registered in the application along with her other household \nmembers. \n2. At the time of the household registration, Mary is assessed using the integrated \ncommunity case management (ICCM) module within the COMEMR application. \nMary reports having a Fever for the last 4 days with fatigue. The application refers \nMary for further assessment and the CHW selects the nearest facility to refer \nMary. \n3. Mary receives a SMS reminder 1 day after her community as", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 0, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "e3a0354266e1f25b49d6f403d4bd9600d34745ee01408d5d638dc4b417d1ba91", "title": "COMEMR App Workflows", "text": "ceives a SMS reminder 1 day after her community assessment to remind \nher to visit the facility for a medical review. \n4. Mary visits the facility where she is seen by a provider who completes a RDT test \nand confirms her diagnosis of Malaria. \n5. Mary receives a customized treatment plan (pending confirmation from a \nprovider) which includes community -based follow -up assessments and facility \nvisits for medicals reviews (as needed). \n6. Mary returns home and is visited by a CHW the next week for her assessment. \nThe CHW follows up with her to ensure she is taking her medication and \nrecovering well. \n7. Steps 2-6 repeat continuously by seamlessly linking the community and facility \nactivities. \nApplication Workflows \nHousehold Registration \nThe Household Registration feature empowers Co", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 1, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "2bfeb2e12caabe541d71a692dcfbcc8c0a95d706bf17533bc9646e8d3c0ec810", "title": "COMEMR App Workflows", "text": "on \nThe Household Registration feature empowers Community Health Workers (CHWs) to \nconduct comprehensive household registration using a mobile application that is \nspecifically designed to function in low -connectivity environments. The process begins \nwith CHWs visiting households within their assigned communities and using the app to \nassign a unique household identifier (ID) to each family. This unique ID acts as a digital \nanchor, ensuring that each household’s data is easily trackable and accessible for \nfuture follow-ups.\n\nCHWs are then guided through a structured workflow to collect detailed demographic \ninformation for all household members, including names, ages, gender, relationships, \nand any existing health conditions. This data is crucial for building a robust health \nprofile", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 2, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "72b81f9f439da3d41408996c3319ba1c30bd2ac71b22aba6bd6b2c1d23997d46", "title": "COMEMR App Workflows", "text": "a is crucial for building a robust health \nprofile of the community and identifying potential health risks. To enhance accuracy \nand geographical tracking, CHWs also use the app to capture the precise geospatial \nlocation of each household. This mapping feature allows for better resource planning \nand helps healthcare providers target services more effectively, particularly in hard -to-\nreach areas. \nCommunity -Based Assessment \nThe COMEMR platform is designed to transform primary care delivery in resource -\nconstrained settings. It empowers community health workers by equipping them with \nthe necessary tools to conduct assessments for various health conditions, including \nnon-communicable dise ases (NCDs), malaria, maternal and child health, among \nothers. The assessment process utilizes ", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 3, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "cad8532ad9e9618349b2c56dcc820f8f77ca57a0d87933593fbda4e156c64afc", "title": "COMEMR App Workflows", "text": "h, among \nothers. The assessment process utilizes a risk algorithm to determine whether patients \nneed further medical attention based on their diagnosed conditions. Assessment can \noccur online and offl ine, providing flexibility and accessibility for health screeners and \ncommunity health workers. \nCommunity -Based Follow -up \nThe community -based follow -up feature within the COMEMR 2.0 platform is designed to \nensure that both Community Health Workers (CHWs) and clinicians are consistently \ninformed and reminded about critical health interventions for patients, thereby \npromoting continuity of care. The feature includes task prioritiza tion features, which \norganize follow -up tasks based on patient risk levels. Patients identified as high -risk—\nsuch as those with uncontrolled chronic", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 4, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "a9f6ed440ff7471c03bc40487f4b470a708f30c403d81b532c4277b0bcabbd84", "title": "COMEMR App Workflows", "text": "igh -risk—\nsuch as those with uncontrolled chronic diseases, pregnant women, or children with \nmissed va ccinations —are flagged within the app, ensuring that health workers focus on \nthe most critical cases first. The app provides real -time status updates on the progress \nof follow-ups, showing whether tasks have been completed, rescheduled, or are still \npending. This functionality helps health workers stay organized and accountable, \nreducing the likelihood of missed care opportunities. \nMy Patients Feature \nThe 'My Patients' feature within the COMEMR platform is a valuable resource that \nenables healthcare professionals to efficiently manage and monitor their assigned \npatients. This feature provides convenience and organization by offering a centralized \nhub for accessing, tracking, ", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 5, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "48c5400ffcf4b4f340b5232f057a6a9de836f08f794373af59a2eac69c328e15", "title": "COMEMR App Workflows", "text": "ering a centralized \nhub for accessing, tracking, referring, and manag ing patient information. It significantly \nenhances coordination of patient care and improves communication among healthcare \nproviders. Most importantly, it instills a sense of competence and confidence in \nhealthca re professionals, empowering them and enhancing their capability in making \ninformed healthcare decisions.\n\nMedical Review \nThe Medical Review feature in COMEMR is an essential tool designed for healthcare \nprofessionals. It enhances the ability to assess, monitor, provide preventive care, \nachieve early diagnosis, and facilitate continuous treatment and decision -making, \nparticularly for patients with chronic condi tions like hypertension, diabetes, malaria, \nHIV, and tuberculosis. It also addresses other", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 6, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "5d49a31ea903cd451a8e18bff97e9bb017fef9d521aac4168e5b05d99097c315", "title": "COMEMR App Workflows", "text": "a, \nHIV, and tuberculosis. It also addresses other health services such as maternal and \nchild health, mental health, and immunization. \nThis feature enables healthcare providers to conduct medical reviews seamlessly, \nprescribe treatment plans and medications, recommend lab tests, and maintain \ncomprehensive documentation of patients' health profiles. Moreover, it empowers \nprimary care provi ders to deliver thorough, long -term solutions, ultimately optimizing \nhealthcare delivery in underserved communities and making healthcare practices more \nefficient and effective. \nPharmacy \nThe Pharmacy features within the COMEMR platform play a crucial role in delivering \nprescribed medications to patients. Pharmacists can access detailed information \nabout each prescribed medication, including th", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 7, "chunk_count": 9, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "c13eed07bf9bef5c5c5b5e5752ebefe14b7d2135f1cc0e6a7cd5ca28283ca8cf", "title": "COMEMR App Workflows", "text": "on \nabout each prescribed medication, including the name, code, URL, classification, brand \nname, dosage form (liquid or pills), frequenc y, duration of the prescription, and any \nadditional comments from the physician. This functionality enhances adherence to \ntreatment plans by allowing pharmacists to provide clear instructions for medication \nintake. Fu rthermore, it keeps track of the dispensation history, enabling pharmacists to \ndocument any discrepancies, which improves transparency and accountability in the \nmedication dispensation process and fosters a more open practice.", "source": "kb\\COMEMR App Workflows.pdf", "chunk_index": 8, "chunk_count": 9, "tokens_estimate": 587, "created_at": 1766077251}
{"ns": "default", "id": "59eae476409d6a670b60585fc3bacf82ae8fed0c3d2f505469bdcc3e925693d1", "title": "COMEMR Users", "text": "COMEMR Users\nUnderstanding the user roles in the COMEMR platform is key to effectively navigate the system. In this documentation, we will define each role and its corresponding feature access.\nUser Role\nDescription\nFeature Access\nHealth Screener\nThe Health Screener is responsible for community based screenings and assessments - Community health worker\nScreening, Assessment\nHealth Coach\nThe Health Coach role encompasses all of the community-based clinical roles such as CHW, CHV, Peer support group leader, and health coach.\nScreening, Assessment\nLab Technician\nThe LAB technician will receive requests for lab tests from the physician and have the ability to enter test results into the patient record.\nScreening, Assessment, Investigation\nPharmacist\nThe Pharmacist has the ability to view the b", "source": "kb\\ComEMR Users.docx", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "bc9266b7a733137abc40d4b53fec2906d4ec91707d98d8a0dff11e1eb5af2b36", "title": "COMEMR Users", "text": "acist\nThe Pharmacist has the ability to view the basic patient record and see the list of prescriptions that a patient has, and they have the ability to dispense medication based on prescriptions.\nScreening, Assessment, Dispense\nHRIO\nThe HRIO has access to the Basic patient record and enroll the patient into the program\nScreening, Assessment, Enrolment, My Patients\nProvider\nThe Provider role encompasses a Physician who conducts medical review for the patient\nScreening, Assessment, Enrolment, Medical Review, My Patients\nNurse\nA licensed healthcare professional who is part of the medical team in the facility and practices, supervised by a physician, surgeon and who is skilled in promoting and maintaining health\nScreening, Assessment, Enrolment, My Patients, Dispense\nPhysician Prescriber\nA ph", "source": "kb\\ComEMR Users.docx", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "db6a4382dc199c3a92f80b28649c6aa25b4f2b7f3a9ce80326d28276be2dd078", "title": "COMEMR Users", "text": "t, My Patients, Dispense\nPhysician Prescriber\nA physician who will be able to dispense medication based on the prescription\nScreening, Assessment, Enrolment, Medical Review, My Patients", "source": "kb\\ComEMR Users.docx", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 185, "created_at": 1766077251}
{"ns": "default", "id": "ed8084887b29523ee5ebb9962dcb9bc5819f25c4d38c5eda8883b1ddbe6a49b8", "title": "COMEMR Users", "text": "COMEMR Users \nUnderstanding the user roles in the COMEMR platform is key to effectively navigate the \nsystem. In this documentation, we will define each role and its corresponding feature \naccess. \nUser Role \nDescription \nFeature Access \nHealth Screener \nThe Health Screener is responsible for community based screenings and assessments - \nCommunity health worker \nScreening, Assessment \nHealth Coach \nThe Health Coach role encompasses all of the community -based clinical roles such as \nCHW, CHV, Peer support group leader, and health coach. \nScreening, Assessment \nLab Technician \nThe LAB technician will receive requests for lab tests from the physician and have the \nability to enter test results into the patient record. \nScreening, Assessment, Investigation \nPharmacist \nThe Pharmacist has the ", "source": "kb\\ComEMR Users.pdf", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "8dba8b58417d87f56dfcd9c784488c7ae31c70eeb1fc8ef26176f0d767310e3c", "title": "COMEMR Users", "text": "Investigation \nPharmacist \nThe Pharmacist has the ability to view the basic patient record and see the list of \nprescriptions that a patient has, and they have the ability to dispense medication based \non prescriptions. \nScreening, Assessment, Dispense \nHRIO \nThe HRIO has access to the Basic patient record and enroll the patient into the program \nScreening, Assessment, Enrolment, My Patients \nProvider \nThe Provider role encompasses a Physician who conducts medical review for the \npatient\n\nScreening, Assessment, Enrolment, Medical Review, My Patients \nNurse \nA licensed healthcare professional who is part of the medical team in the facility and \npractices, supervised by a physician, surgeon and who is skilled in promoting and \nmaintaining health \nScreening, Assessment, Enrolment, My Patients", "source": "kb\\ComEMR Users.pdf", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "7b72251c90d3887d470278bb11065cd889f1f05ca8ceed1065e3284978afb4d4", "title": "COMEMR Users", "text": "lth \nScreening, Assessment, Enrolment, My Patients, Dispense \nPhysician Prescriber \nA physician who will be able to dispense medication based on the prescription \nScreening, Assessment, Enrolment, Medical Review, My Patients", "source": "kb\\ComEMR Users.pdf", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 224, "created_at": 1766077251}
{"ns": "default", "id": "c6fa6d02154134e27d800ec4e2d4ab8b8d919fe6dc21ad3d2f73a3c5d0832381", "title": "Data Privacy", "text": "Data Privacy\n\nWe build technology that prioritizes patient safety, privacy, and security. Our SPICE platform complies with all major international standards including GDPR and HIPPA, and all regional regulations in the countries in which we operate.\nKey Highlights:\nAll data is encrypted at rest and in transit\nApplication access is restricted through role-based access and access is audited at set intervals\nOur organization security governance, risk, and compliance framework ensures that our products and processes are robust and risks are appropriately mitigated\nAll data used for reporting and analytics is fully de-identified\nApplications are built using security and privacy by design principles, and we perform regular security vulnerability and risk assessments against the latest privacy an", "source": "kb\\Data Privacy.docx", "chunk_index": 0, "chunk_count": 2, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "28f45eeb42c432ba24ae9b00dec9e841d108cc521aa964a74f67ad496f224046", "title": "Data Privacy", "text": "and risk assessments against the latest privacy and security standards.", "source": "kb\\Data Privacy.docx", "chunk_index": 1, "chunk_count": 2, "tokens_estimate": 71, "created_at": 1766077251}
{"ns": "default", "id": "0dd0647b8bb2dc026e435240679a9e304555d97ae3a498297c8aed3749eb355c", "title": "Data Privacy", "text": "Data Privacy \n \nWe build technology that prioritizes patient safety, privacy, and security. Our SPICE \nplatform complies with all major international standards including GDPR and HIPPA, \nand all regional regulations in the countries in which we operate. \nKey Highlights: \n• All data is encrypted at rest and in transit \n• Application access is restricted through role -based access and access is \naudited at set intervals \n• Our organization security governance, risk, and compliance framework ensures \nthat our products and processes are robust and risks are appropriately mitigated \n• All data used for reporting and analytics is fully de -identified \n• Applications are built using security and privacy by design principles, and we \nperform regular security vulnerability and risk assessments agai", "source": "kb\\Data Privacy.pdf", "chunk_index": 0, "chunk_count": 2, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "0b2c4787c6cf41170ee3728b5a8e36b361de23287d39d6b7ac3d6738bf0dfc4c", "title": "Data Privacy", "text": "r security vulnerability and risk assessments against the latest \nprivacy and security standards.", "source": "kb\\Data Privacy.pdf", "chunk_index": 1, "chunk_count": 2, "tokens_estimate": 97, "created_at": 1766077251}
{"ns": "default", "id": "0711c6a11578b03977c2c12fdd4a8d3acbf0912cfc3036bd3f2c17effb8e1157", "title": "Follow-up", "text": "Follow-up\nFeature Overview\nThe community-based follow-up feature within the SPICE 2.0 platform is designed to ensure that both Community Health Workers (CHWs) and clinicians are consistently informed and reminded about critical health interventions for patients, thereby promoting continuity of care. The feature includes task prioritization features, which organize follow-up tasks based on patient risk levels. Patients identified as high-risk—such as those with uncontrolled chronic diseases, pregnant women, or children with missed vaccinations—are flagged within the app, ensuring that health workers focus on the most critical cases first. The app provides real-time status updates on the progress of follow-ups, showing whether tasks have been completed, rescheduled, or are still pending. Thi", "source": "kb\\Follow-up.docx", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "ae0a67d133c0669800a0909bd01cb86e86222b78ebbd31f697f848b4effad8fb", "title": "Follow-up", "text": " completed, rescheduled, or are still pending. This functionality helps health workers stay organized and accountable, reducing the likelihood of missed care opportunities.\nThe follow-up lists are organized into \"Household Visit (HH Visit)\", Referred, and Medical Review. Patients are added to the follow-up lists based on specific criteria:\nHousehold Visit: Patients that are due for a household visit by a CHW are added to this list.\nReferred: Patients that have been referred to the facility for further assessment.\nMedical Review: Patients that are due for a Medical Review at the facility (typically scheduled by the clinician at the time of an initial facility visit).\nThis functionality enables a community health worker to efficiently follow up with patients that they manage. They can either", "source": "kb\\Follow-up.docx", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "eb78931d2c6afecf7e0818ac92a954a46061cfd64bbe25d23ff7d2030568a39f", "title": "Follow-up", "text": "up with patients that they manage. They can either directly call a patient and record the call results or perform an assessment (for the Household Visit).\nCommunity-based Follow-up Workflow\nOn the Home page, select the My Patients option.\nThe patient list is segregated into three Follow-up Actions: Household Visit (HH Visit), Referred, and Medical Review.\nThe CHW can view patients on each list and perform on of the following activities:\nDirectly place a call to the patient to remind them of their upcoming medical review\nPerform an assessment for the patient based on the \"Reason\" listed (for patients on the HH Visit list)", "source": "kb\\Follow-up.docx", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 628, "created_at": 1766077251}
{"ns": "default", "id": "401a892dab8d72ccd2524a702b0b3b99e21c6e3b691696631e8934e48a3085e9", "title": "Follow-up", "text": "Follow-up \nFeature Overview \nThe community -based follow -up feature within the SPICE 2.0 platform is designed to \nensure that both Community Health Workers (CHWs) and clinicians are consistently \ninformed and reminded about critical health interventions for patients, thereby \npromoting co ntinuity of care. The feature includes task prioritization features, which \norganize follow -up tasks based on patient risk levels. Patients identified as high -risk—\nsuch as those with uncontrolled chronic diseases, pregnant women, or children with \nmissed vac cinations —are flagged within the app, ensuring that health workers focus on \nthe most critical cases first. The app provides real -time status updates on the progress \nof follow-ups, showing whether tasks have been completed, rescheduled, or are ", "source": "kb\\Follow-up.pdf", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "26ad9649d2835280831476a03d97cf7628254fd36790cb9da08813a7db4ecedd", "title": "Follow-up", "text": "er tasks have been completed, rescheduled, or are still \npending. This functionality helps health workers stay organized and accountable, \nreducing the likelihood of missed care opportunities. \nThe follow -up lists are organized into \"Household Visit (HH Visit)\", Referred, and Medical \nReview. Patients are added to the follow -up lists based on specific criteria: \n• Household Visit: Patients that are due for a household visit by a CHW are added \nto this list. \n• Referred: Patients that have been referred to the facility for further assessment. \n• Medical Review: Patients that are due for a Medical Review at the facility \n(typically scheduled by the clinician at the time of an initial facility visit). \nThis functionality enables a community health worker to efficiently follow up with \npatie", "source": "kb\\Follow-up.pdf", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "71d9f8c0a79292ef06d02ef2f4e40f04e0cf7f16a31a23d47eb8c4a17df9af13", "title": "Follow-up", "text": "health worker to efficiently follow up with \npatients that they manage. They can either directly call a patient and record the call \nresults or perform an assessment (for the Household Visit). \nCommunity -based Follow -up Workflow \n1. On the Home page, select the My Patients option. \n2. The patient list is segregated into three Follow -up Actions: Household Visit (HH \nVisit), Referred, and Medical Review. \n3. The CHW can view patients on each list and perform on of the following \nactivities: \n1. Directly place a call to the patient to remind them of their upcoming \nmedical review \n2. Perform an assessment for the patient based on the \"Reason\" listed (for \npatients on the HH Visit list)", "source": "kb\\Follow-up.pdf", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 694, "created_at": 1766077251}
{"ns": "default", "id": "d3b996f6930667ae9a64422db9e6156fa94bdcb5515b3d8c51cdda06ff7d9139", "title": "Frequently Asked Questions (FAQs)", "text": "Frequently Asked Questions (FAQs)\nIs COMEMR compatible with other healthcare systems and platforms?\nYes, COMEMR is designed to be interoperable with existing healthcare systems and platforms, including electronic medical record (EMR) systems, health information exchanges (HIEs), and national health databases. It supports integration through standard protocols such as HL7 and FHIR. The latest release introduces the FHIR Adapter, which simplifies data exchange by translating COMEMR data into the widely used FHIR format. This adapter enables seamless integration with FHIR-compatible systems and facilitates centralized data storage and exchange, including interoperability with DHIS2 systems used in Africa and Bangladesh.\nCan I customize workflows in COMEMR to suit my organization's needs?\nWhil", "source": "kb\\Frequently Asked Questions.docx", "chunk_index": 0, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "c19232b54a2ae8fe73ba1e04f0525829b8ea7ffd04de88ed8e11c87661bf4408", "title": "Frequently Asked Questions (FAQs)", "text": "ws in COMEMR to suit my organization's needs?\nWhile non-clinical workflows are customizable to suit organizational needs, clinical decision support features are not customizable. However, users have the flexibility to customize parameters and create custom workflows for non-clinical tasks.\nHow secure is the data stored in COMEMR?\nSecurity is a top priority for COMEMR. The platform employs robust encryption protocols and access controls to safeguard sensitive patient information. All data is encrypted at rest and in transit. We perform regular security audits and vulnerability testing on the platform and ensure compliance with standards and regulations to ensure data integrity and confidentiality. See Data Privacy & Security for more information.\nWhat kind of support is available for COMEMR", "source": "kb\\Frequently Asked Questions.docx", "chunk_index": 1, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "d620a0ab4c749ed103f58e8801f8505086e491ff5c18ae4bdd9201af5ce3dcb7", "title": "Frequently Asked Questions (FAQs)", "text": "tion.\nWhat kind of support is available for COMEMR users?\nFor any support or additional questions, please reach out to community@medtroniclabs.org. Medtronic LABS provides comprehensive support to users through various channels, including online documentation, GitHub discussions, and 1:1 support. Users can access role-specific guides to better understand workflows and get answers to functionality questions. See Support for more information.\nHow often is COMEMR updated, and are there any additional costs for updates?\nCOMEMR undergoes regular updates and enhancements to introduce new features, improve performance, and address user feedback. For implementations leveraging the hosted model, updates are typically rolled out periodically, and there are no additional costs for receiving updates. ", "source": "kb\\Frequently Asked Questions.docx", "chunk_index": 2, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "b5180440308eb8bb9e30c790d4c752d271b5ef36684937a66a1b0227d55e26a0", "title": "Frequently Asked Questions (FAQs)", "text": "re are no additional costs for receiving updates. For implementations leveraging the open-source packages, we send release notification emails to the newsletter subscribers. See Support and Releases for more information.\nCan COMEMR be used in offline environments or areas with limited internet connectivity?\nYes, COMEMR offers offline functionality, allowing users to perform essential tasks even in environments with limited or no internet connectivity. Data captured offline is synced with the central server once an internet connection is restored, ensuring continuity of care and data integrity.\nWhat are the processes for logging into the COMEMR portal?\nPortal Login\nSteps to Log In\nEnter Your Username or Email\na. This is usually the first input field.\nb. Enter your registered email address o", "source": "kb\\Frequently Asked Questions.docx", "chunk_index": 3, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "0fa47c788bf2320a88eac2374378ac686844b131b5a01ef483ab38f595242dbd", "title": "Frequently Asked Questions (FAQs)", "text": "ut field.\nb. Enter your registered email address or username.\nEnter Your Password\na. Use the second input field to enter your password.\nb. If you're unsure, click the eye icon to see what you're typing.\nClick the Login Button\na. After entering your credentials, click the Login button.\nTrouble Logging In?\na. Click \"Forgot Password\" if you don’t remember your password.\nb. Follow the instructions to reset it.\nChecking the “Remember me” box will store your user details.", "source": "kb\\Frequently Asked Questions.docx", "chunk_index": 4, "chunk_count": 5, "tokens_estimate": 470, "created_at": 1766077251}
{"ns": "default", "id": "ce39b47f7052fe3d7cfac6cb167e82076bf39fa0620014549465752bb1322931", "title": "Household Registration", "text": "Household Registration\nFeature Overview\nThe Household Registration feature empowers Community Health Workers (CHWs) to conduct comprehensive household registration using a mobile application that is specifically designed to function in low-connectivity environments. The process begins with CHWs visiting households within their assigned communities and using the app to assign a unique household identifier (ID) to each family. This unique ID acts as a digital anchor, ensuring that each household’s data is easily trackable and accessible for future follow-ups.\nCHWs are then guided through a structured workflow to collect detailed demographic information for all household members, including names, ages, gender, relationships, and any existing health conditions. This data is crucial for buildin", "source": "kb\\Household Registration.docx", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "8e562ca3fe792ea385e382146dbb5af7ebdd9a8c139a58161c3ea8414f956ead", "title": "Household Registration", "text": "ealth conditions. This data is crucial for building a robust health profile of the community and identifying potential health risks. To enhance accuracy and geographical tracking, CHWs also use the app to capture the precise geospatial location of each household. This mapping feature allows for better resource planning and helps healthcare providers target services more effectively, particularly in hard-to-reach areas.\nRegistration Workflow\nTo use the Household Registration feature, follow these steps:\nFrom the Home page, click on the \"Household\" button.\nChoose \"Add Household\"\nRead and accept the Terms and Conditions on behalf of the participant.\nFill out the registration form with the required details for the Household.\nComplete the registration form for the Household Head member.\nSubmit ", "source": "kb\\Household Registration.docx", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077251}
{"ns": "default", "id": "955d10871e8f9d79ac30cc6fae33d856faf75ed1e2db885aa67a377d8d36065a", "title": "Household Registration", "text": "ration form for the Household Head member.\nSubmit the form to be directed to the either \"Submit\" or \"Start Assessment\" for the individual.\nIf \"Submit\" is chosen, you can choose to register additional members to the household.", "source": "kb\\Household Registration.docx", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 225, "created_at": 1766077251}
{"ns": "default", "id": "406025885f67756bc2c51468b244ce633a18d73cfe87dbb66d03ef73a3d5ca83", "title": "Household Registration", "text": "Household Registration \nFeature Overview \nThe Household Registration feature empowers Community Health Workers (CHWs) to \nconduct comprehensive household registration using a mobile application that is \nspecifically designed to function in low -connectivity environments. The process begins \nwith CHWs visiting households within their assigned communities and using the app to \nassign a unique household identifier (ID) to each family. This unique ID acts as a digital \nanchor, ensuring that each household’s data is easily trackable and accessible for \nfuture follow-ups. \nCHWs are then guided through a structured workflow to collect detailed demographic \ninformation for all household members, including names, ages, gender, relationships, \nand any existing health conditions. This data is crucial", "source": "kb\\Household Registration.pdf", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "7a2ece8174c855595b06fe8de85d3be3cc0a3dab83ff6e311a61b02ea1df0364", "title": "Household Registration", "text": "y existing health conditions. This data is crucial for building a robust health \nprofile of the community and identifying potential health risks. To enhance accuracy \nand geographical tracking, CHWs also use the app to capture the precise geospatial \nlocation of each household. This mapping feature allows for better resource planning \nand helps healthcare providers target services more effectively, particularly in hard -to-\nreach areas. \nRegistration Workflow \nTo use the Household Registration feature, follow these steps: \n1. From the Home page, click on the \"Household\" button. \n2. Choose \"Add Household\" \n3. Read and accept the Terms and Conditions on behalf of the participant. \n4. Fill out the registration form with the required details for the Household. \n5. Complete the registration for", "source": "kb\\Household Registration.pdf", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "1d8fd6e4bb05d98f774f2e6976b084b418205c35ac9eff1e31f851798e98c3a1", "title": "Household Registration", "text": "r the Household. \n5. Complete the registration form for the Household Head member. \n6. Submit the form to be directed to the either \"Submit\" or \"Start Assessment\" for \nthe individual. \n7. If \"Submit\" is chosen, you can choose to register additional members to the \nhousehold.", "source": "kb\\Household Registration.pdf", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 275, "created_at": 1766077252}
{"ns": "default", "id": "92a4fde05b61c11fe3d5a0ec798083c64a4cd548f62b9e742482bc360577881d", "title": "Medical Review", "text": "Medical Review\nMedical Review Overview\nThe Medical Review feature in SPICE is an essential tool designed for healthcare professionals. It enhances the ability to assess, monitor, provide preventive care, achieve early diagnosis, and facilitate continuous treatment and decision-making, particularly for patients with chronic conditions like hypertension, diabetes, malaria, HIV, and tuberculosis. It also addresses other health services such as maternal and child health, mental health, and immunization.\nThis feature enables healthcare providers to conduct medical reviews seamlessly, prescribe treatment plans and medications, recommend lab tests, and maintain comprehensive documentation of patients' health profiles. Moreover, it empowers primary care providers to deliver thorough, long-term sol", "source": "kb\\Medical Review.docx", "chunk_index": 0, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d0414ef09f60c1ab9e3b4f7dd88532f13d464c1dd6e67307bffceb6d8bd1cebe", "title": "Medical Review", "text": " care providers to deliver thorough, long-term solutions, ultimately optimizing healthcare delivery in underserved communities and making healthcare practices more efficient and effective.\nMedical Review Workflow\nEnsure an active internet connection and sign in to the SPICE mobile app using your SPICE credentials.\nNavigate to the 'Home' page and select 'My Patients' to initiate the process.\nSelect 'Start Medical Review' for the specific patient under the 'My Patients' section.\nFollow the intuitive workflow to document necessary details, diagnose the patient, and establish a treatment plan.\nIn case of prescriptions or lab tests, search for the required medication or test, add it, and follow the subsequent steps to confirm.\nSign and confirm the prescriptions when prompted.\nAfter review compl", "source": "kb\\Medical Review.docx", "chunk_index": 1, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "496fcbaa956ce4a8e2dbbf6793668b0851ef04d546927133deb292a152ebb165", "title": "Medical Review", "text": "he prescriptions when prompted.\nAfter review completion, click on 'Submit' to save the changes.\nThe Medical Review feature allows for two distinctive workflows - the First Medical Review and the Continuous Medical Review. The First Medical Review entails the initial thorough check-up of the patient, diagnosis confirmation, capturing details of current lifestyle, medication, comorbidities, complications, physical examination results, and formulating a suitable treatment plan. The Continuous Medical Review enables the follow-up with the patient, noting their ongoing medical condition, reviewing lab test results, prescribing medication, and updating the treatment plan as required.\nMedical Review Workflow\nEnsure an active internet connection and sign in to the SPICE mobile app using your SPICE", "source": "kb\\Medical Review.docx", "chunk_index": 2, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "df5d4b5f5182f717a25ec09b079eda1f11e7f247ffe9edd7ec3ba2ecfdde9503", "title": "Medical Review", "text": "d sign in to the SPICE mobile app using your SPICE credentials.\nNavigate to the 'Home' page and select 'Medical Review' to initiate the process.\nFor a first-time review, fill in the various parameters of the 'First Medical Review Form' and for a follow-up visit, select 'Start Medical Review' for the specific patient under the 'My Patients' section.\nFollow the intuitive workflow to document necessary details, diagnose the patient, and establish a treatment plan.\nIn case of prescriptions or lab tests, search for the required medication or test, add it, and follow the subsequent steps to confirm.\nSign and confirm the prescriptions when prompted.\nAfter review completion, click on 'Submit' to save the changes.\nConduct a Medical Review for the patient in SPICE", "source": "kb\\Medical Review.docx", "chunk_index": 3, "chunk_count": 4, "tokens_estimate": 764, "created_at": 1766077252}
{"ns": "default", "id": "d931d1ff021fee3afaca1495f35e46c29328f18ffb0a390278a0d44965fbaf70", "title": "Medical Review", "text": "Medical Review \nMedical Review Overview \nThe Medical Review feature in SPICE is an essential tool designed for healthcare \nprofessionals. It enhances the ability to assess, monitor, provide preventive care, \nachieve early diagnosis, and facilitate continuous treatment and decision -making, \nparticula rly for patients with chronic conditions like hypertension, diabetes, malaria, \nHIV, and tuberculosis. It also addresses other health services such as maternal and \nchild health, mental health, and immunization. \nThis feature enables healthcare providers to conduct medical reviews seamlessly, \nprescribe treatment plans and medications, recommend lab tests, and maintain \ncomprehensive documentation of patients' health profiles. Moreover, it empowers \nprimary care provi ders to deliver thorough,", "source": "kb\\Medical Review.pdf", "chunk_index": 0, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "0ed58d6d874c855831d3b258a2d9789b94889092f005b1b749bb1ba60af8e7e1", "title": "Medical Review", "text": "wers \nprimary care provi ders to deliver thorough, long -term solutions, ultimately optimizing \nhealthcare delivery in underserved communities and making healthcare practices more \nefficient and effective. \nMedical Review Workflow \n1. Ensure an active internet connection and sign in to the SPICE mobile app using \nyour SPICE credentials. \n2. Navigate to the 'Home' page and select 'My Patients' to initiate the process. \n3. Select 'Start Medical Review' for the specific patient under the 'My Patients' \nsection. \n4. Follow the intuitive workflow to document necessary details, diagnose the \npatient, and establish a treatment plan. \n5. In case of prescriptions or lab tests, search for the required medication or test, \nadd it, and follow the subsequent steps to confirm. \n6. Sign and confirm the p", "source": "kb\\Medical Review.pdf", "chunk_index": 1, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "9b14fbd2c7f5856dbf6839b2b688b00cca71f3c9f30393ffc2d2b462a44d44c6", "title": "Medical Review", "text": "quent steps to confirm. \n6. Sign and confirm the prescriptions when prompted. \n7. After review completion, click on 'Submit' to save the changes. \nThe Medical Review feature allows for two distinctive workflows - the First Medical \nReview and the Continuous Medical Review. The First Medical Review entails the initial \nthorough check -up of the patient, diagnosis confirmation, capturing details of curren t \nlifestyle, medication, comorbidities, complications, physical examination results, and \nformulating a suitable treatment plan. The Continuous Medical Review enables the \nfollow-up with the patient, noting their ongoing medical condition, reviewing lab test \nresults, prescribing medication, and updating the treatment plan as required. \nMedical Review Workflow\n\n1. Ensure an active internet", "source": "kb\\Medical Review.pdf", "chunk_index": 2, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "321b39fd173b4f76063ace9dc2833312a6778f9b4d45579a9456e989006ac91b", "title": "Medical Review", "text": "ical Review Workflow\n\n1. Ensure an active internet connection and sign in to the SPICE mobile app using \nyour SPICE credentials. \n2. Navigate to the 'Home' page and select 'Medical Review' to initiate the process. \n3. For a first -time review, fill in the various parameters of the 'First Medical Review \nForm' and for a follow -up visit, select 'Start Medical Review' for the specific \npatient under the 'My Patients' section. \n4. Follow the intuitive workflow to document necessary details, diagnose the \npatient, and establish a treatment plan. \n5. In case of prescriptions or lab tests, search for the required medication or test, \nadd it, and follow the subsequent steps to confirm. \n6. Sign and confirm the prescriptions when prompted. \n7. After review completion, click on 'Submit' to save the", "source": "kb\\Medical Review.pdf", "chunk_index": 3, "chunk_count": 5, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "3ca21185b0735de29fafa5ffd3f5dc30c0a6850437fcd6cf90195de22ba6f847", "title": "Medical Review", "text": "r review completion, click on 'Submit' to save the changes.\n\nConduct a Medical Review for the patient in SPICE", "source": "kb\\Medical Review.pdf", "chunk_index": 4, "chunk_count": 5, "tokens_estimate": 110, "created_at": 1766077252}
{"ns": "default", "id": "24d25715ca76b00f7e0ad6cc029030b4010e1305ad748849ffee43d832d88921", "title": "My Patients", "text": "My Patients\nFeature Overview\nThe \"My Patients\" feature provides healthcare professionals with a dedicated workspace to view, search, and manage patient records. It offers a holistic overview of patient information, including medical history, prescriptions, Investigations, and vital signs.\nKey features of the \"My Patients\" feature include:\nPatient Record: Access comprehensive patient profiles containing personal details, medical history, and relevant clinical information.\nMedical Review: Perform medical reviews, assess patient conditions, and update treatment plans within the platform.\nPrescriptions: View and manage patient prescriptions, including medication details, dosage, and refill information.\nVital Signs: Monitor and record patient vital signs, such as blood pressure, heart rate, and", "source": "kb\\My Patients.docx", "chunk_index": 0, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "10e8afb0af4d574f9f1ffa64c70397d22f031acf8a90d68eb52f1e8395a17756", "title": "My Patients", "text": "tal signs, such as blood pressure, heart rate, and temperature.\nProgress Tracking: Track patient progress, view trends, and record notes to evaluate treatment effectiveness.\nMy Patients Workflow\nTo effectively utilize the \"My Patients\" feature, follow these steps:\nLogin: Open the SPICE application and sign in using your credentials. Ensure a stable internet connection for seamless access to patient records.\nNavigate to \"My Patients\": Once logged in, locate the \"My Patients\" section in the app's navigation menu. Click on it to enter the \"My Patients\" workspace.\nSearch and Select Patient: Use the search functionality to find a specific patient by name, ID, or other identifying information. Select the desired patient from the search results to access their profile.\nView Patient Information: I", "source": "kb\\My Patients.docx", "chunk_index": 1, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "4ead02e5f75e406c4ea5e57deb7bfb9ffa3eaf931a3c4348248752e74d414649", "title": "My Patients", "text": " access their profile.\nView Patient Information: In the patient profile, review the medical history, prescriptions, Investigations, Diagnosis and vital signs. Familiarize yourself with the relevant information to make informed decisions.\nPerform Medical Review: Conduct a medical review by assessing the patient's condition, reviewing their medical history, and updating treatment plans accordingly. Document any observations or changes in the patient's condition.\nCoordinate Care: Collaborate with other healthcare professionals involved in the patient's care. Share information, assign tasks, and communicate updates to ensure coordinated and comprehensive care delivery.\nManage Prescriptions: Access the patient's prescription records, review medication details, monitor refill status, and make an", "source": "kb\\My Patients.docx", "chunk_index": 2, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2a860c778775814dd3348b52e07fdfb45a9ce6f6ce19f6673f3efa7b217ba98a", "title": "My Patients", "text": "cation details, monitor refill status, and make any necessary adjustments. Ensure accurate and up-to-date medication management.\nMonitor Vital Signs: Regularly record and monitor the patient's vital signs using the platform's integrated tools. Keep track of changes, identify trends, and make informed decisions based on the recorded data.\nTrack Patient Progress: Continuously evaluate the patient's progress, record notes, and update treatment plans as required. Monitor trends, review previous assessments, and make data-driven decisions to optimize patient care.", "source": "kb\\My Patients.docx", "chunk_index": 3, "chunk_count": 4, "tokens_estimate": 565, "created_at": 1766077252}
{"ns": "default", "id": "00ab769f9f101787226bebb8d435e11dcfbb4f0fd12f6e7047117e18200584c8", "title": "My Patients", "text": "My Patients \nFeature Overview \nThe \"My Patients\" feature provides healthcare professionals with a dedicated \nworkspace to view, search, and manage patient records. It offers a holistic overview of \npatient information, including medical history, prescriptions, Investigations, and vital \nsigns. \nKey features of the \"My Patients\" feature include: \n1. Patient Record: Access comprehensive patient profiles containing personal \ndetails, medical history, and relevant clinical information. \n2. Medical Review: Perform medical reviews, assess patient conditions, and update \ntreatment plans within the platform. \n3. Prescriptions: View and manage patient prescriptions, including medication \ndetails, dosage, and refill information. \n4. Vital Signs: Monitor and record patient vital signs, such as blood ", "source": "kb\\My Patients.pdf", "chunk_index": 0, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d2389180dcdcca06bb2498aa321e6c8f4df0cc99853d1baefcb3c6abd01955ae", "title": "My Patients", "text": "tor and record patient vital signs, such as blood pressure, heart \nrate, and temperature. \n5. Progress Tracking: Track patient progress, view trends, and record notes to \nevaluate treatment effectiveness. \nMy Patients Workflow \nTo effectively utilize the \"My Patients\" feature, follow these steps: \n1. Login: Open the SPICE application and sign in using your credentials. Ensure a \nstable internet connection for seamless access to patient records. \n2. Navigate to \"My Patients\": Once logged in, locate the \"My Patients\" section in the \napp's navigation menu. Click on it to enter the \"My Patients\" workspace. \n3. Search and Select Patient: Use the search functionality to find a specific patient \nby name, ID, or other identifying information. Select the desired patient from the \nsearch results to ", "source": "kb\\My Patients.pdf", "chunk_index": 1, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "15d3002021179f452ba4e58ba607a66adc2566ee2762abf1527cdb0e4dfceeb9", "title": "My Patients", "text": "t the desired patient from the \nsearch results to access their profile. \n4. View Patient Information: In the patient profile, review the medical history, \nprescriptions, Investigations, Diagnosis and vital signs. Familiarize yourself with \nthe relevant information to make informed decisions. \n5. Perform Medical Review: Conduct a medical review by assessing the patient's \ncondition, reviewing their medical history, and updating treatment plans \naccordingly. Document any observations or changes in the patient's condition.\n\n6. Coordinate Care: Collaborate with other healthcare professionals involved in the \npatient's care. Share information, assign tasks, and communicate updates to \nensure coordinated and comprehensive care delivery. \n7. Manage Prescriptions: Access the patient's prescription", "source": "kb\\My Patients.pdf", "chunk_index": 2, "chunk_count": 4, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d1d8be3e14ce31bdea1360f5a8d617829b9d63cedddb66b165bdd1b732392dd2", "title": "My Patients", "text": "e Prescriptions: Access the patient's prescription records, review \nmedication details, monitor refill status, and make any necessary adjustments. \nEnsure accurate and up -to-date medication management. \n8. Monitor Vital Signs: Regularly record and monitor the patient's vital signs using \nthe platform's integrated tools. Keep track of changes, identify trends, and make \ninformed decisions based on the recorded data. \n9. Track Patient Progress: Continuously evaluate the patient's progress, record \nnotes, and update treatment plans as required. Monitor trends, review previous \nassessments, and make data -driven decisions to optimize patient care.", "source": "kb\\My Patients.pdf", "chunk_index": 3, "chunk_count": 4, "tokens_estimate": 652, "created_at": 1766077252}
{"ns": "default", "id": "acaf97977c0c8dd6716ed3e089c2d91aa0cf33845f09ed2785451235ca676015", "title": "Pharmacy", "text": "Pharmacy\nFeature Overview\nThe Pharmacy Medication feature assists pharmacists in tracking & dispensing prescribed medications. It provides a detailed view of each medication's attributes and the prescribing physician's details. Pharmacists can provide specific instructions and document any discrepancies between the prescribed and dispensed quantities, all within the platform.\nPharmacist Workflow\nTo use the Pharmacy features, follow these steps:\nEnsure you have an active internet connection and log in to the SPICE platform app using your SPICE account credentials.\nOnce logged in, navigate to the 'Dispense' option on the Home page.\nClick on the 'Dispense' option. You will be redirected to the 'Search Patient' page.\nEnter the National ID/Patient ID of the patient in the search bar and click '", "source": "kb\\Pharmacy.docx", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "c70939e368a8fe1ab8b134256b485489c2cc4b082118a2fb337c917341afa9fc", "title": "Pharmacy", "text": "nt ID of the patient in the search bar and click 'Search'.\nFrom the search results, select the patient card for the patient in question.\nOn the patient's page, you will see parameters such as Program ID, National ID, Prescriber, and Prescriber Number, which are mapped from the medical review. The 'Last Refill Date' shows the last time the medication was refilled. The list of prescribed medications will be displayed in a tabular view. Each entry will show details such as Medication Name, Dosage, Form, Frequency, Prescribed Days, and Days Filled.\nClick on a specific medication to see additional details, such as the date the medication was prescribed and its dosage form. If there are specific instructions for taking the medicine, these will be recorded in the 'Instructions' text box.\nIf the '", "source": "kb\\Pharmacy.docx", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "b401c36d47a634753365301edcfc3ec5c47d6f5a9e410b2bc09bac33c7f8eeeb", "title": "Pharmacy", "text": " recorded in the 'Instructions' text box.\nIf the 'Days Filled' is less than the 'Prescribed Days', enter the 'Days Filled' value and click 'Done'. A pop-up will appear, asking for the reason for the quantity difference.\nClick on 'Reason' and select the appropriate reason for the quantity discrepancy. After selecting the reason, complete the process.\nDispense medication in SPICE", "source": "kb\\Pharmacy.docx", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 380, "created_at": 1766077252}
{"ns": "default", "id": "ca4a47ae778b1b2984164b3b7fc22b813a76378e9144ea728ed698c243b01022", "title": "Pharmacy", "text": "Pharmacy \nFeature Overview \nThe Pharmacy Medication feature assists pharmacists in tracking & dispensing \nprescribed medications. It provides a detailed view of each medication's attributes and \nthe prescribing physician's details. Pharmacists can provide specific instructions and \ndocument any discrepancies between the prescribed and dispensed quantities, all \nwithin the platform. \nPharmacist Workflow \nTo use the Pharmacy features, follow these steps: \n1. Ensure you have an active internet connection and log in to the SPICE platform \napp using your SPICE account credentials. \n2. Once logged in, navigate to the 'Dispense' option on the Home page. \n3. Click on the 'Dispense' option. You will be redirected to the 'Search Patient' page. \n4. Enter the National ID/Patient ID of the patient in t", "source": "kb\\Pharmacy.pdf", "chunk_index": 0, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "ffeb657e09468c53e15786c83badb0c0f3adc3fc0120279b3f5e44a7a8fe8fe9", "title": "Pharmacy", "text": "ter the National ID/Patient ID of the patient in the search bar and click \n'Search'. \n1. From the search results, select the patient card for the patient in \nquestion. \n5. On the patient's page, you will see parameters such as Program ID, National ID, \nPrescriber, and Prescriber Number, which are mapped from the medical review. \nThe 'Last Refill Date' shows the last time the medication was refilled. The list of \nprescribed medi cations will be displayed in a tabular view. Each entry will show \ndetails such as Medication Name, Dosage, Form, Frequency, Prescribed Days, \nand Days Filled. \n6. Click on a specific medication to see additional details, such as the date the \nmedication was prescribed and its dosage form. If there are specific instructions \nfor taking the medicine, these will be re", "source": "kb\\Pharmacy.pdf", "chunk_index": 1, "chunk_count": 3, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "a5f3e76a01c194950f4a4ea996b95553098d95977a2b6eda558ed2a9c4966da3", "title": "Pharmacy", "text": "uctions \nfor taking the medicine, these will be recorded in the 'Instructions' text box. \n7. If the 'Days Filled' is less than the 'Prescribed Days', enter the 'Days Filled' value \nand click 'Done'. A pop -up will appear, asking for the reason for the quantity \ndifference. \n8. Click on 'Reason' and select the appropriate reason for the quantity discrepancy. \nAfter selecting the reason, complete the process.\n\nDispense medication in SPICE", "source": "kb\\Pharmacy.pdf", "chunk_index": 2, "chunk_count": 3, "tokens_estimate": 440, "created_at": 1766077252}
{"ns": "default", "id": "5eed380a8a854a1110fb4d77df6b7fffb4dba22a0bfe7c891343113629d868b7", "title": "Privacy Policy", "text": "Privacy Policy\nPrivacy Statement\nPlease read this privacy statement carefully.\nINTRODUCTION\nThis Privacy Statement tells you how we protect and use information that we gather through MEDTRONIC LABS SPICE Mobile Application (the “Application” or “App”). This Privacy Statement is intended for a global audience.\nThis Privacy Statement was last revised on July 29, 2022. We may change the Privacy Statement at any time and for any reason.\nExcept as written in any other disclaimers, policies, terms of use, or other notices in an Application, this Privacy Statement is a complete agreement between you and MEDTRONIC LABS with respect to your use of the Application. By using MEDTRONIC LABS SPICE Mobile Application (the “Application” or “App”), you agree to the terms of the most recent version of this", "source": "kb\\Privacy Policy.docx", "chunk_index": 0, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "5068b92f460ef3a9c926948c1a72d81fcc0be7e0553728303db2255bc95cc587", "title": "Privacy Policy", "text": "ee to the terms of the most recent version of this Privacy Statement. You may be subject to additional terms that may apply when you access particular services or materials on certain areas in this Application, or by following a link from this Application.\nThe full list of regulations that SPICE complies with is as follows: General Data Protection Regulation (GDPR) Kenya Data Protection Act, 2019 Ghana Data Protection Act, 2012 Tanzania Personal Data Protection Act, 2022.\nThe Applications are owned and operated by MEDTRONIC LABS. MEDTRONIC LABS is the name we use to refer to our whole business, including MEDTRONIC LABS PBC and any of the companies that it controls, such as its subsidiaries and affiliates. When we use the words \"we\" or \"our,\" we mean MEDTRONIC LABS. The information we recei", "source": "kb\\Privacy Policy.docx", "chunk_index": 1, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "b21761d296c2f525f0e1b0c772079acb86d47a63452fb1f1d60e271905a3a333", "title": "Privacy Policy", "text": "\" we mean MEDTRONIC LABS. The information we receive, and how we use it, depends on what you do when using the Application.\nWe collect and use both personal information (information that is identifiable to you personally) and non-personal information about you through the application. Please see below for a definition of personal and non-personal information, and how MEDTRONIC LABS may use them.\nWHAT IS PRIVATE INFORMATION\nPersonal information is information that we can use to specifically identify you, such as your:\nFirst Name\nLast Name\nCity/Town name\nTelephone number\nEmail\nDate of birth\nAccount name\nGeolocation information\nHealth condition(s) and related health data\nBiometric data\nHospital/clinic name, address, and phone number\nInformation about how you use the App, such as links or func", "source": "kb\\Privacy Policy.docx", "chunk_index": 2, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "8d78bc26ede26bed09c44e83c25b6072453804e87d36a304116238cb9ad92f3a", "title": "Privacy Policy", "text": "n about how you use the App, such as links or functions you may access within the App\nHOW DOES MEDTRONIC LABS COLLECT AND USE YOUR PERSONAL INFORMATION?\nWe may collect and use personal information from you through this App to provide you with access to the App. You may choose not to provide us with this information, but then you may not be able to access and utilize the App. In addition, we may keep and use your personal information:\nIf you are a Patient, to transmit data to your Health Care Provider\nTo provide services to you through the App\nTo send you notifications\nTo respond to your requests\nTo develop records, including records of your personal information\nTo analyze how people use our App and to research, develop, and improve programs, products, services, and content\nTo create a set ", "source": "kb\\Privacy Policy.docx", "chunk_index": 3, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "0dac87d7358c97028369e4fcd4850baf79b308e681ab388d9304f1885fb2a28c", "title": "Privacy Policy", "text": ", products, services, and content\nTo create a set of data that has only non-personal or de-identified information. In this case, we would remove your personal identifiers (your name, email address, biometric data, etc.) and we may treat it like other non-personal or de-identified information\nTo enforce this Privacy Statement and other rules about your use of this App\nTo protect our rights or property\nTo protect someone's health, safety, or welfare\nTo comply with a law or regulation, court order or other legal process\nDOES MEDTRONIC LABS EVER SHARE PERSONAL INFORMATION WITH THIRD PARTIES?\nMEDTRONIC LABS will not share your personal information collected from the App with an unrelated third-party without your permission, except as otherwise provided in this Privacy Statement. MEDTRONIC LABS ", "source": "kb\\Privacy Policy.docx", "chunk_index": 4, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d7bb330598417b8ed76d52cd2be4574f8cc53f087ae8d1be9b40529d4f275acb", "title": "Privacy Policy", "text": "rovided in this Privacy Statement. MEDTRONIC LABS may share de-identified information with approved partners and affiliates for purposes that are consistent with those identified in this Privacy Statement.\nIn the ordinary course of business, we will share some personal information with companies that we hire to perform services or functions on our behalf. In all cases in which we share your personal information with a third-party, we will not authorize them to keep, disclose or use your information with others except for the purpose of providing the services we asked them to provide.\nWe may be legally compelled to release your personal information in response to a court order, subpoena, search warrant, law, or regulation. We may cooperate with law enforcement authorities in investigating a", "source": "kb\\Privacy Policy.docx", "chunk_index": 5, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "6e2569757a4e2440ae17147eb1e9ef884f58dbb1348e41b872ccea0644e68181", "title": "Privacy Policy", "text": "ith law enforcement authorities in investigating and prosecuting Application users who violate our rules or engage in behavior which is harmful to other visitors (or illegal). In addition, we may keep, disclose, and use your personal information in order to comply with U.S. FDA and other governmental guidance, directions, regulations, and laws.\nWe may disclose your personal information to third parties if we feel that the disclosure is necessary to:\nEnforce this Privacy Statement and the other rules about your use of the App\nProtect our rights or property\nProtect someone's health, safety, or welfare\nComply with a law or regulation, court order or other legal process\nTRANSFERS BETWEEN COUNTRIES\nFor West- and East African Users: By accepting this, you are giving us authorization to receive, ", "source": "kb\\Privacy Policy.docx", "chunk_index": 6, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "834d3d66608cb99a8fd1e4865729f2c5dedb479d7f96d97ff9934e5d3ea1be34", "title": "Privacy Policy", "text": "this, you are giving us authorization to receive, process, and use your personal information, including sensitive data, and also transfer the data out of your country to our affiliates and subsidiaries internationally, or third parties hired by MEDTRONIC LABS to manage the App.\nWHAT DOES MEDTRONIC LABS DO WITH NON-PERSONAL INFORMATION?\nNon-personal information is information that cannot identify you. We are always looking for ways to better serve you and improve this App. We will use non-personal information from you to help us make this App more useful to visitors. We also will use non-personal information for other business purposes. For example, we may use non-personal information or aggregate non-personal information to:\nCreate reports for internal use to develop programs, products, se", "source": "kb\\Privacy Policy.docx", "chunk_index": 7, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "e8c6c04895bf9ca1aa5c2fd33477b30d00940b89949813288eabb95306bd288e", "title": "Privacy Policy", "text": "for internal use to develop programs, products, services, or content\nShare it with or sell it to third parties\nProvide aggregated information on how visitors use our site, such as 'traffic statistics' and 'response rates,' to third parties\nWHAT ABOUT PRIVACY ON OTHER APPLICATIONS?\nThis application does not contain links to other apps or websites.\nARE THERE SPECIAL RULES ABOUT CHILDREN'S PRIVACY?\nWe care about protecting the online privacy of children. We will not intentionally collect any personal information (such as a child's name or e-mail address) from children under the age of 18 unless a parent or legal guardian has provided consent for us to do so. If you think that we have unlawfully collected personal information from a child under the age of 18, please contact us. For West- and E", "source": "kb\\Privacy Policy.docx", "chunk_index": 8, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "36273c18e591c2a23a98414592f4e42746a301819a0ff795404c349f5a01a01f", "title": "Privacy Policy", "text": " the age of 18, please contact us. For West- and East African users, please notify us regarding children under the age of 18.\nWHAT ABOUT APPLICATION SECURITY?\nSecurity is very important to us. We also understand that security is important to you. We take reasonable steps to protect your personal information from loss, misuse, and unauthorized access, disclosure, alteration, or destruction. You should keep in mind that no Internet transmission is ever 100% secure or error-free. You acknowledge that you are responsible for maintaining the confidentiality and security of any of your data available via the App on your mobile device, by using an ID and password credentials for your mobile device.\nHOW TO CONTACT MEDTRONIC LABS\nIf you have questions or comments about this Privacy Statement, pleas", "source": "kb\\Privacy Policy.docx", "chunk_index": 9, "chunk_count": 11, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "c07e8ce782395b308f6324dbf6436de37adf2fd5fc56c389490be8c3a2491aa6", "title": "Privacy Policy", "text": "ns or comments about this Privacy Statement, please contact us here. You may use the Contact Us form on our website to exercise your rights to access, rectify, update, and/or eliminate your personal information or ask for non-disclosure (www.medtroniclabs.org). Elimination may not be possible if it can cause damage to third parties or if preserving your personal information is required by any law or regulation.\nDisclaimer: This page may include information about products that may not be available in your region or country. Please consult the approved indications for use. Content on specific MEDTRONIC LABS products is not intended for users in markets that do not have authorization for use.", "source": "kb\\Privacy Policy.docx", "chunk_index": 10, "chunk_count": 11, "tokens_estimate": 698, "created_at": 1766077252}
{"ns": "default", "id": "8c6000205603b2b7bc1dda41c77fa8888b473c92d9767809000e433c9fb0ac21", "title": "Privacy Policy", "text": "Privacy Policy \nPrivacy Statement \nPlease read this privacy statement carefully. \nINTRODUCTION \nThis Privacy Statement tells you how we protect and use information that we gather \nthrough MEDTRONIC LABS SPICE Mobile Application (the “Application” or “App”). This \nPrivacy Statement is intended for a global audience. \nThis Privacy Statement was last revised on July 29, 2022. We may change the Privacy \nStatement at any time and for any reason. \nExcept as written in any other disclaimers, policies, terms of use, or other notices in an \nApplication, this Privacy Statement is a complete agreement between you and \nMEDTRONIC LABS with respect to your use of the Application. By using MEDTRONIC \nLABS SPICE Mobile Application (the “Application” or “App”), you agree to the terms of \nthe most recent ve", "source": "kb\\Privacy Policy.pdf", "chunk_index": 0, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "f6ff497ce2665b75ceaf5417a8005380a9c70496ea034f90f3c3805ff5d103ce", "title": "Privacy Policy", "text": "p”), you agree to the terms of \nthe most recent version of this Privacy Statement. You may be subject to additional \nterms that may apply when you access particular services or materials on certain areas \nin this Application, or by following a link from this Application. \nThe full list of regulations that SPICE complies with is as follows: General Data \nProtection Regulation (GDPR) Kenya Data Protection Act, 2019 Ghana Data Protection \nAct, 2012 Tanzania Personal Data Protection Act, 2022. \nThe Applications are owned and operated by MEDTRONIC LABS. MEDTRONIC LABS is \nthe name we use to refer to our whole business, including MEDTRONIC LABS PBC and \nany of the companies that it controls, such as its subsidiaries and affiliates. When we \nuse the wo rds \"we\" or \"our,\" we mean MEDTRONIC LABS. T", "source": "kb\\Privacy Policy.pdf", "chunk_index": 1, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2d95ed851fa849fc973adb967e464760f29c26feeeb00f03cb10d74958a577a3", "title": "Privacy Policy", "text": "he wo rds \"we\" or \"our,\" we mean MEDTRONIC LABS. The information we receive, \nand how we use it, depends on what you do when using the Application. \nWe collect and use both personal information (information that is identifiable to you \npersonally) and non -personal information about you through the application. Please see \nbelow for a definition of personal and non -personal information, and how MEDTRONIC \nLABS may use them. \nWHAT IS PRIVATE INFORMATION \nPersonal information is information that we can use to specifically identify you, such as \nyour: \n• First Name \n• Last Name \n• City/Town name\n\n• Telephone number \n• Email \n• Date of birth \n• Account name \n• Geolocation information \n• Health condition(s) and related health data \n• Biometric data \n• Hospital/clinic name, address, and phone n", "source": "kb\\Privacy Policy.pdf", "chunk_index": 2, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "acc46d99a848674f72b052b2044a18be9087fe330719dc7aa63dc650c86fa60f", "title": "Privacy Policy", "text": "data \n• Hospital/clinic name, address, and phone number \n• Information about how you use the App, such as links or functions you may \naccess within the App \nHOW DOES MEDTRONIC LABS COLLECT AND USE YOUR PERSONAL \nINFORMATION? \nWe may collect and use personal information from you through this App to provide you \nwith access to the App. You may choose not to provide us with this information, but \nthen you may not be able to access and utilize the App. In addition, we may keep and \nuse your personal information: \n• If you are a Patient, to transmit data to your Health Care Provider \n• To provide services to you through the App \n• To send you notifications \n• To respond to your requests \n• To develop records, including records of your personal information \n• To analyze how people use our App an", "source": "kb\\Privacy Policy.pdf", "chunk_index": 3, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "48a90de694fb371dfa4f5fc838f93c579ce6db9006668f6cabe0e778c23d8c98", "title": "Privacy Policy", "text": "nformation \n• To analyze how people use our App and to research, develop, and improve \nprograms, products, services, and content \n• To create a set of data that has only non -personal or de -identified information. In \nthis case, we would remove your personal identifiers (your name, email address, \nbiometric data, etc.) and we may treat it like other non -personal or de -identified \ninformati on \n• To enforce this Privacy Statement and other rules about your use of this App \n• To protect our rights or property \n• To protect someone's health, safety, or welfare \n• To comply with a law or regulation, court order or other legal process\n\nDOES MEDTRONIC LABS EVER SHARE PERSONAL INFORMATION WITH THIRD \nPARTIES? \nMEDTRONIC LABS will not share your personal information collected from the App with ", "source": "kb\\Privacy Policy.pdf", "chunk_index": 4, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "f6f89f886f84f021154cec159491460fc0b21922e3c39514e9db50662b099c6a", "title": "Privacy Policy", "text": " personal information collected from the App with \nan unrelated third -party without your permission, except as otherwise provided in this \nPrivacy Statement. MEDTRONIC LABS may share de -identified information with \napproved p artners and affiliates for purposes that are consistent with those identified in \nthis Privacy Statement. \nIn the ordinary course of business, we will share some personal information with \ncompanies that we hire to perform services or functions on our behalf. In all cases in \nwhich we share your personal information with a third -party, we will not authorize them \nto keep, disclose or use your information with others except for the purpose of providing \nthe services we asked them to provide. \nWe may be legally compelled to release your personal information in respon", "source": "kb\\Privacy Policy.pdf", "chunk_index": 5, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "5761156eb59fe9f2e7666608be4004a4b104ac66c75734e18a7d193e1ca3df87", "title": "Privacy Policy", "text": "led to release your personal information in response to a \ncourt order, subpoena, search warrant, law, or regulation. We may cooperate with law \nenforcement authorities in investigating and prosecuting Application users who violate \nour rules or engage in behavior which is harmful to other visitors (or illegal). In addition, \nwe may keep, disclose, and use your personal information in order to comply with U.S. \nFDA and other governmental guidance, directions, regulations, and laws. \nWe may disclose your personal information to third parties if we feel that the disclosure \nis necessary to: \n• Enforce this Privacy Statement and the other rules about your use of the App \n• Protect our rights or property \n• Protect someone's health, safety, or welfare \n• Comply with a law or regulation, court ", "source": "kb\\Privacy Policy.pdf", "chunk_index": 6, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "c32a4108cee3596e1e806d849cf860fe6e1ea311b3644d9f2c3a9b86660fbe60", "title": "Privacy Policy", "text": "welfare \n• Comply with a law or regulation, court order or other legal process \nTRANSFERS BETWEEN COUNTRIES \nFor West - and East African Users: By accepting this, you are giving us authorization to \nreceive, process, and use your personal information, including sensitive data, and also \ntransfer the data out of your country to our affiliates and subsidiaries interna tionally, or \nthird parties hired by MEDTRONIC LABS to manage the App. \nWHAT DOES MEDTRONIC LABS DO WITH NON -PERSONAL INFORMATION? \nNon-personal information is information that cannot identify you. We are always looking \nfor ways to better serve you and improve this App. We will use non -personal information \nfrom you to help us make this App more useful to visitors. We also will use non -personal \ninformation for other busine", "source": "kb\\Privacy Policy.pdf", "chunk_index": 7, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "384efd5baf6be7c6ff4b2eaa367b17ebf870a006924928f3bc2330eb3a98f27e", "title": "Privacy Policy", "text": "ll use non -personal \ninformation for other business purposes. For example, we may use non -personal \ninformation or aggregate non -personal information to:\n\n• Create reports for internal use to develop programs, products, services, or \ncontent \n• Share it with or sell it to third parties \n• Provide aggregated information on how visitors use our site, such as 'traffic \nstatistics' and 'response rates,' to third parties \nWHAT ABOUT PRIVACY ON OTHER APPLICATIONS? \nThis application does not contain links to other apps or websites. \nARE THERE SPECIAL RULES ABOUT CHILDREN'S PRIVACY? \nWe care about protecting the online privacy of children. We will not intentionally collect \nany personal information (such as a child's name or e -mail address) from children \nunder the age of 18 unless a parent or", "source": "kb\\Privacy Policy.pdf", "chunk_index": 8, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "8a1d3eb51c3b02a3aef3cb25f27af8581b68caf43f1644e3557dbc66df8f478b", "title": "Privacy Policy", "text": "m children \nunder the age of 18 unless a parent or legal guardian has provided consent for us t o do \nso. If you think that we have unlawfully collected personal information from a child \nunder the age of 18, please contact us. For West - and East African users, please notify \nus regarding children under the age of 18. \nWHAT ABOUT APPLICATION SECURITY? \nSecurity is very important to us. We also understand that security is important to you. \nWe take reasonable steps to protect your personal information from loss, misuse, and \nunauthorized access, disclosure, alteration, or destruction. You should keep in min d \nthat no Internet transmission is ever 100% secure or error -free. You acknowledge that \nyou are responsible for maintaining the confidentiality and security of any of your data \navai", "source": "kb\\Privacy Policy.pdf", "chunk_index": 9, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "41f339f2b204f6674927dcc0b8de14773ba0c68326763367414a62a364179c71", "title": "Privacy Policy", "text": "identiality and security of any of your data \navailable via the App on your mobile device, by using an ID and password creden tials for \nyour mobile device. \nHOW TO CONTACT MEDTRONIC LABS \nIf you have questions or comments about this Privacy Statement, please contact us \nhere. You may use the Contact Us form on our website to exercise your rights to access, \nrectify, update, and/or eliminate your personal information or ask for non -disclosure \n(www.medtroniclabs.org). Elimination may not be possible if it can cause damage to \nthird parties or if preserving your personal information is required by any law or \nregulation. \nDisclaimer: This page may include information about products that may not be \navailable in your region or country. Please consult the approved indications for use. \nConte", "source": "kb\\Privacy Policy.pdf", "chunk_index": 10, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "6e874657ba8b7dd31ccfd0c1371af20c7e9faf61916862d2cf5ab3843543143f", "title": "Privacy Policy", "text": "e consult the approved indications for use. \nContent on specific MEDTRONIC LABS products is not intended for users in markets \nthat do not have author ization for use.", "source": "kb\\Privacy Policy.pdf", "chunk_index": 11, "chunk_count": 12, "tokens_estimate": 167, "created_at": 1766077252}
{"ns": "default", "id": "085e2f87fb1f2ec4367f9a29e453bb8f4b62e2f72e694850d67f3d6090d3fff6", "title": "Roadmap", "text": "Roadmap\nRoadmap & Upcoming Releases\nHigh-Level Product Roadmap\nWe build our product roadmap using the \"Now, Next, Future\" framework to drive our product focus and vision for the future. The below provides our high level roadmap and is no inclusive of all new product enhancements, bug fixes, and feature sets that we will introduce in the next versions. For information on our full product prioritization process, see our Prioritization Framework below.\nNow\nNext\nFuture\nAbility to import the country geographic data\nAutomated the previously time-consuming process of loading district, county, and sub-county details into SPICE, enabling bulk uploads of geospatial data via the admin portal.\nCHW Performance Monitoring\nPeer supervisors can monitor community health workers' performance by viewing dail", "source": "kb\\Roadmap.docx", "chunk_index": 0, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "f21bc197384b1c10cba634498e8608daf5b9bbfab89761dbb27da34002557db0", "title": "Roadmap", "text": "munity health workers' performance by viewing daily metrics, including the number of assessments, follow-up visits, and calls completed.\nAI Model to predict patient retention\nWe are building a patient retention model to identify patients that are likely to be lost to follow-up and design interventions within SPICE to engage these patients before they churn.\nUpcoming 2.0 Release - Coming September 2024\nOur next major open source release will be SPICE 2.0. We are building SPICE 2.0 to be the next generation primary care platform; re-imagining primary care to be data-driven and outcomes focused.\nThe SPICE 2.0 release will support the following features:\nAlgorithm-driven disease pathways for NCDs, TB, Malaria, HIV, ANC, PNC, child health, and immunization\nClosed loop, risk-based follow-up at c", "source": "kb\\Roadmap.docx", "chunk_index": 1, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2b54ea01e09cc369edd8fac5b2e080cddbfa3cd623ebd3fc7258fa68fc1fc5a9", "title": "Roadmap", "text": "mmunization\nClosed loop, risk-based follow-up at community and facility levels\nAdvanced admin portal features\nCustomized dashboards for community & facility performance\nReal-time outcomes tracking by disease area\nFHIR Hybrid Architecture\nSPICE 2.0 Features\nNew Feature Requests & Prioritization\nSubmitting Feature Requests\nTo submit a new feature request, raise an issue in GitHub in the specific project (Android, Admin Web, Server, FHIR Adapter). To best prioritize the feature requests, we need to understand the why, what, and how of the requests coming from the end users.\nFollow the steps below to submit a new feature request:\nAdd a descriptive Title summarizing the feature\nDescribe the feature with as much detail as possible in the Description field. Include the following details:\nProblem ", "source": "kb\\Roadmap.docx", "chunk_index": 2, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "b1cc50eecf7b35b0919d9025ad703edeb8838d9a8837928fbfba6d94e88538d4", "title": "Roadmap", "text": "ion field. Include the following details:\nProblem Statement\nPriority (Highest, High, Medium, Low)\nImpacted Users\nImpacted Workflows\nTag the issue as a \"enhancement\" using the labels\nIf possible, attach any images to further explain the feature request (screenshots are very helpful!)\nPrioritization Process\nMedtronic LABS will review all feature requests and issues submitted through the formal channel. In order to prioritize the issues and features, we follow the below process to prioritize new feature requests, enhancements, and bug fixes/issues.\nPrioritizing Framework: MoSCoW: Must Have, Should Have, Could Have, Won't Have\nMust Have Highest Priority\nWe genuinely cannot launch without this due to business needs, legal reasons and safety concerns—it would be a terrible idea to launch without", "source": "kb\\Roadmap.docx", "chunk_index": 3, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "73ade9e61d40c9c1fca5b798011057ca193689c12ba8badf8a434d8ebfd31a5b", "title": "Roadmap", "text": "erns—it would be a terrible idea to launch without this!\nShould Have High Priority\nIt would be best to include these, but our product won’t be an absolute failure without them.\nCould Have Medium Priority\nNice-to-haves if we have the resources and time. But not necessary for success. Think of how each requirement (or lack thereof) will affect customer experience.\nWon't Have Low Priority\nWe’ve made an active decision that it’s not coming out with this launch.\nFactors that influence the prioritization:\nValue Proposition\nStakeholder Prioritizations\nFeedback from the end users\nNumber of users Impacted\nProduct Usage and Adoption metrics\nPatient Outcomes\nPatient Engagement\nDesign, Development and Efforts\nPriority of the issue/defect.\nWe also look at the Value/Effort scale for feature requests.\nTh", "source": "kb\\Roadmap.docx", "chunk_index": 4, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "0f25bab9f09ed35e8bb843e0ec50c3ade3ec5af1f5b65c5f672ec4cde90bfc11", "title": "Roadmap", "text": "at the Value/Effort scale for feature requests.\nThe objective is to identify features that will have the highest impact with the lowest effort.\nBuild these first. Next, build high impact, high effort features. This will also differ based on the request from different region.\nEach feature is rated by a) effort to build the feature and b) potential impact on business value - Highest, High, Medium Priority items from the previous process.\nDeprioritizing low impact, low effort features, and do NOT build low impact, high effort features!", "source": "kb\\Roadmap.docx", "chunk_index": 5, "chunk_count": 6, "tokens_estimate": 538, "created_at": 1766077252}
{"ns": "default", "id": "5897a48ca9af92edba0946e4240b3dd2d0a32e22ec58675714dab9a173b73158", "title": "Roadmap", "text": "Roadmap \nRoadmap & Upcoming Releases \nHigh-Level Product Roadmap \nWe build our product roadmap using the \"Now, Next, Future\" framework to drive our \nproduct focus and vision for the future. The below provides our high level roadmap and \nis no inclusive of all new product enhancements, bug fixes, and feature sets that we wi ll \nintroduce in the next versions. For information on our full product prioritization process, \nsee our Prioritization Framework below. \nNow \nNext \nFuture \nAbility to import the country geographic data \nAutomated the previously time -consuming process of loading district, county, and sub -\ncounty details into SPICE, enabling bulk uploads of geospatial data via the admin \nportal. \nCHW Performance Monitoring \nPeer supervisors can monitor community health workers' performa", "source": "kb\\Roadmap.pdf", "chunk_index": 0, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "515f4a9b210875b85ebf1ed2257858f257b5bf0edf50e48502439ddf39f958a9", "title": "Roadmap", "text": "ors can monitor community health workers' performance by viewing daily \nmetrics, including the number of assessments, follow -up visits, and calls completed. \nAI Model to predict patient retention \nWe are building a patient retention model to identify patients that are likely to be lost to \nfollow-up and design interventions within SPICE to engage these patients before they \nchurn. \nUpcoming 2.0 Release - Coming September 2024 \nOur next major open source release will be SPICE 2.0. We are building SPICE 2.0 to be \nthe next generation primary care platform; re -imagining primary care to be data -driven \nand outcomes focused. \nThe SPICE 2.0 release will support the following features: \n• Algorithm -driven disease pathways for NCDs, TB, Malaria, HIV, ANC, PNC, child \nhealth, and immunization \n", "source": "kb\\Roadmap.pdf", "chunk_index": 1, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "feb10c796e067ccf87c1ca018108541cc0754aff7bf890a2199dca4750214ce5", "title": "Roadmap", "text": ", HIV, ANC, PNC, child \nhealth, and immunization \n• Closed loop, risk -based follow -up at community and facility levels \n• Advanced admin portal features \n• Customized dashboards for community & facility performance\n\n• Real-time outcomes tracking by disease area \n• FHIR Hybrid Architecture \n \nSPICE 2.0 Features \nNew Feature Requests & Prioritization \nSubmitting Feature Requests \nTo submit a new feature request, raise an issue in GitHub in the specific project \n(Android, Admin Web, Server, FHIR Adapter). To best prioritize the feature requests, we \nneed to understand the why, what, and how of the requests coming from the end users. \nFollow the steps below to submit a new feature request: \n1. Add a descriptive Title summarizing the feature \n2. Describe the feature with as much detail as pos", "source": "kb\\Roadmap.pdf", "chunk_index": 2, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "30e2789f017ae230b2cb5f067b60cbfb8480eff4ac9f1c8023e7d19e7fb92820", "title": "Roadmap", "text": "2. Describe the feature with as much detail as possible in the Description field. \nInclude the following details: \n1. Problem Statement \n2. Priority (Highest, High, Medium, Low) \n3. Impacted Users \n4. Impacted Workflows \n3. Tag the issue as a \"enhancement\" using the labels \n4. If possible, attach any images to further explain the feature request (screenshots \nare very helpful!) \nPrioritization Process\n\nMedtronic LABS will review all feature requests and issues submitted through the formal \nchannel. In order to prioritize the issues and features, we follow the below process to \nprioritize new feature requests, enhancements, and bug fixes/issues. \nPrioritizing Framework: MoSCoW: Must Have, Should Have, Could Have, Won't \nHave \nMust Have Highest Priority \nWe genuinely cannot launch without th", "source": "kb\\Roadmap.pdf", "chunk_index": 3, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "83230e8fb948f0d92e24b7e5103669e2cb831aef0054e9c0318f4626e6e8fdac", "title": "Roadmap", "text": "st Priority \nWe genuinely cannot launch without this due to business needs, legal reasons and \nsafety concerns —it would be a terrible idea to launch without this! \nShould Have High Priority \nIt would be best to include these, but our product won’t be an absolute failure without \nthem. \nCould Have Medium Priority \nNice-to-haves if we have the resources and time. But not necessary for success. Think \nof how each requirement (or lack thereof) will affect customer experience. \nWon't Have Low Priority \nWe’ve made an active decision that it’s not coming out with this launch. \nFactors that influence the prioritization: \n1. Value Proposition \n2. Stakeholder Prioritizations \n3. Feedback from the end users \n4. Number of users Impacted \n5. Product Usage and Adoption metrics \n6. Patient Outcomes \n7. ", "source": "kb\\Roadmap.pdf", "chunk_index": 4, "chunk_count": 6, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "b3d3f334c7837dda4e929ed1ae30b72aacc8d54c142157428f10abe2ee52bb96", "title": "Roadmap", "text": "age and Adoption metrics \n6. Patient Outcomes \n7. Patient Engagement \n8. Design, Development and Efforts \n9. Priority of the issue/defect. \nWe also look at the Value/Effort scale for feature requests. \n1. The objective is to identify features that will have the highest impact with the \nlowest effort.\n\n2. Build these first. Next, build high impact, high effort features. This will also differ \nbased on the request from different region. \n3. Each feature is rated by a) effort to build the feature and b) potential impact on \nbusiness value - Highest, High, Medium Priority items from the previous process. \n4. Deprioritizing low impact, low effort features, and do NOT build low impact, high \neffort features!", "source": "kb\\Roadmap.pdf", "chunk_index": 5, "chunk_count": 6, "tokens_estimate": 711, "created_at": 1766077252}
{"ns": "default", "id": "0596fe7d20fd9139a95dab8ff0deb9dbb35cd0936d3ff2d800fefc939880626d", "title": "Roles & Responsibility Mapping", "text": "Roles & Responsibility Mapping\nLevel 1 – SPICE Site Admins (SPICE CHAMPIONs)\nA SPICE Site Admin is a SPICE user from the facility who has a comprehensive knowledge of the SPICE application and can assist colleagues with questions related to usage. The SPICE Site Admin who is the Level 1 POC for that facility is also the Site Admin of the facility and is given access to the Admin Portal. Responsibilities of the Facility Champion include:\nData management:\nEnsuring all devices are connected to the internet and offline screening records are updated on a timely interval to avoid data loss\nConducting bi-weekly audits of the devices to validate if the offline screening records are uploaded\nAdvocating to prevent duplicate enrolment\nDevice and QR Codes management\nMaintaining the stock of QR codes a", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 0, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2923c5391d23f3fff17d7c7c4a4d08536fee6f3d171b5a2bd49274e1e6a70720", "title": "Roles & Responsibility Mapping", "text": "des management\nMaintaining the stock of QR codes and informing the operation associate in advance if they are going to be depleted\nEnsure all the devices are up to date with latest spice release\nDevice maintenance and warranty management\nTraining new users – onboarding them to SPICE\nTraining and onboarding new users into SPICE\nTicket creation\nRecord a screenshot or a video in case of any issues and report it to Freshservice ticketing tool.\nAdd relevant information of the issue and share necessary evidence.\nReport the quicksight data variance issue with the relevant evidence.\nReport the app feedback in the UV Desk tool\nLevel 2 - Operation Associate\nThe Operations Associate are the level 2 poc for the SPICE Support process. The Level 2 Operation Associate is responsible for auditing the work", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 1, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d155ad63cdc13cce1740e72f01454ca55c8458798005352bd19d138c2b30bc9d", "title": "Roles & Responsibility Mapping", "text": "ion Associate is responsible for auditing the work done by the Site admin to ensure that user information is accurate and appropriate roles are assigned to users. The main responsibilities of this role include:\nUser Management\nCreating user roles for colleagues in the facility\nDeleting users from the facility if a user has left permanently\nUnlocking/resetting a user’s password if it is locked\nEditing user information for the facility\nAssigning appropriate user roles to users in the facility based on their job functions\nAdding appropriate user information when creating a user account, such as user email, phone number, user role, and time zone\nAssigning users to the SPICE Insights Portal for QuickSight and reporting\nCreating user accounts in the SPICE Admin Portal for SPICE mobile app users\n", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 2, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2606dc3be554b90c4460d40b12063604ab403ab76d13ccee9d12c0ee2293dda6", "title": "Roles & Responsibility Mapping", "text": "the SPICE Admin Portal for SPICE mobile app users\nAssigning relevant Reporting and QuickSight access to users who will be using SPICE Insights; access should only be given to users who will be using it as there is a cost factor associated with it\nNeed to assign the quicksight role in the SPICE insights portal for all the government stakeholders at account level\nTroubleshooting and ticket creation\nAddressing any data variances between QuickSight and the reporting and understanding the logic of reports generated and QuickSight dashboard to address these issues.\nProvide all required details for issue when it’s escalating to L3 team\nMaintaining the SLA for ticket resolution.\nTraining Facility admin and Users:\nRegular training of the Facility admin on their roles and responsibilities\nEnsuring a", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 3, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "0c8b7ac21bc5836c0867786c6fb420100e691476d3748b7c0baefebd718a4c14", "title": "Roles & Responsibility Mapping", "text": "min on their roles and responsibilities\nEnsuring all devices are updated to the latest version app.\nEnsure all the devices are connected, performance optimized\nTraining the users on the new features that are launched in SPICE\nCommunicating all release updates to the facility admin and users.\nData Management\nAdvocating for better and more efficient usage based on the User audit report - users with a high number of duplicates and users with the most inaccurate data.\nPerform Data audit for the accounts that are being managed.\nDevice and QR Codes management\nUsing MDM dashboard, doing periodic usage audit of the devices.\nDevice maintenance audit.\nQR Code adoption and QR code supply management.\nLevel 3 - Tech support engineers\nThe L3 team, composed of skilled Technical Support Engineers, plays a", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 4, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "29b6132d9843e5e7b9127ee471076f7718224b0f77938bd9ca14ba2236e7f9f8", "title": "Roles & Responsibility Mapping", "text": "ed of skilled Technical Support Engineers, plays a pivotal role in the management and resolution of complex issues within the SPICE suite escalated by the L2 team, they ensure more intricate and challenging problems are resolved efficiently and effectively. Their expertise extends to a broad range of SPICE app suite and devices, where they provide comprehensive support covering app/device functionality issues, performance optimization, operating system troubleshooting, and Mobile Device Management (MDM) related complexities.\nAccount and User management:\nCreate operating units and accounts with a correct understanding of SPICE works. For example, a patient can do assessment in any facility within an operating unit then the OU should be created wrt to a geo area.\nSites in an account should b", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 5, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "0d3c68daa9dcc427ca6ce5c360afe5e257d2119c2945690342b10b18ae487471", "title": "Roles & Responsibility Mapping", "text": "ed wrt to a geo area.\nSites in an account should be created in clusters based on geographic proximity to each other, which is relevant to the patient.\nAccurate details are required when creating an OU and Account.\nThe QuickSight role must be assigned to all government stakeholders at the account level in the SPICE insights portal.\nFacility management:\nCreating facilities based on expansion requests.\nProviding correct information while creating a facility, such as accurate site levels (Level 1 - Level 6), state, city, latitude and longitude of the site, address and phone number of the state and site, and a valid user to be added.\nSPICE Device Management\nPerformance Optimization: L3 engineers focus on optimizing the performance of devices. Regularly monitoring device functionalities to ensur", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 6, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "fbe63c416e174268649d9e5377b8bf56f1f8c1ce3665df3d131da3daacff472d", "title": "Roles & Responsibility Mapping", "text": "gularly monitoring device functionalities to ensure optimal operation.\nApp Management: Managing restrictions and allowances for additional apps on MDM devices.\nUser Restrictions: Implementing user restrictions for MDM devices, blocking YouTube, social media sites, gaming apps, etc.\nDevice Enrolment: Handling the enrolment of devices into the MDM system for new sites/program/newly added devices.\nDevice Unenrolment: Managing the unenrolment process of devices from MDM.\nHealth Checks: Conducting regular health checks of devices to ensure proper functioning.\nSPICE Version Deployment: Overseeing the deployment of new SPICE version releases.\nInstallation Follow-Up: Monitoring the installation process of new SPICE versions.\nOS Troubleshooting: Addressing and resolving operating system issues on d", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 7, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "e2c5e71878aa9755893797ea964ec9cedd8ed77111e90d193b13f14325243a38", "title": "Roles & Responsibility Mapping", "text": "ressing and resolving operating system issues on devices.\nHardware Issues: Handling hardware-related problems in devices.\nApplication Performance: Tackling issues related to application performance.\nApplication Error Resolution: Resolving errors encountered in various applications.\nApplication Synchronization: Addressing issues related to application sync on devices.\nTroubleshooting and ticket resolution\nThey analyse issues raised by the Level 2 team and triage further.\nThey inquire with L2 to ensure all prerequisite checks for the issue are completed.\nThey are the point of contact for addressing data variances and explaining why there is a variance in the insights and reporting to Level 2 and Level 1.\nAnything they can’t resolve must be consulted with Product Specialist or escalate to the", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 8, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "6e929a145afa7d682193cce7a5a07779fc6372fe0019d4c1ba2760ec47593297", "title": "Roles & Responsibility Mapping", "text": "nsulted with Product Specialist or escalate to them.\nL3 must not link any tickets to JIRA to escalate to (JIRA/ideas2it), it must be escalated through L4- Product Specialist.\nTraining and Business Review\nSupport process Quality audits\nL3 is responsible for training the L1 and L2 on support process, ticket management, SLA management.\nPeriodic check-in with Level – 2\nPeriodic check-in with technical program manager for SPICE Suite enhancements and data variance.\nSLA Management for Enhancements and Issues\nSLA Management for response & resolution\nAddressing clarification with clear communications and evidence.\nMonthly support check-in with Head of Support\nLevel 4 - Product Specialist\nProduct Specialist are designated as L4 team in Medtronic LABS ticketing tool. They support any and every ticke", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 9, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "bc58fd87bd585772b0277a78b440c71faa5629f4f9971f3b6cc7b38058a7c309", "title": "Roles & Responsibility Mapping", "text": "S ticketing tool. They support any and every ticket that required coding/software development skillsets. This role requires advanced software engineering skills sufficient to progress development of the respective SPICE suite components.\nThey should address all bugs, data requests and enhancement requests escalated from lower levels (L3) and internally for perceived improvements on SPICE.\nThey should spear head all SPICE strategic development needs such as integration with other systems.\nAddress all data extraction requests.\nSLA Management for Enhancements and Issues\nSLA Management\nAddressing follow-ups with clear communications and evidence.\nMonthly support check-in with Head of Support\nMajor Code changes to be discussed with product and data team before implementing.\nCommunicating all fu", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 10, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2e20e61e530aa00784d2d9e41d420a872826e059e10a7a30a736ff30041f1b25", "title": "Roles & Responsibility Mapping", "text": "ata team before implementing.\nCommunicating all functionality/code changes that are fixed as part of a bug to Ops, product, and Data team.\nDevelopment of the release notes with tags to the issues addressed by each fix completed based on the JIRA board tickets.\nTest Management\nUnit tests for all developed features\nProvision of the test coverage on every release\nWork towards a 90% test coverage on SPICE Core\nL4 (JIRA) – Business Analyst, ADPO and Ideas2IT\nTicket Management\nOperate on JIRA on the issues/requests linked from freshservice (Medtronic LABS ticketing Tool) by L4- Product Specialists team\nProvision of updates on status of tickets included in the release through jira comments\nCommunicating all functionality/code changes that are fixed as part a bug to Ops, Product, Product Support a", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 11, "chunk_count": 13, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "ac3efef01877540e6401e0f9de6d98cd958c9fc165679db1838051b40c697adb", "title": "Roles & Responsibility Mapping", "text": "d as part a bug to Ops, Product, Product Support and Data team.\nDevelopment of the release notes with tags to the issues addressed by each fix completed based on the JIRA board tickets.\nTest Management\nUnit tests for all developed features\nProvision of the test coverage on every release\nWork towards a 90% test coverage on SPICE Core", "source": "kb\\SPICE Support Roles and Resposibilities V2.docx", "chunk_index": 12, "chunk_count": 13, "tokens_estimate": 334, "created_at": 1766077252}
{"ns": "default", "id": "afb2429eb77168ff8fb785c47c0c20d7706fd2fa4b71ed83dc574df7202bd2bf", "title": "Roles & Responsibility Mapping", "text": "Roles & Responsibility Mapping \n \n \n \nLevel 1 – SPICE Site Admins (SPICE CHAMPIONs) \n \nA SPICE Site Admin is a SPICE user from the facility who has a comprehensive \nknowledge of the SPICE application and can assist colleagues with questions \nrelated to usage. The SPICE Site Admin who is the Level 1 POC for that facility is \nalso the Site Admin of the facility and is given access to the Admin Portal. \nResponsibilities of the Facility Champion include: \n \nData management: \n• Ensuring all devices are connected to the internet and offline screening \nrecords are updated on a timely interval to avoid data loss \n• Conducting bi -weekly audits of the devices to validate if the offline \nscreening records are uploaded \n• Advocating to prevent duplicate enrolment \nDevice and QR Codes management \n• Ma", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 0, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d7f91444cf078bbc0936d946b7099590064d3258462fa94fd656c57ea34b54e4", "title": "Roles & Responsibility Mapping", "text": "te enrolment \nDevice and QR Codes management \n• Maintaining the stock of QR codes and informing the operation associate in \nadvance if they are going to be depleted \n• Ensure all the devices are up to date with latest spice release \n• Device maintenance and warranty management \nTraining new users – onboarding them to SPICE \n• Training and onboarding new users into SPICE \n \nTicket creation \n• Record a screenshot or a video in case of any issues and report it to \nFreshservice ticketing tool. \n• Add relevant information of the issue and share necessary evidence. \n• Report the quicksight data variance issue with the relevant evidence. Commented [SK1]: I propose we take a step back and \nexplore the most practical approach to reporting issues at L1 \nsince there are likely going to be challenges ", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 1, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "4ce3e22039dd4898ea25624aca9e1618ffd69a35a8528714a547562cb076a2b7", "title": "Roles & Responsibility Mapping", "text": "L1 \nsince there are likely going to be challenges with access to \ndevice , connection and the workload at the facility. \nCommented [SR2R1]: @given the recent observation, \nmost of the cases, they prefer calling our L2 folks and report \nissues.\n\n• Report the app feedback in the UV Desk tool \n \n \nLevel 2 - Operation Associate \nThe Operations Associate are the level 2 poc for the SPICE Support process. The \nLevel 2 Operation Associate is responsible for auditing the work done by the Site \nadmin to ensure that user information is accurate and appropriate roles are \nassigned to users. The main responsibilities of this role include: \n \nUser Management \n• Creating user roles for colleagues in the facility \n• Deleting users from the facility if a user has left permanently \n• Unlocking /resetting a", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 2, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "8d4a8090667bc898a258b9a132e9d80812a3ee6745f70e4de623601fe1fe95b9", "title": "Roles & Responsibility Mapping", "text": "ser has left permanently \n• Unlocking /resetting a user’s password if it is locked \n• Editing user information for the facility \n• Assigning appropriate user roles to users in the facility based on their job \nfunctions \n• Adding appropriate user information when creating a user account, such as \nuser email, phone number, user role, and time zone \n• Assigning users to the SPICE Insights Portal for QuickSight and reporting \n• Creating user accounts in the SPICE Admin Portal for SPICE mobile app \nusers \n• Assigning relevant Reporting and QuickSight access to users who will be \nusing SPICE Insights; access should only be given to users who will be using \nit as there is a cost factor associated with it \n• Need to assign the quicksight role in the SPICE insights portal for all the \ngovernment st", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 3, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2415d8f0e5eea94066bb4480be08b9522739c1c5502fcafb42f8a3cc7e8ea227", "title": "Roles & Responsibility Mapping", "text": "e SPICE insights portal for all the \ngovernment stakeholders at account level \n• \nTroubleshooting and ticket creation \n• Addressing any data variances between QuickSight and the reporting and \nunderstanding the logic of reports generated and QuickSight dashboard to \naddress these issues. \n• Provide all required details for issue when it’s escalating to L3 team \n• Maintaining the SLA for ticket resolution. \nTraining Facility admin and Users: \n• Regular training of the Facility admin on their roles and responsibilities \n• Ensuring all devices are updated to the latest versio n app. \n• Ensure all the devices are connected, performance optimized Commented [SK3]: Could we target the county ToTs to be \npart of this group? \nCommented [SK4]: The SPICE Champion at the facility \nmay face challenges ", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 4, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d05a8358c409af5a666b2cd2386dd1d8e892ef0a58b74cfe0ee90a1dab08ae7b", "title": "Roles & Responsibility Mapping", "text": "ICE Champion at the facility \nmay face challenges in accessing the admin portal due to \naccess to device, and connectivity. Could we consider moving \nthe user management roles to L2? \nCommented [SR5R4]: Yes, I feel the same. Thanks. Sam \nCommented [SR6R4]: Given the current situation, It does \nnot seem to be good idea to depend on them and expect \nthem to do these tasks. \nCommented [SR7]: Should we move this to L3 \nresponsibilities?\n\n• Training the users on the new features that are launched in SPICE \n• Communicating all release updates to the facility admin and users. \nData Management \n• Advocating for better and more efficient usage based on the User audit \nreport - users with a high number of duplicates and users with the most \ninaccurate data. \n• Perform Data audit for the accounts tha", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 5, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "2005901c0770dea39ba9fdaa883b5ea7a166a35fbb79fe4cb75c7ea485fcc89c", "title": "Roles & Responsibility Mapping", "text": "e data. \n• Perform Data audit for the accounts that are being managed . \nDevice and QR Codes management \n• Using MDM dashboard, doing periodic usage audit of the devices. \n• Device maintenance audit. \n• QR Code adoption and QR code supply management. \n \n \n \nLevel 3 - Tech support engineer s \nThe L3 team, composed of skilled Technical Support Engineers, plays a pivotal role \nin the management and resolution of complex issues within the SPICE suite \nescalated by the L2 team, they ensu re more intricate and challenging problems \nare resolved efficiently and effectively. Their expertise extends to a broad range of \nSPICE app suite and devices, where they provide comprehensive support covering \napp/device functionality issues, performance optimization, operating system \ntroubleshooting, and Mob", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 6, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "0dbaf5fdb16392fcea291b8704b345224323bc4b9345190a9eb2a0c32ff70eea", "title": "Roles & Responsibility Mapping", "text": "zation, operating system \ntroubleshooting, and Mobile Device M anagement (MDM) related complexities. \n \nAccount and User management: \n• Create operating units and accounts with a correct understanding of SPICE \nworks. For example, a patient can do assessment in any facility within an \noperating unit then the OU should be created wrt to a geo area. \n• Sites in an account should be created in clusters based on geographic \nproximity to each other, which is relevant to the patient. \n• Accurate details are required when creating an OU and Account. \n• The QuickSight role must be assigned to all government stakeholders at the \naccount level in the SPICE insights portal. \nFacility management: \n• Creating facilities based on expansion requests. Commented [SR8]: L2 don't have access to MDM portal \ny", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 7, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "8db191c61ecabfae7762baddae9d9f2b535d30f1b99c6bc2e62fe3b133542b5e", "title": "Roles & Responsibility Mapping", "text": "ented [SR8]: L2 don't have access to MDM portal \nyet\n\n• Providing correct information while creating a facility, such as accurate site \nlevels (Level 1 - Level 6), state, city, latitude and longitude of the site, \naddress and phone number of the state and site, and a valid user to be \nadded. \nSPICE Device Management \n• Performance Optimization: L3 engineers focus on optimizing the \nperformance of devices. Regularly monitoring device functionalities to \nensure optimal operation. \n• App Management: Managing restrictions and allowances for additional \napps on MDM devices. \n• User Restrictions: Implementing user restrictions for MDM devices , blocking \nYouTube , social media sites, gaming apps, etc . \n• Device Enrolment : Handling the enrolment of devices into the MDM system \nfor new sites/pro", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 8, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "94379d0beb6f82336e22875f4e21135c04673d4098bb52828c1456a5a2c7c693", "title": "Roles & Responsibility Mapping", "text": " of devices into the MDM system \nfor new sites/program/newly added devices . \n• Device Unenrolment: Managing the unenrolment process of devices from \nMDM. \n• Health Checks: Conducting regular health checks of devices to ensure \nproper functioning. \n• SPICE Version Deployment: Overseeing the deployment of new SPICE \nversion releases. \n• Installation Follow -Up: Monitoring the installation process of new SPICE \nversions. \n• OS Troubleshooting: Addressing and resolving operating system issues on \ndevices. \n• Hardware Issues: Handling hardware -related problems in devices. \n• Application Performance: Tackling issues related to application \nperformance. \n• Application Error Resolution: Resolving errors encountered in various \napplications. \n• Application Synchronization: Addressing issues relat", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 9, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "d0f6bba5453903201438548c9672344b4a876d2e25b0c61e13d947dd30af2ff2", "title": "Roles & Responsibility Mapping", "text": "plication Synchronization: Addressing issues related to application sync \non devices. \nTroubleshooting and ticket resolution \n• They analyse issues raised by the Level 2 team and triage further. \n• They inquire with L2 to ensure all prerequisite checks for the issue are \ncompleted. \n• They are the point of contact for addressing data variances and explaining \nwhy there is a variance in the insights and reporting to Level 2 and Level 1. \n• Anything they can’t resolve must be consulted with Product Specialist or \nescalate to them . \n• L3 must not link any tickets to JIRA to escalate to (JIRA/ideas2it), it must be \nescalated through L4 - Product Specialist.\n\nTraining and Business Review \n• Support process Quality audits \n• L3 is responsible for training the L 1 and L 2 on support process, tic", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 10, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "8f18258e9bfa49a6ca74b4bcac615394b6ed3972a0e0118636c0f95a75c9ae6e", "title": "Roles & Responsibility Mapping", "text": "r training the L 1 and L 2 on support process, ticket \nmanagement, SLA management . \n• Periodic check -in with Level – 2 \n• Periodic check -in with technical program manager for SPICE Suite \nenhancements and data variance. \n \nSLA Management for Enhancements and Issues \n• SLA Management for response & resolution \n• Addressing clarification with clear communications and evidence. \n• Monthly support check -in with Head of Support \n \nLevel 4 - Product Specialist \nProduct Specialist are designated as L4 team in Medtronic LABS ticketing tool. \nThey support any and every ticket that required coding/software development \nskillsets. This role requires advanced software engineering skills sufficient to \nprogress development of the respective SPICE suite components. \n• They should address all bugs , ", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 11, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "41377e92ecdbc9127061e43b358591217b42f5cf9352331dc5319153e1660fa5", "title": "Roles & Responsibility Mapping", "text": "ite components. \n• They should address all bugs , data requests and enhancement requests \nescalated from lower levels (L3) and internally f or perceived improvements \non SPICE. \n• They should spear head all SPICE strategic development needs such as \nintegration with other systems. \n• Address all data extraction requests. \nSLA Management for Enhancements and Issues \n• SLA Management \n• Addressing follow -ups with clear communications and evidence. \n• Monthly support check -in with Head of Support \n• Major Code changes to be discussed with product and data team before \nimplementing. \n• Communicating all functionality/code changes that are fixed as part of a \nbug to Ops, product, and Data team . \n• Development of the release notes with tags to the issues addressed by each \nfix completed based", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 12, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "7a590b0e03e0068f547983be93a3ec49b66d00952a2dd685563913f921945b98", "title": "Roles & Responsibility Mapping", "text": " the issues addressed by each \nfix completed based on the JIRA board tickets. \nTest Management \n• Unit tests for all developed features Commented [SR9]: @Samuel Kang'a As discussed in \ntoday's call, Please update the roles and responsibilities for \nL4\n\n• Provision of the test coverage on every release \n• Work towards a 90% test coverage on SPICE Core \n \nL4 (JIRA) – Business Analyst, ADPO and Ideas2IT \nTicket Management \n• Operate on JIRA on the issues/requests linked from freshservice (Medtronic \nLABS ticketing Tool) by L4 - Product Speci alists tea m \n• Provision of updates on status of tickets included in the release through jira \ncomments \n• Communicating all functionality/code changes that are fixed as part a bug \nto Ops, Product , Product Support and Data team. \n• Development of the r", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 13, "chunk_count": 15, "tokens_estimate": 800, "created_at": 1766077252}
{"ns": "default", "id": "68bf774d609e5043796eb3a98f847cf666a2b0d9b9e581af1787eae300ca1fc5", "title": "Roles & Responsibility Mapping", "text": "uct Support and Data team. \n• Development of the release notes with tags to the issues addressed by each \nfix completed based on the JIRA board tickets. \n \nTest Management \n• Unit tests for all developed features \n• Provision of the test coverage on every release \n• Work towards a 90% test coverage on SPICE Core", "source": "kb\\SPICE Support Roles and Resposibilities V2.pdf", "chunk_index": 14, "chunk_count": 15, "tokens_estimate": 313, "created_at": 1766077252}
{"ns": "default", "id": "e1b5c9abf7c34d4d3f149faee8607c73d27d9366c2f622f0c1265fd1742746e2", "title": "Technology Stack", "text": "Technology Stack\nThe Technology Infrastructure of SPICE forms the backbone of its functionality, performance, and scalability.\nSPICE Layer Architecture. The SPICE platform utilizes a layered architecture approach with three tiers: 1. Presentation Layer 2. Computer Layers and 3. Database Layers.\nPresentation Layer\nReact\nSCSS\nTypescript\nSPICE's presentation layer relies on a combination of technologies, including React, HTML5, SCSS, TypeScript, and npm. Together, these technologies form a robust and efficient foundation for the application's presentation layer.\nReact is a JavaScript library that enables interactive user interfaces\nHTML5 serves as the markup language for structuring the application's content\nSCSS supports writing more maintainable and modular CSS styles.\nTypeScript adds stati", "source": "kb\\Technology Stack.docx", "chunk_index": 0, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "0919f028b7dc5822c6c49512c83d286c6681ee1122fd7246c098f244dc3245f8", "title": "Technology Stack", "text": "able and modular CSS styles.\nTypeScript adds static typing to JavaScript, enhancing code reliability and scalability.\nNpm is a package manager that helps manage and install the necessary dependencies for the project.\nService Layer\nSpring Boot\nThe service layer of the SPICE application leverages the Spring Boot framework to develop REST APIs. Spring Boot simplifies the process of creating and managing these APIs, allowing for seamless communication with other systems or clients. By utilizing features such as dependency injection, security, and database integration, we ensure efficient and scalable services. REST APIs enable SPICE to follow the principles of stateless, client-server communication, facilitating interoperability and flexibility in the SPICE application's architecture. With Spr", "source": "kb\\Technology Stack.docx", "chunk_index": 1, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "3bd45d5c15154a72daf3f55c30d2215aa228464a119dc9c4706ed631747b99a2", "title": "Technology Stack", "text": " in the SPICE application's architecture. With Spring Boot, we can build reliable and high-performing components for our service layer, providing a solid foundation for SPICE application functionality.\nBusiness Layer\nJava\nThe business layer of the SPICE application is implemented using Java to create business workflows. Java provides a robust platform for developing intricate and efficient business logic, given the fact that it is a versatile and widely-used programming language. Leveraging Java's object-oriented features, we can model complex business processes and incorporate encapsulation, inheritance, and polymorphism to achieve modular and maintainable workflows. Java's extensive libraries and frameworks enhance the capabilities of our business layer, enabling us to handle data transf", "source": "kb\\Technology Stack.docx", "chunk_index": 2, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "5b224be450ba97eb9c86c8f765a21e9d506b455d966e6009d8338d528660f836", "title": "Technology Stack", "text": " business layer, enabling us to handle data transformations, business rules, and workflow orchestration effectively. By coding the business workflows in Java, we ensure a reliable and scalable foundation for the application's core functionality.\nPersistence Layer\nJPA - Hibernate\nThe SPICE persistence layer utilizes Object Modeling based on JPA using Hibernate. JPA (Java Persistence API) is a Java specification that provides a standard way to map Java objects to relational databases. Hibernate, an implementation of JPA, simplifies the interaction between the application and the database by handling object-relational mapping. With JPA Hibernate, we can define and manage the persistence of our application's domain objects, enabling seamless storage and retrieval of data. This approach enhance", "source": "kb\\Technology Stack.docx", "chunk_index": 3, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "78315f33d2385e710df1c775248c1b6357979f85928716163e2e995a9728a26d", "title": "Technology Stack", "text": "orage and retrieval of data. This approach enhances code maintainability, as it abstracts away the underlying database details. Leveraging JPA Hibernate in our business layer ensures efficient and reliable data persistence in our application.\nDatabase Layer\nPostgreSQL\nThe database layer of SPICE is built on PostgreSQL, an open-source, relational database management system (RDBMS). PostgreSQL is known for its stability, scalability, and extensive feature set. It provides robust data storage and retrieval capabilities, ensuring the efficient handling of our application's data. With PostgreSQL, we can create and manage complex database structures, define relationships between entities, and perform efficient queries. It offers advanced features such as transactions, concurrency control, and da", "source": "kb\\Technology Stack.docx", "chunk_index": 4, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "7c1fbb5304c01eea353f9b1894e0e201a2880d28221fa51323262468fbea4295", "title": "Technology Stack", "text": " such as transactions, concurrency control, and data integrity mechanisms. Leveraging PostgreSQL in our database layer guarantees reliable and secure storage of our application's data, supporting the overall performance and functionality of our system.\nFHIR Service Layer\nFHIR Standards\nFast Healthcare Interoperability Resources (FHIR) is a standard developed by HL7 (Health Level Seven) for exchanging healthcare information electronically. It is designed to facilitate interoperability between different healthcare systems by using modern web technologies such as RESTful APIs, JSON, and XML. FHIR provides standardized data models and resources (e.g., Patient, Observation, Medication) that simplify data sharing across healthcare applications.\nKey benefits of FHIR include:\nInteroperability: Ena", "source": "kb\\Technology Stack.docx", "chunk_index": 5, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "cd74629bba07f57d6ad8504328cbbd48672a207f16f162d18e7a1366410c9bd8", "title": "Technology Stack", "text": "ey benefits of FHIR include:\nInteroperability: Enables seamless exchange of health data between systems.\nScalability: Supports various use cases, from small applications to large healthcare enterprises.\nEase of Implementation: Uses familiar web-based technologies.\nModular Design: Allows developers to use only the necessary resources for their application.\nHAPI FHIR JPA Server\nHAPI FHIR JPA Server is an open-source implementation of the FHIR standard, built using the HAPI-FHIR library. It provides a ready-to-use, RESTful FHIR server that uses a JPA (Java Persistence API) database backend for data storage.\nKey features of HAPI FHIR JPA Server:\nFull FHIR Support: Implements FHIR RESTful APIs for CRUD operations.\nDatabase-backed Storage: Uses JPA/Hibernate to store FHIR resources in relational", "source": "kb\\Technology Stack.docx", "chunk_index": 6, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "b7020d584a46fc4d97b45185f011a9628a33c79b56539510f9605d2c8a059ce4", "title": "Technology Stack", "text": "PA/Hibernate to store FHIR resources in relational databases.\nSecurity & Authentication: Supports OAuth2, SMART on FHIR, and custom authentication mechanisms.\nExtensibility: Allows customization to fit specific healthcare application needs.\nTerminology Services: Supports validation and terminology operations.\nHAPI FHIR JPA Server is widely used for building healthcare applications that require standardized FHIR data storage and retrieval while ensuring compliance with HL7 FHIR specifications.", "source": "kb\\Technology Stack.docx", "chunk_index": 7, "chunk_count": 8, "tokens_estimate": 497, "created_at": 1766077253}
{"ns": "default", "id": "d34bacbb8581e89e5e782e34f2479e43db360aec99992ab46db103d522cccc28", "title": "Technology Stack", "text": "Technology Stack \nThe Technology Infrastructure of SPICE forms the backbone of its functionality, \nperformance, and scalability. \n \nSPICE Layer Architecture. The SPICE platform utilizes a layered architecture approach \nwith three tiers: 1. Presentation Layer 2. Computer Layers and 3. Database Layers. \nPresentation Layer \n \nReact\n\nSCSS \n \nTypescript \nSPICE's presentation layer relies on a combination of technologies, including React, \nHTML5, SCSS, TypeScript, and npm. Together, these technologies form a robust and \nefficient foundation for the application's presentation layer. \n• React is a JavaScript library that enables interactive user interfaces \n• HTML5 serves as the markup language for structuring the application's content \n• SCSS supports writing more maintainable and modular CSS sty", "source": "kb\\Technology Stack.pdf", "chunk_index": 0, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "35e2e1ee46aa614dfbdadec93079194aae8d8eab1171b9a4b3f3d7b99468982d", "title": "Technology Stack", "text": "orts writing more maintainable and modular CSS styles. \n• TypeScript adds static typing to JavaScript, enhancing code reliability and \nscalability. \n• Npm is a package manager that helps manage and install the necessary \ndependencies for the project.\n\nService Layer \n \nSpring Boot \nThe service layer of the SPICE application leverages the Spring Boot framework to \ndevelop REST APIs. Spring Boot simplifies the process of creating and managing these \nAPIs, allowing for seamless communication with other systems or clients. By utilizing \nfeatures such as dependency injection, security, and database integration, we ensure \nefficient and scalable services. REST APIs enable SPICE to follow the principles of \nstateless, client -server communication, facilitating interoperability and flexibility in t", "source": "kb\\Technology Stack.pdf", "chunk_index": 1, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "be7a19124ace3fec4924597ef4333a2fc5fd8021c74e4dcdb6fa04fcb59f8df6", "title": "Technology Stack", "text": "facilitating interoperability and flexibility in t he \nSPICE application's architecture. With Spring Boot, we can build reliable and high -\nperforming components for our service layer, providing a solid foundation for SPICE \napplication functionality. \nBusiness Layer\n\nJava \nThe business layer of the SPICE application is implemented using Java to create \nbusiness workflows. Java provides a robust platform for developing intricate and \nefficient business logic, given the fact that it is a versatile and widely -used programming \nlanguage. Leveraging Java's object -oriented features, we can model complex business \nprocesses and incorporate encapsulation, inheritance, and polymorphism to achieve \nmodular and maintainable workflows. Java's extensive libraries and frameworks \nenhance the cap abil", "source": "kb\\Technology Stack.pdf", "chunk_index": 2, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "912f49ef0a841d2b2a5daaa698ea9158520a39cc71905a0a1bed33afd5994f77", "title": "Technology Stack", "text": "ive libraries and frameworks \nenhance the cap abilities of our business layer, enabling us to handle data \ntransformations, business rules, and workflow orchestration effectively. By coding the \nbusiness workflows in Java, we ensure a reliable and scalable foundation for the \napplication's core functiona lity. \nPersistence Layer\n\nJPA - Hibernate \nThe SPICE persistence layer utilizes Object Modeling based on JPA using Hibernate. JPA \n(Java Persistence API) is a Java specification that provides a standard way to map Java \nobjects to relational databases. Hibernate, an implementation of JPA, simplifies the \ninteraction between the application and the data base by handling object -relational \nmapping. With JPA Hibernate, we can define and manage the persistence of our \napplication's domain obj", "source": "kb\\Technology Stack.pdf", "chunk_index": 3, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "59d598bb204f367f505479fe1a58432f640f5804bb5367e0093af6b2afae5116", "title": "Technology Stack", "text": "e the persistence of our \napplication's domain objects, enabling seamless storage and retrieval of data. This \napproach enhances code maintainability, as it abstracts away the underlying database \ndetails. Leveraging JPA Hibernate in our business layer ensures efficient and reliable \ndata persistence in our application. \nDatabase Layer\n\nPostgreSQL \nThe database layer of SPICE is built on PostgreSQL, an open -source, relational \ndatabase management system (RDBMS). PostgreSQL is known for its stability, \nscalability, and extensive feature set. It provides robust data storage and retrieval \ncapabilities, en suring the efficient handling of our application's data. With PostgreSQL, \nwe can create and manage complex database structures, define relationships between \nentities, and perform efficie", "source": "kb\\Technology Stack.pdf", "chunk_index": 4, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "a08b7f27e61d8ed97b363bf11b3c6a99a8a6d58663930bc911cce1e1c6de3127", "title": "Technology Stack", "text": "lationships between \nentities, and perform efficient queries. It offers advanced features such as transactions, \nconcurre ncy control, and data integrity mechanisms. Leveraging PostgreSQL in our \ndatabase layer guarantees reliable and secure storage of our application's data, \nsupporting the overall performance and functionality of our system. \nFHIR Service Layer \n \nFHIR Standards\n\nFast Healthcare Interoperability Resources (FHIR) is a standard developed by HL7 \n(Health Level Seven) for exchanging healthcare information electronically. It is designed \nto facilitate interoperability between different healthcare systems by using modern w eb \ntechnologies such as RESTful APIs, JSON, and XML. FHIR provides standardized data \nmodels and resources (e.g., Patient, Observation, Medication) that si", "source": "kb\\Technology Stack.pdf", "chunk_index": 5, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "b732ca386a23efed4286f8dd88763eb4a28ddae9b8371d2deec8df4ce38a3e48", "title": "Technology Stack", "text": "s (e.g., Patient, Observation, Medication) that simplify data sharing \nacross healthcare applications. \nKey benefits of FHIR include: \n• Interoperability: Enables seamless exchange of health data between systems. \n• Scalability: Supports various use cases, from small applications to large \nhealthcare enterprises. \n• Ease of Implementation: Uses familiar web -based technologies. \n• Modular Design: Allows developers to use only the necessary resources for their \napplication. \nHAPI FHIR JPA Server \n \nHAPI FHIR JPA Server is an open -source implementation of the FHIR standard, built \nusing the HAPI-FHIR library. It provides a ready -to-use, RESTful FHIR server that uses a \nJPA (Java Persistence API) database backend for data storage. \nKey features of HAPI FHIR JPA Server: \n• Full FHIR Support:", "source": "kb\\Technology Stack.pdf", "chunk_index": 6, "chunk_count": 8, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "bf6914d3b167f2127f63f5bb6bbbd64e62a37d7882d79303c72ae622bdd3fcd7", "title": "Technology Stack", "text": "res of HAPI FHIR JPA Server: \n• Full FHIR Support: Implements FHIR RESTful APIs for CRUD operations. \n• Database -backed Storage: Uses JPA/Hibernate to store FHIR resources in \nrelational databases.\n\n• Security & Authentication: Supports OAuth2, SMART on FHIR, and custom \nauthentication mechanisms. \n• Extensibility: Allows customization to fit specific healthcare application needs. \n• Terminology Services: Supports validation and terminology operations. \nHAPI FHIR JPA Server is widely used for building healthcare applications that require \nstandardized FHIR data storage and retrieval while ensuring compliance with HL7 FHIR \nspecifications.", "source": "kb\\Technology Stack.pdf", "chunk_index": 7, "chunk_count": 8, "tokens_estimate": 647, "created_at": 1766077253}
{"ns": "default", "id": "ed0c1e484806321a7430d0dc5debbe389fa09edf5715da8be25d127c99f5b442", "title": "Terms & Conditions of Use", "text": "Terms & Conditions of Use\nSPICE provides the ability to modify the Terms and Conditions to the Country in which the application is used. The below is the template provided which can be customized for the specific country.\nTerms and Conditions\nTerms of Service\nThese Terms of Service (“TOS”) apply to the access and use of our mobile based applications (which is referred to as “Platform”) and use of our products and services provided through the Platform (“Services”). The Platform is owned, managed, and operated by MEDTRONIC LABS having its registered office at Nairobi Garage, Delta Corner Annex, 4th Floor-Unit 5, Ring Road, Westlands (hereinafter referred as “us”/ “we”/ “SPICE”/ “Company”).\nThese TOS govern the use of the Platform and Services by you, your staff (“Staff”), and the patients a", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 0, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "4053c3cb17e91ffaa6b65b95168a24e9669fb6681ebc788f6f6fb68fef7588fc", "title": "Terms & Conditions of Use", "text": "s by you, your staff (“Staff”), and the patients and end users who are using the Platform (“Patients”). Health workers, Staff and Doctors are jointly referred to as “Users” or “you”. By accessing or using the Platform, registering for Services offered on the Platform, or by accepting, uploading, submitting or downloading any information or content from or to the Platform, you shall have agreed to these TOS.\nIF YOU DO NOT AGREE TO BE BOUND BY ALL OF THESE TOS, we request you DO NOT USE THE PLATFORM.\nAcceptance of Terms\nYour use of the Platform is subject to these TOS, which may be updated, amended, modified or revised by Medtronic Labs from time to time without any notice to you. It is important for you to refer to these TOS from time to time to make sure that you are aware of any additions", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 1, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "7980b402f5c4272e4467756aafbc5863068aa59d7a2d7a4d68666de19cbe40b1", "title": "Terms & Conditions of Use", "text": "e to make sure that you are aware of any additions, revisions, amendments or modifications that we may have made to these TOS. Your use of the Platform and engagement with SPICE constitutes your acceptance of these TOS. Your use of the Services herein is under a limited, non-transferable, non-licensable, non-assignable licence to use the Services granted by SPICE only for the purposes mentioned herein.\nUse of Services\nThe Platform and Services are designed to assist the health care providers to store, obtain and review health information of the Patients who visit their clinics or hospitals. The health care providers can review the health information such as the Patient’s vitals, medical reports, medical records, etc. (“Data”) and provide feedback, advice and suggestion or any other informa", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 2, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "c1d5fe0d0eeb66041f329327a5c83d902787a95d1c5a2c53adbd01dac5e3fbfe", "title": "Terms & Conditions of Use", "text": "edback, advice and suggestion or any other information that may be relevant to the Patient. The Platform and Services are designed to allow the health care providers to seamlessly access their Patient Data via the Platform and use the Data to provide healthcare services to the Patients. We endeavour to provide a functional and convenient Service through our Platform, but we do not guarantee that your web browser, or mobile device will be compatible with the Platform or the Services or that the Platform and Services will be available uninterrupted or that any content will be error free. Medtronic Labs is not responsible for any interruption in Services or availability of Platform due to, but not limited to, changes or updates in individual clinic’s practice, network failure, or any other te", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 3, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "293a5b1838e5765c23e691efed88508b04b859b3018c5b5af6f0d75f94eb2b3b", "title": "Terms & Conditions of Use", "text": "linic’s practice, network failure, or any other technical incident. SPICE reserves the right, at its sole discretion, to modify or replace all or any part of the TOS, or change, suspend, or discontinue all or any part of the Services or Platform at any time by posting a notice on the Platform or by informing you through any other modes of communication. It is your responsibility to check the TOS periodically for changes. Your continued use of the Platform or the Services following the posting of any changes to the TOS constitutes acceptance of those changes.\nThe Platform may collect and store demographic, health records and any other type of information that you may provide. This information is collected, stored and processed as per our privacy policy published on the Platform.\nThe Users r", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 4, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "fe1dfd63be0723230bd47a69ca8b83623c2820d27606103d3b8d94ff0a15c0e7", "title": "Terms & Conditions of Use", "text": "vacy policy published on the Platform.\nThe Users represent and warrant that they have taken the appropriate consent from Patients before storing, or sharing with any third parties, any of the Patients’ information including but not limited to personally identifiable information, health records, demographic information etc.\nThe Patients, by accessing the Platform, consent and agree that the Platform may store their personal information including but not limited to contact information, demographic data, health records and medical history etc. The Platform may use this information for purposes as per our privacy policy published on the Platform.\nRegistration\nAs part of the registration process you will need to create an account, including your email, username and password. It is your responsi", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 5, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "cc064144490bc1b3d5299710d500c40d2754842cd9bb237368cdc5f74a4edf68", "title": "Terms & Conditions of Use", "text": " email, username and password. It is your responsibility to ensure that the information you provide is accurate, not misleading, and secure. You shall be responsible for keeping your credentials in safe custody. Medtronic Labs will not be liable for any losses or claims arising out of misuse of Platform or Services accessed with your credentials. You cannot create an account or username and password using the names and information of another person or using words that are the trademarks or the property of another party (including ours), or vulgar, obscene or in any other way inappropriate. We reserve the right with or without notice to suspend or terminate any account in breach. Doctors represent and warrant that they are licensed medical practitioners registered with [Enter Country Regula", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 6, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "195db9be3ffa22f515a196f599037724eed568d7caa1ca6bffd7856f178dfb96", "title": "Terms & Conditions of Use", "text": "ractitioners registered with [Enter Country Regulatory Body] and there are no legal or regulatory impediments which prevent you from practising medicine in [Country].\nData Confidentiality\na) Responsibility of Doctors and Staff\nThrough your use of the Platform, you shall have access to sensitive and valuable Data of the Patients which may include medical records, medical information, personal information or any other information as may be required. Additionally, Users agree to treat as confidential all Data that they have been provided access to, and that they shall make their best efforts to maintain the confidentiality of such Data. Users should be aware of the Patient confidentiality requirements and observe all caution and the applicable duty of care in provision of services under these", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 7, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "6613f552a5f19707b9c4a02026766b1ccec375d5938aaa5b93716fb0764d75a6", "title": "Terms & Conditions of Use", "text": " duty of care in provision of services under these TOS. The Data, provided by the Patient or entered by the Doctor or the Staff. The Platform present the Patient Data to the Doctors in an As-Is manner and the Platform do not make any warranties, representations, etc. on the accuracy and correctness of the Data.\nb) Restrictions on Use of Platform. Users agrees that they shall not:\ni. and shall not permit anyone to: (i) copy or republish the Platform, except as may be provided herein; (ii) make the Platform available to any person other than its authorized personnel, (iii) remove, modify or obscure any copyright, trademark or other proprietary notices contained in the Platform, (iv) reverse engineer, decompile, disassemble, or otherwise attempt to derive the source code of Platform or (vii) ", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 8, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "39954ba077d41beb90d945c962d201f64fc7cbbef3aa82585c01828222b23f1b", "title": "Terms & Conditions of Use", "text": "pt to derive the source code of Platform or (vii) Users shall not access (or attempt to access) the Platform and the materials or services by any means other than through the interface that is provided by Company.\nii. use any deep-link, robot, spider or other automatic device, program, algorithm or methodology, or any similar or equivalent manual process, to access, acquire, copy or monitor any portion of the Platform or content, or in any way reproduce or circumvent the navigational structure or presentation of the Platform, materials or any content, to obtain or attempt to obtain any materials, documents or information through any means not specifically made available through the Platform.\niii. attempt to gain unauthorized access to any portion or feature of the Platform, any other syste", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 9, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "659d3172ddc56e214efb443b1c425c96c5da0a4529ba1d5b022a3fb23d882a40", "title": "Terms & Conditions of Use", "text": "ortion or feature of the Platform, any other systems or networks connected to the Platform, to any Company server, or to any of the services offered on or through the Platform, by hacking, password mining or any other illegitimate means.\niv. probe, scan or test the vulnerability of the Platform or any network connected to the Platform, nor breach the security or authentication measures on the Platform or any network connected to the Platform. Users may not reverse look-up, trace or seek to trace any information on any other user, of or visitor to, the Platform, including any Company account not owned by Doctors, to its source, or exploit the Platform or Services or information made available or offered by or through the Platform, in any way whether or not the purpose is to reveal any infor", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 10, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "a678bed977a3d1a36a88f3f9d1b06024322fdb95606ee54e715ab62d40fafd1d", "title": "Terms & Conditions of Use", "text": " whether or not the purpose is to reveal any information, including but not limited to personal identification information, other than Doctors’ own information, as provided for by the Platform;\nv. disrupt or interfere with the security of, or otherwise cause harm to, the Platform, systems resources, accounts, passwords, servers or networks connected to or accessible through the Platform or any affiliated or linked sites.\nc) Non-Disclosure by SPICE\nSPICE will store the Data on a secure infrastructure and/or third-party servers chosen by data controller (Owner). SPICE is committed to protecting the identity of the Users. The following security procedures have been put in place by us to protect Data:\na) Access to the Services is only after the user keys in his username and password. The usern", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 11, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "ddbeb490a7211517675331aa46c869e8282b070a3bf7961a3a628a4d44c8ecda", "title": "Terms & Conditions of Use", "text": " user keys in his username and password. The username and password have to be successfully authenticated post which the access to the Platform and Services is granted. Users are fully and solely responsible for any or all use of the Platform or the Services while accessing these using the username and password (upon successful authentication).\nb) To prevent impersonation, your password is never stored in plain text format on any of our servers.\nc) The communication between your device and our servers will be through a secure HTTPS connection.\nd) A secure session is established with the help of a session token for providing access to the Patient Data after the Doctors or the Staff have successfully authenticated their username and password\ne) Role based access to database depending on the r", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 12, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "3b0907a1447e07c4f1df0e88174fe12b35e71028648d498d3127282913787fb7", "title": "Terms & Conditions of Use", "text": ") Role based access to database depending on the roles assigned by the Doctor to his/her Staff\nf) Within our server we use an Advanced Encryption Standard (AES) and multi-level security and authentication checks to protect the confidential Data. Personally identifiable patient information is always kept strictly confidential and is never disclosed with any third party except as provided under our privacy policy. We reserve the right to access, read, preserve, and disclose any information that we reasonably believe is necessary to comply with law or court order; enforce or apply our conditions of use and other agreements; or protect the rights, property, or safety of Company, our employees, our Users, or others. The Company may also use the data in de-identified and aggregated form for the ", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 13, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "691dcf973864fa0282e912ecf45d6c937bce21a3cb0fba854eddfb2d8e32c9a1", "title": "Terms & Conditions of Use", "text": "data in de-identified and aggregated form for the following purposes without violating the relevant data privacy and data security laws of [Country].\ni. for the purpose of research and publications, statistical analysis, generating Real World Evidence (RWE) algorithmically,\nii. for communication purpose so as to provide the Doctor a better way of communicating with his/her patients by means of SMS/Emails,\niii. for debugging customer support related issues,\niv. for improving the algorithms of Company’s EMR to make it faster, efficient and reliable\nv. for communicating about new Services and offerings by the Company or its partners with the Users\nCommunications\nYou agree to receive communications through emails, telephone, mobile phone and/or SMS, from SPICE or its third-party vendors or bus", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 14, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "37846beca285cd9043a8ac6306a109d380b559f5f70cd63a835f911eb33bd2a9", "title": "Terms & Conditions of Use", "text": " SMS, from SPICE or its third-party vendors or business partners or third-party service providers regarding the services or services updates, and/or any announcements. In this context and regard, you agree and provide your consent to receive all communications at the mobile number provided to SPICE. You also agree that in accordance with the applicable laws, rules and regulations tied to Telecom Communications:\ni. Each time you do visit/transact or login in your account on the Platform, it shall be regarded as a verifiable request from you pertaining to receipt of our Services and activities;\nii. Each time you visit/login/transact on the Platform, it will be deemed to be as a fresh request from you for continuing to receive communication from SPICE\niii. In case you do not wish to receive a", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 15, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "193114b96e852292f246cad4066726524f6d97c8b8dd81f6c21cea52f417681d", "title": "Terms & Conditions of Use", "text": "om SPICE\niii. In case you do not wish to receive any communication from us or to provide your feedback about the services, you can mail us at support@medtroniclabs.org\nSPICE will retain and use your information as necessary to comply with our legal obligations, resolve disputes and enforce our agreements entered into for providing Services and ancillary services.\nTermination\nSPICE may terminate your access to all or any part of the Platform or Services at any time if you fail to comply with these TOS. This may result in the forfeiture and destruction of all information associated with your membership and will immediately terminate your ability to provide services through the Platform. All provisions of the TOS, which by their nature should survive termination, shall survive termination, in", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 16, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "f4eed748ad26bdd0f2dd8bcdfb09af1ff68fd8551b6b77e3a91c83c6a2f8e2d6", "title": "Terms & Conditions of Use", "text": "survive termination, shall survive termination, including, without limitation, warranty disclaimers, indemnity and limitations of liability. In the event of discontinuation of services, SPICE, at its discretion, will make reasonable efforts to help you take a backup of your Data in a suitable electronic format.\nDISCLAIMER\nTHE PLATFORM (INCLUDING, WITHOUT LIMITATION, ANY CONTENT) ARE PROVIDED “AS IS” AND “AS AVAILABLE” AND IS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, AND ANY WARRANTIES IMPLIED BY ANY COURSE OF PERFORMANCE OR USAGE OF TRADE, ALL OF WHICH ARE EXPRESSLY DISCLAIMED. MEDTRONIC LABS AND ITS DIRECTORS, EMPLOYEES, SUPPLIERS, AND PARTNERS DO", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 17, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "dcd62430efb641c9aca05c7d3622c3174a908a13039db617e4a775962689c761", "title": "Terms & Conditions of Use", "text": "S DIRECTORS, EMPLOYEES, SUPPLIERS, AND PARTNERS DO NOT WARRANT THAT: (A) THE SERVICE WILL BE SECURE OR AVAILABLE AT ANY PARTICULAR TIME OR LOCATION; (B) ANY DEFECTS OR ERRORS WILL BE CORRECTED; (C) ANY CONTENT OR SOFTWARE AVAILABLE AT OR THROUGH THE SERVICE IS FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS; OR (D) THE RESULTS OF USING THE SERVICE WILL MEET YOUR REQUIREMENTS.\nIndemnification\nYou shall defend, indemnify, and hold harmless Medtronic Labs, its affiliates/subsidiaries/partners and each of its affiliates/subsidiaries employees, contractors, directors, suppliers and representatives from all liabilities, losses, claims, and expenses, including reasonable attorneys’ fees, that arise from or relate to (i) your use or misuse of, or access to, the Platform or Services, or (ii) your viola", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 18, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "59f812165f1569153bc27cea064c7b635980bec26224a6d567ff649ed569f828", "title": "Terms & Conditions of Use", "text": "s to, the Platform or Services, or (ii) your violation of the TOS or any applicable law, contract, policy, regulation or other obligation. MEDTRONIC LABS reserves the right to assume the exclusive defence and control of any matter otherwise subject to indemnification by you, in which event you will assist and cooperate with MEDTRONIC LABS in connection therewith.\nLimitation of Liability\nTO THE FULLEST EXTENT PERMITTED BY LAW, IN NO EVENT SHALL MEDTRONIC LABS (NOR ITS DIRECTORS, EMPLOYEES, PARTNERS, SUPPLIERS, CONTENT PROVIDERS, LICENSORS OR RESELLERS, BE LIABLE UNDER CONTRACT, TORT, STRICT LIABILITY, NEGLIGENCE OR ANY OTHER LEGAL OR EQUITABLE THEORY WITH RESPECT TO THE SERVICE (I) FOR ANY LOST PROFITS, DATA LOSS, LOSS OF GOODWILL OR OPPORTUNITY, OR SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, ", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 19, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "3a150e2d3690329f806665202b77a26a85ef7c82cb96125a80d79d46aca727f9", "title": "Terms & Conditions of Use", "text": "NITY, OR SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, OR CONSEQUENTIAL DAMAGES OF ANY KIND WHATSOEVER, OR SUBSTITUTE GOODS OR SERVICES, (II) FOR ANY MATTER BEYOND ITS OR THEIR REASONABLE CONTROL, EVEN IF MEDTRONIC LABS HAS BEEN ADVISED OF THE POSSIBILITY OF ANY OF THE AFOREMENTIONED DAMAGES.\nGoverning Law\nThis Agreement shall be governed by and construed in accordance with the laws of [Country] without regard to the conflict of laws provisions thereof. All claims, differences and disputes arising under or in connection with or in relation hereto the App, the Terms or any transactions entered into on or through the App shall be subject to the exclusive jurisdiction of the courts at [Country] and you hereby accede to and accept the jurisdiction of such courts.\nMiscellaneous\nThe TOS are the entir", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 20, "chunk_count": 22, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "1fe08c712324b0b3f5a4882ac9230dc97da25c1a3a94678e0323bca054733fd8", "title": "Terms & Conditions of Use", "text": "f such courts.\nMiscellaneous\nThe TOS are the entire agreement between you and MEDTRONIC LABS with respect to the use of Platform or the Services. If any provision of the TOS is found to be unenforceable or invalid, that provision will be limited or eliminated to the minimum extent necessary so that the TOS will otherwise remain in full force and effect and enforceable. The failure of either party to exercise in any respect any right provided for herein shall not be deemed a waiver of any further rights hereunder. The TOS are personal to you, and are not assignable or transferable by you except with Company’s prior written consent. MEDTRONIC LABS may assign, transfer or delegate any of its rights and obligations hereunder without consent.", "source": "kb\\Terms and Conditions of Use.docx", "chunk_index": 21, "chunk_count": 22, "tokens_estimate": 747, "created_at": 1766077253}
{"ns": "default", "id": "2936a2d794ccab52e97c2b969fad5030e5822f2d4bc581148b882968e4484a6e", "title": "Terms & Conditions of Use", "text": "Terms & Conditions of Use \nSPICE provides the ability to modify the Terms and Conditions to the Country in which \nthe application is used. The below is the template provided which can be customized \nfor the specific country. \n \nTerms and Conditions \nTerms of Service \nThese Terms of Service (“TOS”) apply to the access and use of our mobile based \napplications (which is referred to as “ Platform ”) and use of our products and services \nprovided through the Platform (“ Services ”). The Platform is owned, managed, and \noperated by MEDTRONIC LABS having its registered office at Nairobi Garage, Delta \nCorner Annex, 4th Floor -Unit 5, Ring Road, Westlands (hereinafter referred as “ us”/ \n“we”/ “SPICE”/ “Company ”). \nThese TOS govern the use of the Platform and Services by you, your staff (“ Staff", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 0, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "cb3dd7629aba5450aa97c71bdf0edf632b0e40b10fde245b83e62a13c66c0245", "title": "Terms & Conditions of Use", "text": " Platform and Services by you, your staff (“ Staff”), and \nthe patients and end users who are using the Platform (“ Patients ”). Health workers, \nStaff and Doctors are jointly referred to as “ Users” or “you”. By accessing or using the \nPlatform, registering for Services offered on the Platform, or by accepting, uploading, \nsubmitting or downloading any information or content from or to the Platform, you shall \nhave agreed to these TOS. \nIF YOU DO NOT AGREE TO BE BOUND BY ALL OF THESE TOS, we request you DO NOT \nUSE THE PLATFORM. \n1. Acceptance of Terms \nYour use of the Platform is subject to these TOS, which may be updated, amended, \nmodified or revised by Medtronic Labs from time to time without any notice to you. It is \nimportant for you to refer to these TOS from time to time to make s", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 1, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "1163a761f909a5d2af53e5bd6492b14a6b5e33485bf03f213ac536f36b1fe500", "title": "Terms & Conditions of Use", "text": " to refer to these TOS from time to time to make sure that you are \naware of any additions, revisions, amendments or modifications that we may have \nmade to these TOS. Your use of the Platform and engagement with SPICE constitutes \nyour acceptance of these TOS. Your use of the Services herein is under a limited, non -\ntransferab le, non-licensable, non -assignable licence to use the Services granted by \nSPICE only for the purposes mentioned herein. \n1. Use of Services \nThe Platform and Services are designed to assist the health care providers to store, \nobtain and review health information of the Patients who visit their clinics or hospitals. \nThe health care providers can review the health information such as the Patient’ s vitals, \nmedical reports, medical records, etc. ( “Data”) and pro", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 2, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "0b03caaee5487e8b71ed32514b282a657a5f62675b1370ba349e47476e01a056", "title": "Terms & Conditions of Use", "text": "l reports, medical records, etc. ( “Data”) and provide feedback, advice and \nsuggestion or any other information that may be relevant to the Patient. The Platform\n\nand Services are designed to allow the health care providers to seamlessly access their \nPatient Data via the Platform and use the Data to provide healthcare services to the \nPatients. We endeavour to provide a functional and convenient Service through our \nPlatform, but we do not guarantee that your web browser, or mobile device will be \ncompatible with the Platform or the Services or that the Platform and Services will be \navailable uninterrupted or that any content will be error free. Medtronic Labs is not \nresponsible for any interruption in Services or availability of Platform due to, but not \nlimited to, changes or updates", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 3, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "b61a1df767cc3f58bca1cc54d91ba29764a70bade4e584d4b517b21ca5c0cb41", "title": "Terms & Conditions of Use", "text": "rm due to, but not \nlimited to, changes or updates in individual clinic’s practice, network failure, or any \nother technical incident. SPICE reserves the right, at its sole discretion, to mo dify or \nreplace all or any part of the TOS, or change, suspend, or discontinue all or any part of \nthe Services or Platform at any time by posting a notice on the Platform or by informing \nyou through any other modes of communication. It is your responsibili ty to check the \nTOS periodically for changes. Your continued use of the Platform or the Services \nfollowing the posting of any changes to the TOS constitutes acceptance of those \nchanges. \nThe Platform may collect and store demographic, health records and any other type of \ninformation that you may provide. This information is collected, stored a", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 4, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "b76df0599cf042a3e06f918894a47197abb23c7ffdcc6851a5518a0f029dd0ba", "title": "Terms & Conditions of Use", "text": "y provide. This information is collected, stored and processed \nas per our privacy policy published on the Platform. \nThe Users represent and warrant that they have taken the appropriate consent from \nPatients before storing, or sharing with any third parties, any of the Patients’ information \nincluding but not limited to personally identifiable information, health records, \ndemographic information etc. \nThe Patients, by accessing the Platform, consent and agree that the Platform may store \ntheir personal information including but not limited to contact information, \ndemographic data, health records and medical history etc. The Platform may use this \ninformation for purposes as per our privacy policy published on the Platform. \n1. Registration \nAs part of the registration process you will ", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 5, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "51afdb5dea0c1598967b34467a052027ad04c841a0c7671ff1bcfd2e684d475e", "title": "Terms & Conditions of Use", "text": "ion \nAs part of the registration process you will need to create an account, including your \nemail, username and password. It is your responsibility to ensure that the information \nyou provide is accurate, not misleading, and secure. You shall be responsible for \nkeeping your credentials in safe custody. Medtronic Labs will not be liable for any losses \nor claims arising out of misuse of Platform or Services accessed with your credentials. \nYou cannot create an account or username and password using the names and \ninformation of another person or using words that are the trademarks or the property of \nanother party (including ours), or vulgar, obscene or in any other way inappropriate. We \nreserve the right with or without notice to suspend or terminate any account in br each. \nDoctors rep", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 6, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "17b2a6617851f9da51ac74fc8767983815ae0bb5740946b1a7dc6fbf67234145", "title": "Terms & Conditions of Use", "text": " or terminate any account in br each. \nDoctors represent and warrant that they are licensed medical practitioners registered\n\nwith [Enter Country Regulatory Body ] and there are no legal or regulatory impediments \nwhich prevent you from practising medicine in [ Country]. \n1. Data Confidentiality \na) Responsibility of Doctors and Staff \nThrough your use of the Platform, you shall have access to sensitive and valuable Data \nof the Patients which may include medical records, medical information, personal \ninformation or any other information as may be required. Additionally, Users agree to \ntreat as confidential all Data that they have been provided access to, and that they shall \nmake their best efforts to maintain the confidentiality of such Data. Users should be \naware of the Patient confi", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 7, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "03430a20e0a002ef1206880ca07064d431faccfa5b59414f0717041dd319df00", "title": "Terms & Conditions of Use", "text": " Data. Users should be \naware of the Patient confidentiality requirements and observe all caution and the \napplicable duty of care in provision of services under these TOS. The Data, provided by \nthe Patient or entered by the Doctor or the Staff. The Platform present the Patient Data \nto the Doctors in an As -Is manner and the Platform do not make any warranties, \nrepresentations, etc. on the accuracy and correctness of the Data. \nb) Restrictions on Use of Platform. Users agrees that they shall not: \ni. and shall not permit anyone to: (i) copy or republish the Platform, except as may be \nprovided herein; (ii) make the Platform available to any person other than its authorized \npersonnel, (iii) remove, modify or obscure any copyright, trademark or other p roprietary \nnotices contained in th", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 8, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "280ddf254b3c56a2440bca8796541f65d5176813dc3d5a693332ac8ddc591192", "title": "Terms & Conditions of Use", "text": "ark or other p roprietary \nnotices contained in the Platform, (iv) reverse engineer, decompile, disassemble, or \notherwise attempt to derive the source code of Platform or (vii) Users shall not access \n(or attempt to access) the Platform and the materials or services by any means other \nthan through the interface that is provided by Company. \nii. use any deep -link, robot, spider or other automatic device, program, algorithm or \nmethodology, or any similar or equivalent manual process, to access, acquire, copy or \nmonitor any portion of the Platform or content, or in any way reproduce or circumven t \nthe navigational structure or presentation of the Platform, materials or any content, to \nobtain or attempt to obtain any materials, documents or information through any \nmeans not specificall", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 9, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "300b9f36683a5834225bbe8461197f9bef4289fad2fa782566aa1f13b9a43aca", "title": "Terms & Conditions of Use", "text": " or information through any \nmeans not specifically made available through the Platform. \niii. attempt to gain unauthorized access to any portion or feature of the Platform, any \nother systems or networks connected to the Platform, to any Company server, or to any \nof the services offered on or through the Platform, by hacking, password mining or any \nother illegitimate means. \niv. probe, scan or test the vulnerability of the Platform or any network connected to the \nPlatform, nor breach the security or authentication measures on the Platform or any \nnetwork connected to the Platform. Users may not reverse look -up, trace or seek to \ntrace any information on any other user, of or visitor to, the Platform, including any \nCompany account not owned by Doctors, to its source, or exploit the Pl", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 10, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "f4f8149470696cd5eb041d96e59db5deea306aa624d1d351d290bca29fb69efd", "title": "Terms & Conditions of Use", "text": "owned by Doctors, to its source, or exploit the Platform or\n\nServices or information made available or offered by or through the Platform, in any way \nwhether or not the purpose is to reveal any information, including but not limited to \npersonal identification information, other than Doctors’ own information, as prov ided \nfor by the Platform; \nv. disrupt or interfere with the security of, or otherwise cause harm to, the Platform, \nsystems resources, accounts, passwords, servers or networks connected to or \naccessible through the Platform or any affiliated or linked sites. \nc) Non-Disclosure by SPICE \nSPICE will store the Data on a secure infrastructure and/or third -party servers chosen by \ndata controller (Owner). SPICE is committed to protecting the identity of the Users. The \nfollowin", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 11, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "32b2d7b7c285008187baa368373d5835cf737a14e9944e0421117d6ff6a7ccd9", "title": "Terms & Conditions of Use", "text": "rotecting the identity of the Users. The \nfollowing security procedures have been put in place by us to protect Data: \na) Access to the Services is only after the user keys in his username and password. The \nusername and password have to be successfully authenticated post which the access \nto the Platform and Services is granted. Users are fully and solely responsible for an y or \nall use of the Platform or the Services while accessing these using the username and \npassword (upon successful authentication). \nb) To prevent impersonation, your password is never stored in plain text format on any of \nour servers. \nc) The communication between your device and our servers will be through a secure \nHTTPS connection. \nd) A secure session is established with the help of a session token for providi", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 12, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "a455a86e9815b7d27146cb48106f0975796e033d073c1a277a5ea83948d55a4d", "title": "Terms & Conditions of Use", "text": "ished with the help of a session token for providing access \nto the Patient Data after the Doctors or the Staff have successfully authenticated their \nusername and password \ne) Role based access to database depending on the roles assigned by the Doctor to \nhis/her Staff \nf) Within our server we use an Advanced Encryption Standard (AES) and multi -level \nsecurity and authentication checks to protect the confidential Data. Personally \nidentifiable patient information is always kept strictly confidential and is never \ndisclosed w ith any third party except as provided under our privacy policy. We reserve \nthe right to access, read, preserve, and disclose any information that we reasonably \nbelieve is necessary to comply with law or court order; enforce or apply our conditions \nof use and othe", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 13, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "a7bb0eac90e78de5e7bd74363cb7ab659238383340cbd9b4c30a2bf631821cf7", "title": "Terms & Conditions of Use", "text": "; enforce or apply our conditions \nof use and other agreements; or protect the rights, property, or safety of Company, our \nemployees, our Users, or others. The Company may also use the data in de -identified \nand aggregated form for the following purposes without violating the relevant data \nprivacy and data security laws of [ Country].\n\ni. for the purpose of research and publications, statistical analysis, generating Real \nWorld Evidence (RWE) algorithmically, \nii. for communication purpose so as to provide the Doctor a better way of \ncommunicating with his/her patients by means of SMS/Emails, \niii. for debugging customer support related issues, \niv. for improving the algorithms of Company’s EMR to make it faster, efficient and \nreliable \nv. for communicating about new Services and offer", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 14, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "a6458cef072f3c60d463553326c1bd403774677f65c5836306c65d4d9cf71a24", "title": "Terms & Conditions of Use", "text": "\nv. for communicating about new Services and offerings by the Company or its partners \nwith the Users \n1. Communications \nYou agree to receive communications through emails, telephone, mobile phone and/or \nSMS, from SPICE or its third -party vendors or business partners or third -party service \nproviders regarding the services or services updates, and/or any announcements. In thi s \ncontext and regard, you agree and provide your consent to receive all communications \nat the mobile number provided to SPICE. You also agree that in accordance with the \napplicable laws, rules and regulations tied to Telecom Communications: \ni. Each time you do visit/transact or login in your account on the Platform, it shall be \nregarded as a verifiable request from you pertaining to receipt of our Services an", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 15, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "da206ae8b27db5b2046f254b682d776cd44e03c2c63cd6973a3b66ca4e11d079", "title": "Terms & Conditions of Use", "text": " from you pertaining to receipt of our Services and \nactivities; \nii. Each time you visit/login/transact on the Platform, it will be deemed to be as a fresh \nrequest from you for continuing to receive communication from SPICE \niii. In case you do not wish to receive any communication from us or to provide your \nfeedback about the services, you can mail us at support@medtroniclabs.org \nSPICE will retain and use your information as necessary to comply with our legal \nobligations, resolve disputes and enforce our agreements entered into for providing \nServices and ancillary services. \n1. Termination \nSPICE may terminate your access to all or any part of the Platform or Services at any \ntime if you fail to comply with these TOS. This may result in the forfeiture and \ndestruction of all informa", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 16, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "39edc53f0a1a174ff43162c4a78d1c10698aa9037ff6d44499a28bb94d34d6a3", "title": "Terms & Conditions of Use", "text": " in the forfeiture and \ndestruction of all information associated with your membership and will immediately \nterminate your ability to provide services through the Platform. All provisions of the TOS, \nwhich by their nature should survive termination, shall survive termination, including, \nwithout limitation, warranty disclaimers, indemnity and limitations of liability. In the \nevent of discontinuation of services, SPICE, at its discretion, will make reasonable \nefforts to help you take a backup of your Data in a suitable electronic format.\n\n1. DISCLAIMER \nTHE PLATFORM (INCLUDING, WITHOUT LIMITATION, ANY CONTENT) ARE PROVIDED \n“AS IS” AND “AS AVAILABLE” AND IS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR \nIMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF TITLE, \nNON-INFRINGEMEN", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 17, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "7648856b39dc8e5aa5ce68d198fa86ec581b64abe54d19307f3d18fcaa9be07f", "title": "Terms & Conditions of Use", "text": " THE IMPLIED WARRANTIES OF TITLE, \nNON-INFRINGEMENT, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, \nAND ANY WARRANTIES IMPLIED BY ANY COURSE OF PERFORMANCE OR USAGE OF \nTRADE, ALL OF WHICH ARE EXPRESSLY DISCLAIMED. MEDTRONIC LABS AND ITS \nDIRECTORS, EMPLOYEES, SUPPLIERS, AND PARTNERS DO NOT WARRANT THAT: (A) \nTHE SERVICE W ILL BE SECURE OR AVAILABLE AT ANY PARTICULAR TIME OR \nLOCATION; (B) ANY DEFECTS OR ERRORS WILL BE CORRECTED; (C) ANY CONTENT OR \nSOFTWARE AVAILABLE AT OR THROUGH THE SERVICE IS FREE OF VIRUSES OR OTHER \nHARMFUL COMPONENTS; OR (D) THE RESULTS OF USING THE SERV ICE WILL MEET \nYOUR REQUIREMENTS. \n1. Indemnification \nYou shall defend, indemnify, and hold harmless Medtronic Labs, its \naffiliates/subsidiaries/partners and each of its affiliates/subsidiaries employees, ", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 18, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "7574bd945a15c4a202cebcc3a6ba0f98466f5136093a826cb3b3b63b2b1bc853", "title": "Terms & Conditions of Use", "text": "nd each of its affiliates/subsidiaries employees, \ncontractors, directors, suppliers and representatives from all liabilities, losses, claims, \nand expenses, including reasonable attorneys’ fees, that arise from or relate to (i) your \nuse or misuse of, or access to, the Platform or Services, or (ii) your violation of the TOS \nor any applicable law, contract, policy, regulation or other obligation. MEDTRONIC LABS \nreserves the right to assume the exclusive defence and control of any matter otherwise \nsubject to indemnification by you, in which event you will assist and cooperate with \nMEDTRONIC LABS in connection therewith. \n1. Limitation of Liability \nTO THE FULLEST EXTENT PERMITTED BY LAW, IN NO EVENT SHALL MEDTRONIC LABS \n(NOR ITS DIRECTORS, EMPLOYEES, PARTNERS, SUPPLIERS, CONTENT PROVID", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 19, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "860023e5384f20ed6d902c2a5f05d5a1ae9b22253ef5778139e65ad3c6b2de78", "title": "Terms & Conditions of Use", "text": "RS, EMPLOYEES, PARTNERS, SUPPLIERS, CONTENT PROVIDERS, \nLICENSORS OR RESELLERS, BE LIABLE UNDER CONTRACT, TORT, STRICT LIABILITY, \nNEGLIGENCE OR ANY OTHER LEGAL OR EQUIT ABLE THEORY WITH RESPECT TO THE \nSERVICE (I) FOR ANY LOST PROFITS, DATA LOSS, LOSS OF GOODWILL OR \nOPPORTUNITY, OR SPECIAL, INDIRECT, INCIDENTAL, PUNITIVE, OR CONSEQUENTIAL \nDAMAGES OF ANY KIND WHATSOEVER, OR SUBSTITUTE GOODS OR SERVICES, (II) FOR \nANY MATTER BEYOND ITS OR THEIR REASONABLE CONTROL, EVEN IF MEDTRONIC \nLABS HAS BEEN ADVISED OF THE POSSIBILITY OF ANY OF THE AFOREMENTIONED \nDAMAGES. \n1. Governing Law \nThis Agreement shall be governed by and construed in accordance with the laws of \n[Country] without regard to the conflict of laws provisions thereof. All claims,\n\ndifferences and disputes arising under or in con", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 20, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "b5266b3c294b4b7bed5574548f1a84af36a68e9a3abc7acabce2cc7322f13b98", "title": "Terms & Conditions of Use", "text": "\n\ndifferences and disputes arising under or in connection with or in relation hereto the \nApp, the Terms or any transactions entered into on or through the App shall be subject \nto the exclusive jurisdiction of the courts at [ Country] and you hereby accede to and \naccept the jurisdiction of such courts. \n1. Miscellaneous \nThe TOS are the entire agreement between you and MEDTRONIC LABS with respect to \nthe use of Platform or the Services. If any provision of the TOS is found to be \nunenforceable or invalid, that provision will be limited or eliminated to the minimum \nextent nec essary so that the TOS will otherwise remain in full force and effect and \nenforceable. The failure of either party to exercise in any respect any right provided for \nherein shall not be deemed a waiver of any furth", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 21, "chunk_count": 23, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "85fa4d22b153e06ff5512130b974c6d4fe59e13565e52f359e7cc3811e34d7f2", "title": "Terms & Conditions of Use", "text": " \nherein shall not be deemed a waiver of any further rights hereunder. The TOS are \npersonal t o you, and are not assignable or transferable by you except with Company’s \nprior written consent. MEDTRONIC LABS may assign, transfer or delegate any of its \nrights and obligations hereunder without consent.", "source": "kb\\Terms and Conditions of Use.pdf", "chunk_index": 22, "chunk_count": 23, "tokens_estimate": 303, "created_at": 1766077253}
{"ns": "default", "id": "3b4e01a9f7372b9e6eeb30bc382626200cddff4d5bae463d5d7e0e07005b6937", "title": "What is COMEMR?", "text": "What is COMEMR?\nOverview\nCOMEMR is a comprehensive open-source digital healthcare platform offering advanced solutions for managing clinical and administrative workflows in resource-constrained settings. The platform is certified as a digital public good and Global Good for Health and we work with Ministries of Health to plan for long-term country-ownership.\nDigitization is not enough. Data collection alone does not drive outcomes. At Medtronic LABS, we enable health systems to collect high-quality data and use data insights to make decisions that drive outcomes.\nRather than community health and facility level care operating in silos, COMEMR bi-directionally links community health work with facility services with closed-loop referrals and counter-referrals. Community Health Workers receive", "source": "kb\\What is ComEMR.docx", "chunk_index": 0, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "b80669a8fca26f77e3592657c104b23c1e26b25ca8cf8b8393c3432edef6821a", "title": "What is COMEMR?", "text": "ounter-referrals. Community Health Workers receive targeted community-based follow-up for longitudinal patient management based on clinical algorithms. At the facility level doctor visits, pharmacy and lab workflows are augmented clinical decision support. Ultimately, the community and primary care model enabled by COMEMR drives improved health outcomes for patients.\nHealthcare delivered at the community level delivered via community health workers has been disconnected from care delivered within formal health system. With COMEMR-enabled care models, the patient's journey is seamless regardless of whether they visit a facility, receive an SMS, talk on the phone with a provider, or welcome a visit from a community health worker. Closing the loop between facilities and communities is one key", "source": "kb\\What is ComEMR.docx", "chunk_index": 1, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "cd59c61ec73e23132915be719ee42c9fb45ee82744ccd62a424d8715727301d5", "title": "What is COMEMR?", "text": "loop between facilities and communities is one key to driving treatment plan adherence and health outcomes.\nCOMEMR Features\nCOMEMR focuses on data-driven, outcomes-focused care at both the community and primary care levels. The platform enables health systems to collect high quality data coordinated across levels of care and includes algorithm-driven disease pathways for various conditions, such as maternal health, child health, malaria, and non-communicable diseases such as hypertension and diabetes, ensuring compliance with WHO and country-specific protocols.\nThe platform enhances operational efficiency through administrative management tools (Admin portal) and dashboards to enable data-driven decision making. COMEMR is HL7 FHIR compliant and is architected to support the WHO SMART guide", "source": "kb\\What is ComEMR.docx", "chunk_index": 2, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "e58988d1445024f77ab675de4c4bd00aea60d9b594debdd3909d9d8dd84b0107", "title": "What is COMEMR?", "text": " and is architected to support the WHO SMART guidelines and seamless system interoperability with other health management information systems (HMIS) and health information exchanges (HIE).\nDesigned for diverse users, including Community Health Workers (CHWs), the system facilitates offline-first community workflows, longitudinal patient records, and clinical decision support to enhance diagnostic accuracy and treatment efficiency. COMEMR provides tailored treatment plans based on a patient’s risk-level, and these can be monitored remotely Community Health Workers (CHWs) and clinical staff, who both play a crucial role in our care delivery model.\nWhat's New in COMEMR 2.0?\nCOMEMR 2.0 expands the clinical disease areas to include malaria, antenatal care (ANC), postnatal care (PNC), child heal", "source": "kb\\What is ComEMR.docx", "chunk_index": 3, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "643303901cf331db7a4d50bfb7a892b088e799468129223a652dfd1c002726a3", "title": "What is COMEMR?", "text": "natal care (ANC), postnatal care (PNC), child health, and integrated community case management. In an upcoming release in March the platform will be enhanced to include tuberculosis (TB), HIV, and immunization workflows, fully supporting the entire spectrum of primary care conditions out of the box. The workflows have been built to ensure adherence to both WHO and national guidelines.\nCOMEMR 2.0 has offline workflows designed for community health workers (CHWs) to ensure seamless household registration and bi-directional linkages between communities and healthcare facilities. The platform's offline-first functionality ensures it operates efficiently in areas with limited or no internet connectivity, syncing data once the user regains connectivity.\nAt the facility level, COMEMR provides the", "source": "kb\\What is ComEMR.docx", "chunk_index": 4, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "b9dc278c73f621297562b13bd95025e9f176ecb54fc34b77f4b383d8b1fc6bcb", "title": "What is COMEMR?", "text": "tivity.\nAt the facility level, COMEMR provides the ability for a clinician to perform a medical review, confirm diagnoses, prescribe medications, and order medications to comprehensively care for patients. COMEMR generates a customized treatment plan for the patient which includes a combination of community-based assessments (tagged as follow-up activities for the CHWs) and facility medical reviews (depending on the clinical workflow). Throughout the entire care pathway COMEMR generates a longitudinal patient record for the clinician to track progress over time and meaningfully measure clinical outcomes.\nCOMEMR also features administrative support features that include advanced dashboards, automated performance metrics, and autogenerated monthly reports to enhance operational efficiency by", "source": "kb\\What is ComEMR.docx", "chunk_index": 5, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "6bde20ae172fa635cb17cfb9cadc9b90f30002e0144704df75a42ee34899ed42", "title": "What is COMEMR?", "text": "nthly reports to enhance operational efficiency by recording patient visits, diagnoses, treatments, and outcomes. COMEMR’s data analytics capabilities offer real-time tracking, population health insights, and visualizations of key performance indicators (KPIs), generating actionable reports for patient care, program evaluation, and health surveillance.\nBuilt with interoperability in mind, the platform adheres to FHIR standards, allowing for seamless integration with DHIS2 and other national health systems. COMEMR 2.0 is built on a modular architecture, allowing for flexibility and customization. COMEMR leverages open-source technologies and standards, ensuring interoperability and sustainability.\nImpact\nMedtronic LABS is expanding its focus beyond non-communicable diseases to strengthen pr", "source": "kb\\What is ComEMR.docx", "chunk_index": 6, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "3dfb7bb25f94093ccaedffa9a14a61eb29ed1a2999004d6b74ba7fe304f78253", "title": "What is COMEMR?", "text": " beyond non-communicable diseases to strengthen primary healthcare systems with the introduction of COMEMR 2.0, built to address the full spectrum of primary care diseases. By continuing to integrate technology-driven solutions with community-based care models, LABS is building sustainable, patient-centered healthcare ecosystems that extend beyond mere disease management to improve health access and outcomes.\nThis transition places a strong emphasis on preventive care, early diagnosis, and continuous treatment through local partnerships, empowering primary care providers to offer comprehensive, long-term solutions. The focus on continuous care reassures our stakeholders about the quality of service we deliver.\nBy empowering COMEMR users across all levels of the health system and fostering ", "source": "kb\\What is ComEMR.docx", "chunk_index": 7, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "71f372c1e5e70fd6f8e2fed06c69ff5f659ebe86ac7313d39527cc46d1a429c8", "title": "What is COMEMR?", "text": "oss all levels of the health system and fostering bi-directional linkages between providers, LABS is building cohesive primary care networks that strengthen healthcare delivery and drive sustainable improvements in community health. The goal is to transform primary healthcare into a first-line defense against chronic diseases, thereby contributing to greater global health equity and enhancing community resilience.\nTo date, COMEMR-enabled programs have screened over one million patients with non-communicable diseases (NCDs), enrolled more than 270,000 individuals, and trained approximately 7,000 healthcare workers. These programs have had a measurable impact on the health of patients, improving the lives of hypertensive patients by 60% compared to the control group, and diabetic patients by", "source": "kb\\What is ComEMR.docx", "chunk_index": 8, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "ef5a182363c85438d43b7394a95ec29439fa85744148cdf86b10d719777f3367", "title": "What is COMEMR?", "text": "red to the control group, and diabetic patients by 54% compared to the control group, on a global scale. Medtronic LABS has played a significant role in this success, demonstrating substantial reductions in clinical indicators such as blood pressure and blood glucose through multiple peer-reviewed studies conducted across Bangladesh and various sub-Saharan African countries.\nOur outcomes data indicates the following:\nOur Journal of Hypertension publication reports a-15.2 mmHg reduction in systolic blood pressure in the uncontrolled subgroup.\nOur Journal of Clinical Hypertension reports-17.6 mmHg reduction in systolic blood pressure in the uncontrolled subgroup\nReal-world evidence studies involving 84,700 hypertension patients over six months across six countries (Bangladesh, Ghana, Kenya, ", "source": "kb\\What is ComEMR.docx", "chunk_index": 9, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "135b5edb016084d5afa65efa916866c687a4e1c5de49199da391a7043080212d", "title": "What is COMEMR?", "text": "s across six countries (Bangladesh, Ghana, Kenya, Rwanda, Sierra Leone, Tanzania) show a reduction of 8.6 mmHg in systolic blood pressure, with control rates improving by 19 %. This also reflects a shift in the severity of hypertension toward less severe classifications, suggesting a potential reduction in the risk of complications. That is, Base Line Grade 3 shows a 6% reduction, while Base Line Grade 2 shows a 9% reduction.\nReal-world evidence studies of over 32,000 diabetic patients over six months, (which is 46% of patients with Diabetes who have completed at least 6 months in the program) also across six countries (Bangladesh, Ghana, Kenya, Rwanda, Sierra Leone, Tanzania), demonstrate improvements in both fasting and random blood glucose control. This positive change could lead to a r", "source": "kb\\What is ComEMR.docx", "chunk_index": 10, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "88f939081e4335cb576a986f5b1d09316f50e748ba30bb12038102870578a159", "title": "What is COMEMR?", "text": "se control. This positive change could lead to a reduced risk of diabetic complications.", "source": "kb\\What is ComEMR.docx", "chunk_index": 11, "chunk_count": 12, "tokens_estimate": 88, "created_at": 1766077253}
{"ns": "default", "id": "d5c743db642b241617fc4674bb37222eb80fce9b5b9f4f0653e6c2025f7b7405", "title": "What is COMEMR ?", "text": "What is COMEMR ? \nOverview \nCOMEMR is a comprehensive open -source digital healthcare platform offering \nadvanced solutions for managing clinical and administrative workflows in resource -\nconstrained settings. The platform is certified as a digital public good and Global Good \nfor Health and we work with Ministries of Health to plan for long -term country -\nownership. \nDigitization is not enough. Data collection alone does not drive outcomes. At Medtronic \nLABS, we enable health systems to collect high -quality data and use data insights to \nmake decisions that drive outcomes. \nRather than community health and facility level care operating in silos, COMEMR bi-\ndirectionally links community health work with facility services with closed -loop \nreferrals and counter -referrals. Community He", "source": "kb\\What is ComEMR.pdf", "chunk_index": 0, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "4d71167a753ab4eb5bd0cc52b5e86e9a1e1c33a40c87ff4f52e4ec5a2f0b7d58", "title": "What is COMEMR ?", "text": "op \nreferrals and counter -referrals. Community Health Workers receive targeted \ncommunity -based follow -up for longitudinal patient management based on clinical \nalgorithms. At the facility level doctor visits, pharmacy and lab workflows are \naugmented clinical decision support. Ultimately, the community and primary care \nmodel enabled by COMEMR drives improved health outcomes for patients. \nHealthcare delivered at the community level delivered via community health workers \nhas been disconnected from care delivered within formal health system. With \nCOMEMR -enabled care models, the patient's journey is seamless regardless of whether \nthey visit a facility, receive an SMS, talk on the phone with a provider, or welcome a visit \nfrom a community health worker. Closing the loop between facil", "source": "kb\\What is ComEMR.pdf", "chunk_index": 1, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "a4b57baeaa044876d148513599dbdd20cf6f9e10b0d0911a535c338b96ce5ad7", "title": "What is COMEMR ?", "text": "nity health worker. Closing the loop between facilities and communities \nis one key to driving treatment plan adherence and health outcomes. \nCOMEMR Features \nCOMEMR focuses on data -driven, outcomes -focused care at both the community and \nprimary care levels. The platform enables health systems to collect high quality data \ncoordinated across levels of care and includes algorithm -driven disease pathways for \nvarious cond itions, such as maternal health, child health, malaria, and non -\ncommunicable diseases such as hypertension and diabetes, ensuring compliance with \nWHO and country -specific protocols. \nThe platform enhances operational efficiency through administrative management tools \n(Admin portal) and dashboards to enable data -driven decision making. COMEMR is HL7 \nFHIR compliant", "source": "kb\\What is ComEMR.pdf", "chunk_index": 2, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "3ab49eef9a243a6ec96c7363f0a342d2ccadf47538724884d2489b09ffa99f04", "title": "What is COMEMR ?", "text": "ven decision making. COMEMR is HL7 \nFHIR compliant and is architected to support the WHO SMART guidelines and seamless \nsystem interoperability with other health management information systems (HMIS) and \nhealth information exchanges (HIE). \nDesigned for diverse users, including Community Health Workers (CHWs), the system \nfacilitates offline -first community workflows, longitudinal patient records, and clinical\n\ndecision support to enhance diagnostic accuracy and treatment efficiency. COMEMR \nprovides tailored treatment plans based on a patient’s risk -level, and these can be \nmonitored remotely Community Health Workers (CHWs) and clinical staff, who both \nplay a crucial role in our care delivery model. \nWhat's New in COMEMR 2.0? \nCOMEMR 2.0 expands the clinical disease areas to include m", "source": "kb\\What is ComEMR.pdf", "chunk_index": 3, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "872e5a12e4dbd7d59840f644962eb51ad3eee2f4e61cbcca02698c03192c8cf2", "title": "What is COMEMR ?", "text": ".0 expands the clinical disease areas to include malaria, antenatal care \n(ANC), postnatal care (PNC), child health, and integrated community case \nmanagement. In an upcoming release in March the platform will be enhanced to \ninclude tuberculosis (TB), HIV, and immunization workflows, fully supporting the entire \nspectrum of primary care conditions out of the box. The workflows have been built to \nensure adherence to both WHO and national guidelines. \nCOMEMR 2.0 has offline workflows designed for community health workers (CHWs) to \nensure seamless household registration and bi -directional linkages between \ncommunities and healthcare facilities. The platform's offline -first functionality ensures \nit operates effi ciently in areas with limited or no internet connectivity, syncing data once", "source": "kb\\What is ComEMR.pdf", "chunk_index": 4, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "3716b18db0e04a1d16e51c5e5b152c5a3d8b891c986d1badc257e66f7e69d87b", "title": "What is COMEMR ?", "text": "ted or no internet connectivity, syncing data once \nthe user regains connectivity. \nAt the facility level, COMEMR provides the ability for a clinician to perform a medical \nreview, confirm diagnoses, prescribe medications, and order medications to \ncomprehensively care for patients. COMEMR generates a customized treatment plan for \nthe patient which includes a combination of community -based assessments (tagged as \nfollow-up activities for the CHWs) and facility medical reviews (depending on the \nclinical workflow). Throughout the entire care p athway COMEMR generates a \nlongitudinal patient recor d for the clinician to track progress over time and meaningfully \nmeasure clinical outcomes. \nCOMEMR also features administrative support features that include advanced \ndashboards, automated per", "source": "kb\\What is ComEMR.pdf", "chunk_index": 5, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "d7c9c15a26d20dab80c5ba38a58c68605713f1edda4e753350d86f5d2eec85f0", "title": "What is COMEMR ?", "text": "s that include advanced \ndashboards, automated performance metrics, and autogenerated monthly reports to \nenhance operational efficiency by recording patient visits, diagnoses, treatments, and \noutcomes. COMEMR ’s data analytics capabilities offer real -time tracking, population \nhealth insights, and visualizations of key performance indicators (KPIs), generating \nactionable reports for patient care, program evaluation, and health surveillance. \nBuilt with interoperability in mind, the platform adheres to FHIR standards, allowing for \nseamless integration with DHIS2 and other national health systems. COMEMR 2.0 is \nbuilt on a modular architecture, allowing for flexibility and customization. COMEMR \nleverages open -source technologies and standards, ensuring interoperability and \nsustainabi", "source": "kb\\What is ComEMR.pdf", "chunk_index": 6, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "2afe093ad05b8661086b205ac225169926021e3eba6eceaac686d845c7ede3d2", "title": "What is COMEMR ?", "text": "andards, ensuring interoperability and \nsustainability. \nImpact\n\nMedtronic LABS is expanding its focus beyond non -communicable diseases to \nstrengthen primary healthcare systems with the introduction of COMEMR 2.0, built to \naddress the full spectrum of primary care diseases. By continuing to integrate \ntechnology -driven solutions with community -based care models, LABS is building \nsustainable, patient -centered healthcare ecosystems that extend beyond mere disease \nmanagement to improve health access and outcomes. \nThis transition places a strong emphasis on preventive care, early diagnosis, and \ncontinuous treatment through local partnerships, empowering primary care providers \nto offer comprehensive, long -term solutions. The focus on continuous care reassures \nour stakeholders about", "source": "kb\\What is ComEMR.pdf", "chunk_index": 7, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "2db5ba86a1d61ef776b31ae35742412e7e477be3029865a016c6b1a9155047f9", "title": "What is COMEMR ?", "text": " continuous care reassures \nour stakeholders about the quality of service we deliver. \nBy empowering COMEMR users across all levels of the health system and fostering bi -\ndirectional linkages between providers, LABS is building cohesive primary care \nnetworks that strengthen healthcare delivery and drive sustainable improvements in \ncommunity health. The goal is t o transform primary healthcare into a first -line defense \nagainst chronic diseases, thereby contributing to greater global health equity and \nenhancing community resilience. \nTo date, COMEMR -enabled programs have screened over one million patients with non -\ncommunicable diseases (NCDs), enrolled more than 270,000 individuals, and trained \napproximately 7,000 healthcare workers. These programs have had a measurable \nimpact on ", "source": "kb\\What is ComEMR.pdf", "chunk_index": 8, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "9540f94e5331ca8179e7c0e731a3b4bbdf0baad730020c2b91a1e84166038938", "title": "What is COMEMR ?", "text": ". These programs have had a measurable \nimpact on the health of patien ts, improving the lives of hypertensive patients by 60% \ncompared to the control group, and diabetic patients by 54% compared to the control \ngroup, on a global scale. Medtronic LABS has played a significant role in this success, \ndemonstrating substantial reductions in clinical indicators such as blood pressure and \nblood glucose through multiple peer -reviewed studies conducted across Bangladesh \nand various sub -Saharan African countries. \nOur outcomes data indicates the following: \n• Our Journal of Hypertension publication reports a -15.2 mmHg reduction in \nsystolic blood pressure in the uncontrolled subgroup. \n• Our Journal of Clinical Hypertension reports -17.6 mmHg reduction in systolic \nblood pressure in the unc", "source": "kb\\What is ComEMR.pdf", "chunk_index": 9, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "c61985e43a6017b6c2395f36fc18da0385c20d695ef98b3743b8f5ff55eb2b4d", "title": "What is COMEMR ?", "text": "g reduction in systolic \nblood pressure in the uncontrolled subgroup \n• Real-world evidence studies involving 84,700 hypertension patients over six \nmonths across six countries (Bangladesh, Ghana, Kenya, Rwanda, Sierra Leone, \nTanzania) show a reduction of 8.6 mmHg in systolic blood pressure, with control \nrates improving by 19 % . This also reflects a shift in the severity of hypertension \ntoward less severe classifications, suggesting a potential reduction in the risk of \ncomplications. That is, Base Line Grade 3 shows a 6% reduction, while Base Line \nGrade 2 shows a 9% reduction.\n\n• Real-world evidence studies of over 32,000 diabetic patients over six months, \n(which is 46% of patients with Diabetes who have completed at least 6 months in \nthe program) also across six countries (Banglad", "source": "kb\\What is ComEMR.pdf", "chunk_index": 10, "chunk_count": 12, "tokens_estimate": 800, "created_at": 1766077253}
{"ns": "default", "id": "dc3b6c342abdd8a4cbb5dc32712a2f267e137668b670b2eb7153aa52fff66f0a", "title": "What is COMEMR ?", "text": "n \nthe program) also across six countries (Bangladesh, Ghana, Kenya, Rwanda, \nSierra Leone, Tanzania), demonstrate improvements in both fasting and random \nblood glucose control. This positive change could lead to a reduced risk of \ndiabetic complications.", "source": "kb\\What is ComEMR.pdf", "chunk_index": 11, "chunk_count": 12, "tokens_estimate": 256, "created_at": 1766077253}
